{"files":[{"patch":"@@ -567,1 +567,3 @@\n-<p>You will need the Xcode command line developer tools to be able to build the JDK. (Actually, <em>only<\/em> the command line tools are needed, not the IDE.) The simplest way to install these is to run:<\/p>\n+<p>You will need the Xcode command line developer tools to be able to\n+build the JDK. (Actually, <em>only<\/em> the command line tools are\n+needed, not the IDE.) The simplest way to install these is to run:<\/p>\n@@ -569,1 +571,3 @@\n-<p>When updating Xcode, it is advisable to keep an older version for building the JDK. To use a specific version of Xcode you have multiple options:<\/p>\n+<p>When updating Xcode, it is advisable to keep an older version for\n+building the JDK. To use a specific version of Xcode you have multiple\n+options:<\/p>\n@@ -571,2 +575,10 @@\n-<li>Use <code>xcode-select -s<\/code> before running <code>configure<\/code>, e.g. <code>xcode-select -s \/Applications\/Xcode13.1.app<\/code>. The drawback is that the setting is system wide and you may have to revert it after an OpenJDK build.<\/li>\n-<li>Use configure option <code>--with-xcode-path<\/code>, e.g. <code>configure --with-xcode-path=\/Applications\/Xcode13.1.app<\/code> This allows using a specific Xcode version for an OpenJDK build, independently of the active Xcode version by <code>xcode-select<\/code>.<\/li>\n+<li>Use <code>xcode-select -s<\/code> before running\n+<code>configure<\/code>, e.g.\n+<code>xcode-select -s \/Applications\/Xcode13.1.app<\/code>. The drawback\n+is that the setting is system wide and you may have to revert it after\n+an OpenJDK build.<\/li>\n+<li>Use configure option <code>--with-xcode-path<\/code>, e.g.\n+<code>configure --with-xcode-path=\/Applications\/Xcode13.1.app<\/code>\n+This allows using a specific Xcode version for an OpenJDK build,\n+independently of the active Xcode version by\n+<code>xcode-select<\/code>.<\/li>\n@@ -574,1 +586,6 @@\n-<p>If you have recently (inadvertently) updated your OS and\/or Xcode version, and the JDK can no longer be built, please see the section on <a href=\"#problems-with-the-build-environment\">Problems with the Build Environment<\/a>, and <a href=\"#getting-help\">Getting Help<\/a> to find out if there are any recent, non-merged patches available for this update.<\/p>\n+<p>If you have recently (inadvertently) updated your OS and\/or Xcode\n+version, and the JDK can no longer be built, please see the section on\n+<a href=\"#problems-with-the-build-environment\">Problems with the Build\n+Environment<\/a>, and <a href=\"#getting-help\">Getting Help<\/a> to find\n+out if there are any recent, non-merged patches available for this\n+update.<\/p>\n","filename":"doc\/building.html","additions":22,"deletions":5,"binary":false,"changes":27,"status":"modified"}]}