{"files":[{"patch":"@@ -5377,1 +5377,1 @@\n-.SS Creating CDS Archives\n+.SS Manually Creating CDS Archives\n@@ -5379,1 +5379,1 @@\n-CDS archives can be created with several methods:\n+CDS archives can be created manually using several methods:\n@@ -5441,1 +5441,1 @@\n-.SS Creating a Dynamic CDS Archive File with \\-XX:SharedArchiveFile\n+.SS Creating a Dynamic CDS Archive File with \\-XX:ArchiveClassesAtExit\n@@ -5536,0 +5536,40 @@\n+.SS Creating Dynamic CDS Archive File with \\-XX:+AutoCreateSharedArchive\n+.PP\n+\\f[CB]\\-XX:+AutoCreateSharedArchive\\f[R] is a more convenient way of\n+creating\/using CDS archives.\n+Unlike the methods of manual CDS archive creation described in the\n+previous section, with \\f[CB]\\-XX:+AutoCreateSharedArchive\\f[R], it\\[aq]s\n+no longer necessary to have a separate trial run.\n+Instead, you can always run the application with the same command\\-line\n+and enjoy the benefits of CDS automatically.\n+.RS\n+.PP\n+\\f[CB]java\\ \\-XX:+AutoCreateSharedArchive\\ \\-XX:SharedArchiveFile=hello.jsa\\ \\-cp\\ hello.jar\\ Hello\\f[R]\n+.RE\n+.PP\n+If the specified archive file does not exist, it will be automatically\n+created at VM exit.\n+.PP\n+If the specified archive file exists, then the behavior depends on the\n+version of the JDK that created this archive:\n+.IP \\[bu] 2\n+If the archive was created by a JDK prior to version 19, it will be\n+ignored and will not be loaded.\n+Nor will it be updated.\n+.IP \\[bu] 2\n+If the archive was created by the same version of the JDK as the current\n+JVM, it will be loaded as a dynamic archive.\n+The archive will not be updated at VM exit.\n+.IP \\[bu] 2\n+In all other cases, the JVM will not load the archive, but will update\n+the archive at exit.\n+Thus, the archive will be ready to be loaded the next time the JVM is\n+launched with the same command line.\n+.PP\n+Note that the contents of the CDS archive file are specific to each\n+build of the JDK.\n+Therefore, if you switch to a different JDK build,\n+\\f[CB]\\-XX:+AutoCreateSharedArchive\\f[R] will automatically recreate the\n+archive to match the JDK.\n+If you intend to use this feature with an existing archive, you should\n+make sure that the archive is created by at least version 19 of the JDK.\n","filename":"src\/java.base\/share\/man\/java.1","additions":43,"deletions":3,"binary":false,"changes":46,"status":"modified"}]}