{"files":[{"patch":"@@ -893,22 +893,21 @@\n-<p>Currently, it is not possible to build OpenJDK fully reproducibly, but getting there is an ongoing effort. There are some things you can do to minimize non-determinism and make a larger part of the build reproducible:<\/p>\n-<ul>\n-<li>Turn on build system support for reproducible builds<\/li>\n-<\/ul>\n-<p>Add the flag <code>--enable-reproducible-build<\/code> to your <code>configure<\/code> command line. This will turn on support for reproducible builds where it could otherwise be lacking.<\/p>\n-<ul>\n-<li>Do not rely on <code>configure<\/code>'s default adhoc version strings<\/li>\n-<\/ul>\n-<p>Default adhoc version strings OPT segment include user name, source directory and timestamp. You can either override just the OPT segment using <code>--with-version-opt=&lt;any fixed string&gt;<\/code>, or you can specify the entire version string using <code>--with-version-string=&lt;your version&gt;<\/code>.<\/p>\n-<ul>\n-<li>Specify how the build sets <code>SOURCE_DATE_EPOCH<\/code><\/li>\n-<\/ul>\n-<p>The JDK build system will set the <code>SOURCE_DATE_EPOCH<\/code> environment variable during building, depending on the value of the <code>--with-source-date<\/code> option for <code>configure<\/code>. The default value is <code>updated<\/code>, which means that <code>SOURCE_DATE_EPOCH<\/code> will be set to the current time each time you are running <code>make<\/code>.<\/p>\n-<p>The <a href=\"https:\/\/reproducible-builds.org\/docs\/source-date-epoch\/\"><code>SOURCE_DATE_EPOCH<\/code> environment variable<\/a> is an industry standard, that many tools, such as gcc, recognize, and use in place of the current time when generating output.<\/p>\n-<p>For reproducible builds, you need to set this to a fixed value. You can use the special value <code>version<\/code> which will use the nominal release date for the current JDK version, or a value describing a date, either an epoch based timestamp as an integer, or a valid ISO-8601 date.<\/p>\n-<p><strong>Hint:<\/strong> If your build environment already sets <code>SOURCE_DATE_EPOCH<\/code>, you can propagate this using <code>--with-source-date=$SOURCE_DATE_EPOCH<\/code>.<\/p>\n-<ul>\n-<li>Specify a hotspot build time<\/li>\n-<\/ul>\n-<p>Set a fixed hotspot build time. This will be included in the hotspot library (<code>libjvm.so<\/code> or <code>jvm.dll<\/code>) and defaults to the current time when building hotspot. Use <code>--with-hotspot-build-time=&lt;any fixed string&gt;<\/code> for reproducible builds. It's a string so you don't need to format it specifically, so e.g. <code>n\/a<\/code> will do. Another solution is to use the <code>SOURCE_DATE_EPOCH<\/code> variable, e.g. <code>--with-hotspot-build-time=$(date --date=@$SOURCE_DATE_EPOCH)<\/code>.<\/p>\n-<ul>\n-<li>Copyright year<\/li>\n+<p>Currently, it is not possible to build OpenJDK fully reproducibly, but getting there is an ongoing effort.<\/p>\n+<p>An absolute prerequisite for building reproducible is to speficy a fixed build time, since time stamps are embedded in many file formats. This is done by setting the <code>SOURCE_DATE_EPOCH<\/code> environment variable, which is an <a href=\"https:\/\/reproducible-builds.org\/docs\/source-date-epoch\/\">industry standard<\/a>, that many tools, such as gcc, recognize, and use in place of the current time when generating output.<\/p>\n+<p>To generate reproducible builds, you must set <code>SOURCE_DATE_EPOCH<\/code> before running <code>configure<\/code>. The value in <code>SOURCE_DATE_EPOCH<\/code> will be stored in the configuration, and used by <code>make<\/code>. Setting <code>SOURCE_DATE_EPOCH<\/code> before running <code>make<\/code> will have no effect on the build.<\/p>\n+<p>You must also make sure your build does not rely on <code>configure<\/code>'s default adhoc version strings. Default adhoc version strings <code>OPT<\/code> segment include user name, source directory and timestamp. You can either override just the <code>OPT<\/code> segment using <code>--with-version-opt=&lt;any fixed string&gt;<\/code>, or you can specify the entire version string using <code>--with-version-string=&lt;your version&gt;<\/code>.<\/p>\n+<p>This is a typical example of how to build the JDK in a reproducible way:<\/p>\n+<pre><code>export SOURCE_DATE_EPOCH=946684800\n+bash configure --with-version-opt=adhoc\n+make<\/code><\/pre>\n+<p>Note that regardless if you specify a source date for <code>configure<\/code> or not, the JDK build system will set <code>SOURCE_DATE_EPOCH<\/code> for all build tools when building. If <code>--with-source-date<\/code> has the value <code>updated<\/code> (which is the default unless <code>SOURCE_DATE_EPOCH<\/code> is found by in the environment by <code>configure<\/code>), the source date value will be determined at build time.<\/p>\n+<p>There are several aspects of reproducible builds that can be individually adjusted by <code>configure<\/code> arguments. If any of these are given, they will override the value derived from <code>SOURCE_DATE_EPOCH<\/code>. These arguments are:<\/p>\n+<ul>\n+<li><p><code>--with-source-date<\/code><\/p>\n+<p>This option controls how the JDK build sets SOURCE_DATE_ EPOCH when building. It can be set to a value describing a date, either an epoch based timestamp as an integer, or a valid ISO-8601 date.<\/p>\n+<p>It can also be set to one of the special values <code>current<\/code>, <code>updated<\/code> or <code>version<\/code>. <code>current<\/code> means that the time of running <code>configure<\/code> will be used. <code>version<\/code> will use the nominal release date for the current JDK version. <code>updated<\/code>, which means that <code>SOURCE_DATE_EPOCH<\/code> will be set to the current time each time you are running <code>make<\/code>. All choices, except for <code>updated<\/code>, will set a fixed value for the source date timestamp.<\/p>\n+<p>When <code>SOURCE_DATE_EPOCH<\/code> is set, the default value for <code>--with-source-date<\/code> will be the value given by <code>SOURCE_DATE_EPOCH<\/code>. Otherwise, the default value is <code>updated<\/code>.<\/p><\/li>\n+<li><p><code>--with-hotspot-build-time<\/code><\/p>\n+<p>This option controls the build time string that will be included in the hotspot library (<code>libjvm.so<\/code> or <code>jvm.dll<\/code>). When the source date is fixed (e.g. by setting <code>SOURCE_DATE_EPOCH<\/code>), the default value for <code>--with-hotspot-build-time<\/code> will be an ISO 8601 representation of that time stamp. Otherwise the default value will be the current time when building hotspot.<\/p><\/li>\n+<li><p><code>--with-copyright-year<\/code><\/p>\n+<p>This option controls the copyright year in some generated text files. When the source date is fixed (e.g. by setting <code>SOURCE_DATE_EPOCH<\/code>), the default value for <code>--with-copyright-year<\/code> will be the year of that time stamp. Otherwise the default is the current year at the time of running configure. This can be overridden by <code>--with-copyright-year=&lt;year&gt;<\/code>.<\/p><\/li>\n+<li><p><code>--enable-reproducible-build<\/code><\/p>\n+<p>This option controls some additional behavior needed to make the build reproducible. When the source date is fixed (e.g. by setting <code>SOURCE_DATE_EPOCH<\/code>), this flag will be turned on by default. Otherwise, the value is determined by heuristics. If it is explicitly turned off, the build might not be reproducible.<\/p><\/li>\n@@ -916,1 +915,0 @@\n-<p>The copyright year in some generated text files are normally set to the current year. This can be overridden by <code>--with-copyright-year=&lt;year&gt;<\/code>. For fully reproducible builds, this needs to be set to a fixed value.<\/p>\n","filename":"doc\/building.html","additions":21,"deletions":23,"binary":false,"changes":44,"status":"modified"}]}