{"files":[{"patch":"@@ -47,1 +47,1 @@\n-A `@Setup` annotated method can provide custom arguments and set fields before a normal test is run. A normal test method can be annotated with `@Arguments(setup = \"setupMethodName\")` to specify which setup method is to be used.\n+A `@Setup` annotated method can provide custom arguments and set fields before a normal test is run. A `@Test` annotated method can additionally be annotated with `@Arguments(setup = \"setupMethodName\")` to define the dedicated `@Setup` method.\n@@ -49,1 +49,1 @@\n-More information on checked tests with a precise definition can be found in the Javadocs of [Setup](.\/Setup.java). Concrete examples on how to specify a setup method can be found in [SetupExample](..\/..\/..\/testlibrary_tests\/ir_framework\/examples\/SetupExample.java).\n+More information on normal tests with `@Setup` methods together with a precise definition can be found in the Javadocs of [Setup](.\/Setup.java). Concrete examples on how to specify a setup method can be found in [SetupExample](..\/..\/..\/testlibrary_tests\/ir_framework\/examples\/SetupExample.java).\n@@ -52,1 +52,1 @@\n-A `@Check` annotated method is invoked directly after a corresponding normal `@Test` annotated method. The user can perform various checks, such as test method return value and field value verification.\n+A `@Check(test = \"checkMethodName\")` annotated method is invoked directly after the `@Test` annotated method `checkMethodName()` is executed. The user can perform various checks, such as test method return value and field value verification.\n@@ -58,1 +58,1 @@\n-A custom run test gives full control over the invocation of the `@Test` annotated method to the user. The framework calls a dedicated `@Run` annotated method from which the user can invoke the `@Test` method according to their needs.\n+A custom run test gives full control over the invocation of the `@Test` annotated method to the user which includes argument and field setup as well as result and field value verification. The framework calls a dedicated `@Run` annotated method from which the user can invoke the `@Test` method according to their needs.\n","filename":"test\/hotspot\/jtreg\/compiler\/lib\/ir_framework\/README.md","additions":4,"deletions":4,"binary":false,"changes":8,"status":"modified"}]}