{"files":[{"patch":"@@ -413,1 +413,2 @@\n-  \/* POSIX requires that the file exists, Windows doesn't *\/\n+  \/\/ POSIX requires that the file exists; Windows tests for a valid drive letter \n+  \/\/ but may or may not test if the file exists. *\/\n@@ -419,1 +420,1 @@\n-  \/* test a non-existant path, but provide a short buffer *\/\n+  \/\/ Test a non-existant path, but provide a short buffer.\n@@ -422,1 +423,1 @@\n-  \/* Returns ENOENT on Linux, ENAMETOOLONG on Windows *\/\n+  \/\/ Reports ENOENT on Linux, ENAMETOOLONG on Windows.\n@@ -424,1 +425,1 @@\n-#if defined(_WINDOWS)\n+#ifdef _WINDOWS\n@@ -430,1 +431,1 @@\n-  \/* test a non-existant path, but provide an adequate buffer *\/\n+  \/\/ Test a non-existant path, but provide an adequate buffer.\n@@ -434,2 +435,2 @@\n-  \/* Returns ENOENT on Linux, 0 on SOME versions of Windows *\/\n-#if defined(_WINDOWS)\n+  \/\/ Reports ENOENT on Linux, may return 0 (and report an error) or buffer on some versions of Windows.\n+#ifdef _WINDOWS\n@@ -446,1 +447,1 @@\n-  \/* test an existing path using a large buffer *\/\n+  \/\/ Test an existing path using a large buffer.\n@@ -451,1 +452,1 @@\n-  \/* test an existing path using a buffer that is too small on a normal macOS install *\/\n+  \/\/ Test an existing path using a buffer that is too small on a normal macOS install.\n@@ -454,2 +455,2 @@\n-  \/* on MacOS, \/tmp is a symlink to \/private\/tmp, so doesn't fit in a small buffer. *\/\n-#if !defined(__APPLE__)\n+  \/\/ On MacOS, \/tmp is a symlink to \/private\/tmp, so doesn't fit in a small buffer.\n+#ifndef __APPLE__\n@@ -462,1 +463,1 @@\n-  \/* test an existing path using a buffer that is too small *\/\n+  \/\/ Test an existing path using a buffer that is too small.\n@@ -468,1 +469,1 @@\n-  \/* the following tests cause an assert inside os::realpath() in fastdebug mode *\/\n+  \/\/ The following tests cause an assert inside os::realpath() in fastdebug mode:\n","filename":"test\/hotspot\/gtest\/runtime\/test_os.cpp","additions":14,"deletions":13,"binary":false,"changes":27,"status":"modified"}]}