{"files":[{"patch":"@@ -1127,3 +1127,3 @@\n-     * Returns a more visible JTable Cell Focus Ring color\n-     * by manipulating hue, saturation and brightness for a\n-     * given selection background color.\n+     * Returns a prominent and visible Cell Focus Ring color by\n+     * manipulating hue, saturation and setting the brightness\n+     * to 100% for a given selection background color.\n@@ -1131,6 +1131,10 @@\n-     * If selectedBackgroundColor is equal to white or\n-     * black, the returned focus ring color is Gray. If the\n-     * selectedBackgroundColor is any shade of Gray then, the\n-     * returned focus ring color is White\/Black depending on\n-     * the rgb values. For all other values of rgb, a more\n-     * prominent and visible color is returned.\n+     * If selectedBackgroundColor is equal to white or black, the\n+     * returned focus ring color is Gray. If the selectedBackgroundColor\n+     * is any shade of Gray then, the returned focus ring color is\n+     * White\/Black depending on the rgb values. For all other values\n+     * of rgb, a more prominent and visible color is returned. Hue\n+     * and saturation are obtained depending on the current hue and\n+     * saturation values of selectionBackgroundColor. The brightness\n+     * of new color (for focus ring) is always set to 100% to ensure\n+     * that the brightest shade for the obtained hue and saturation\n+     * offset values is returned.\n@@ -1188,1 +1192,2 @@\n-        \/\/brightness adjustment - brightness set to 100%\n+        \/\/brightness adjustment - brightness set to 100%, always return the\n+        \/\/brightest color for the obtained hue and saturation values\n","filename":"src\/java.desktop\/macosx\/classes\/com\/apple\/laf\/AquaLookAndFeel.java","additions":15,"deletions":10,"binary":false,"changes":25,"status":"modified"},{"patch":"@@ -33,2 +33,1 @@\n-import javax.swing.UnsupportedLookAndFeelException;\n-import javax.swing.SwingUtilities;\n+import java.awt.Color;\n@@ -36,0 +35,1 @@\n+import javax.swing.SwingUtilities;\n@@ -37,2 +37,1 @@\n-import java.awt.*;\n-import java.lang.Exception;\n+import javax.swing.UnsupportedLookAndFeelException;\n","filename":"test\/jdk\/javax\/swing\/JTable\/7124282\/JTableFocusRingTest.java","additions":3,"deletions":4,"binary":false,"changes":7,"status":"modified"}]}