{"files":[{"patch":"@@ -34,3 +34,13 @@\n- * by its character. Such key combination is dependent on the keyboard\n- * functional layout configured by the user at the time of key combination\n- * matching.\n+ * by its character. This is the preferred way to specify a shortcut\n+ * involving a symbol or punctuation.\n+ *\n+ * <p>\n+ *\n+ * The location of a symbol or punctuation mark can vary from one keyboard\n+ * layout to another. For example, on an English QWERTY layout the '+' symbol\n+ * is the shifted character on {@link KeyCode#EQUALS} but on a German layout\n+ * it is the unmodified character on {@link KeyCode#PLUS}. The '+' symbol\n+ * also appears as {@link KeyCode#ADD} on the numeric keypad. When matching\n+ * against a key event a key character combination queries the OS to\n+ * determine which keys the character appears on in the current layout.\n+ *\n@@ -98,2 +108,2 @@\n-     * translated to the key code which is capable of producing the character\n-     * in the current keyboard layout and then the resulting key code together\n+     * translated to the key codes which are capable of producing the character\n+     * in the current keyboard layout and then the resulting key codes together\n","filename":"modules\/javafx.graphics\/src\/main\/java\/javafx\/scene\/input\/KeyCharacterCombination.java","additions":15,"deletions":5,"binary":false,"changes":20,"status":"modified"},{"patch":"@@ -33,0 +33,15 @@\n+ *\n+ * <p>\n+ *\n+ * For a given keyboard layout each key is assigned a code which does not vary\n+ * and is not affected by the state of the modifier keys. For keys that\n+ * generate printable characters the code will usually be based on the\n+ * character generated when no modifier key is held down. The exceptions are\n+ * {@link KeyCode#A} through {@link KeyCode#Z} which are assigned to keys\n+ * even on layouts which don't generate those letters (such as Greek). This\n+ * ensures that common letter-based shortcuts are accessible on all layouts.\n+ *\n+ * <p>\n+ *\n+ * Keys that generate characters with accents or other diacritic marks are\n+ * usually assigned a code of {@link KeyCode#UNDEFINED}.\n","filename":"modules\/javafx.graphics\/src\/main\/java\/javafx\/scene\/input\/KeyCode.java","additions":15,"deletions":0,"binary":false,"changes":15,"status":"modified"},{"patch":"@@ -34,3 +34,3 @@\n- * by its {@code KeyCode}. Such key combination is independent on the keyboard\n- * functional layout configured by the user at the time of key combination\n- * matching.\n+ * by its {@link KeyCode}. This is the recommended way to specify a shortcut\n+ * that does not involve a symbol or punctuation (for such a shortcut a\n+ * {@link KeyCharacterCombination} is preferred).\n","filename":"modules\/javafx.graphics\/src\/main\/java\/javafx\/scene\/input\/KeyCodeCombination.java","additions":3,"deletions":3,"binary":false,"changes":6,"status":"modified"},{"patch":"@@ -76,0 +76,4 @@\n+ * On Mac and Linux dead key sequences are handled using input method events\n+ * instead of key events. See {@link InputMethodEvent}.\n+ *\n+ * <p>\n","filename":"modules\/javafx.graphics\/src\/main\/java\/javafx\/scene\/input\/KeyEvent.java","additions":4,"deletions":0,"binary":false,"changes":4,"status":"modified"}]}