{"files":[{"patch":"@@ -4185,3 +4185,4 @@\n-\/\/ Clone Template Assertion Predicates to a target loop. The target loop is the original, not-cloned loop.\n-\/\/ This is currently only used for StressDuplicateLoopBackedge.\n-class CloneAssertionPredicatesVisitor : public PredicateVisitor {\n+\/\/ Moves Template Assertion Predicates to a target loop by cloning and killing the old ones. The target loop is the\n+\/\/ original, not-cloned loop. This is currently only used with StressLoopBackedge which is a develop flag only and\n+\/\/ false with product builds. We can therefore guard it with an ifdef. More details can be found at the use-site.\n+class MoveAssertionPredicatesVisitor : public PredicateVisitor {\n@@ -4192,1 +4193,1 @@\n-  CloneAssertionPredicatesVisitor(LoopNode* target_loop_head,\n+  MoveAssertionPredicatesVisitor(LoopNode* target_loop_head,\n@@ -4198,1 +4199,1 @@\n-  NONCOPYABLE(CloneAssertionPredicatesVisitor);\n+  NONCOPYABLE(MoveAssertionPredicatesVisitor);\n@@ -4207,1 +4208,0 @@\n-\n@@ -4209,0 +4209,1 @@\n+\n@@ -4492,1 +4493,3 @@\n-    \/\/ the inner counted loop and kill the old ones.\n+    \/\/ the inner counted loop and kill the old ones. We only need to do this with debug builds because\n+    \/\/ StressDuplicateBackedge is a devlop flag and false by default. Without StressDuplicateBackedge 'head' will be a\n+    \/\/ non-counted loop, and thus we have no Template Assertion Predicates above the old loop to move down.\n@@ -4495,2 +4498,2 @@\n-    CloneAssertionPredicatesVisitor clone_assertion_predicates_visitor(head, node_in_body, this);\n-    predicate_iterator.for_each(clone_assertion_predicates_visitor);\n+    MoveAssertionPredicatesVisitor move_assertion_predicates_visitor(head, node_in_body, this);\n+    predicate_iterator.for_each(move_assertion_predicates_visitor);\n","filename":"src\/hotspot\/share\/opto\/loopopts.cpp","additions":12,"deletions":9,"binary":false,"changes":21,"status":"modified"},{"patch":"@@ -150,1 +150,1 @@\n- * @bug 8288981 8350577\n+ * @bug 8288981 8350577 0360510\n","filename":"test\/hotspot\/jtreg\/compiler\/predicates\/assertion\/TestAssertionPredicates.java","additions":1,"deletions":1,"binary":false,"changes":2,"status":"modified"},{"patch":"@@ -30,0 +30,1 @@\n+ * @run main compiler.predicates.assertion.TestStressDuplicateBackedgeWithAssertionPredicate\n@@ -50,1 +51,0 @@\n-        \/\/\n@@ -56,1 +56,1 @@\n-        \/\/              |                             Loop\n+        \/\/              |                             Loop       # Outer Non-Counted Loop (new)\n@@ -58,1 +58,1 @@\n-        \/\/                                        Counted Loop\n+        \/\/                                        Counted Loop   # Inner Counted Loop (old)\n@@ -60,5 +60,6 @@\n-        \/\/ The Template Assertion Predicates are still at the outer loop. As a result, we find them to\n-        \/\/ be useless in the next predicate elimination call with EliminateUselessPredicates because\n-        \/\/ they cannot be found from the inner counted loop. However, we have verification code in place\n-        \/\/ that checks that we can only find useless Template Assertion Predicates if the associated\n-        \/\/ counted loop node is dead. This is not the case and we crash with an assertion failure.\n+        \/\/ 7) After the transformation, the Template Assertion Predicates are still at the Outer Non-Counted Loop.\n+        \/\/    As a result, we find them to be useless in the next predicate elimination call with\n+        \/\/    EliminateUselessPredicates because they cannot be found from the Inner counted Loop (we stop at\n+        \/\/    Loop which is not a predicate). However, we have verification code in place that checks that we\n+        \/\/    can only find useless Template Assertion Predicates if the associated counted loop node is dead.\n+        \/\/    This is not the case and we crash with an assertion failure.\n@@ -66,1 +67,1 @@\n-        \/\/ The fix is to move the Template Assertion Predicates to the inner counted loop.\n+        \/\/   The fix is to move the Template Assertion Predicates to the Inner Counted Loop again.\n@@ -72,1 +73,1 @@\n-            \/\/ 1) We need an inner loop to make sure the outer counter loop is not strip mined.\n+            \/\/ 1) We need an inner empty loop to make sure the outer counter loop is not strip mined.\n","filename":"test\/hotspot\/jtreg\/compiler\/predicates\/assertion\/TestStressDuplicateBackedgeWithAssertionPredicate.java","additions":11,"deletions":10,"binary":false,"changes":21,"status":"modified"}]}