{"files":[{"patch":"@@ -133,5 +133,5 @@\n-\/\/ that the control path is also properly folded, we insert an If node with a OpaqueConstantBoolNode as condition. During\n-\/\/ macro expansion, we replace the OpaqueConstantBoolNodes with true in product builds such that the actually unneeded checks\n-\/\/ are folded and do not end up in the emitted code. In debug builds, we keep the actual checks as additional\n-\/\/ verification code (i.e. removing OpaqueConstantBoolNodes and use the BoolNode inputs instead). For more details, also see\n-\/\/ GraphKit::must_be_not_null().\n+\/\/ that the control path is also properly folded, we insert an If node with a OpaqueConstantBoolNode as condition.\n+\/\/ During macro expansion, we replace the OpaqueConstantBoolNodes with true in product builds such that the actually\n+\/\/ unneeded checks are folded and do not end up in the emitted code. In debug builds, we keep the actual checks as\n+\/\/ additional verification code (i.e. removing OpaqueConstantBoolNodes and use the BoolNode inputs instead). For more\n+\/\/ details, also see GraphKit::must_be_not_null().\n@@ -142,4 +142,4 @@\n-\/\/ OpaqueConstantBoolNode before the If node in the guard. During macro expansion, we replace the OpaqueConstantBoolNode with false\n-\/\/ in product builds such that the actually unneeded guards are folded and do not end up in the emitted code. In debug\n-\/\/ builds, we keep the actual checks as additional verification code (i.e. removing OpaqueConstantBoolNodes and use the\n-\/\/ BoolNode inputs instead).\n+\/\/ OpaqueConstantBoolNode before the If node in the guard. During macro expansion, we replace the OpaqueConstantBoolNode\n+\/\/ with false in product builds such that the actually unneeded guards are folded and do not end up in the emitted code.\n+\/\/ In debug builds, we keep the actual checks as additional verification code (i.e. removing OpaqueConstantBoolNodes and\n+\/\/ use the BoolNode inputs instead).\n@@ -150,1 +150,1 @@\n-  OpaqueConstantBoolNode(Compile* C, Node* tst, bool positive) : Node(nullptr, tst), _constant(positive) {\n+  OpaqueConstantBoolNode(Compile* C, Node* tst, bool constant) : Node(nullptr, tst), _constant(constant) {\n","filename":"src\/hotspot\/share\/opto\/opaquenode.hpp","additions":10,"deletions":10,"binary":false,"changes":20,"status":"modified"}]}