{"files":[{"patch":"@@ -212,2 +212,2 @@\n-<p>Do not use the standard global allocation and deallocation functions (operator new and related functions). Typically, uses of the global operator new are inadvertent and therefore often associated with memory leaks. Use of these functions by HotSpot code is disabled for some platforms.<\/p>\n-<p>Rationale: HotSpot often uses &quot;resource&quot; or &quot;arena&quot; allocation. Even where heap allocation is used, the standard global functions are avoided in favor of wrappers around malloc and free that support the VM's Native Memory Tracking (NMT) feature.<\/p>\n+<p>Do not use the standard global allocation and deallocation functions (operator new and related functions). Use of these functions by HotSpot code is disabled for some platforms.<\/p>\n+<p>Rationale: HotSpot often uses &quot;resource&quot; or &quot;arena&quot; allocation. Even where heap allocation is used, the standard global functions are avoided in favor of wrappers around malloc and free that support the VM's Native Memory Tracking (NMT) feature. Typically, uses of the global operator new are inadvertent and therefore often associated with memory leaks.<\/p>\n","filename":"doc\/hotspot-style.html","additions":2,"deletions":2,"binary":false,"changes":4,"status":"modified"},{"patch":"@@ -466,3 +466,2 @@\n-(operator new and related functions). Typically, uses of the global\n-operator new are inadvertent and therefore often associated with memory\n-leaks. Use of these functions by HotSpot code is disabled for some platforms.\n+(operator new and related functions).  Use of these functions by HotSpot\n+code is disabled for some platforms.\n@@ -473,1 +472,3 @@\n-VM's Native Memory Tracking (NMT) feature.\n+VM's Native Memory Tracking (NMT) feature.  Typically, uses of the global\n+operator new are inadvertent and therefore often associated with memory\n+leaks.\n","filename":"doc\/hotspot-style.md","additions":5,"deletions":4,"binary":false,"changes":9,"status":"modified"}]}