{"files":[{"patch":"@@ -5379,1 +5379,1 @@\n-CDS archives can be created manually with several methods:\n+CDS archives can be created manually using several methods:\n@@ -5536,1 +5536,1 @@\n-.SS Using Dynamic CDS Archive File with \\-XX:+AutoCreateSharedArchive\n+.SS Creating Dynamic CDS Archive File with \\-XX:+AutoCreateSharedArchive\n@@ -5549,0 +5549,6 @@\n+.PP\n+If the specified archive file does not exist, it will be automatically\n+created at VM exit.\n+.PP\n+If the specified archive file exists, then the behavior depends on the\n+version of the JDK that created this archive:\n@@ -5550,2 +5556,3 @@\n-If the specified archive file exists and is created by the same version\n-of the JDK, the JVM will load this file as a dynamic archive.\n+If the archive was created by a JDK prior to version 19, it will be\n+ignored and will not be loaded.\n+Nor will it be updated.\n@@ -5553,5 +5560,8 @@\n-Otherwise the JVM will not load the specified archive.\n-Instead, it will automatically create (or update) the archive file at\n-exit.\n-As a result, the next time you run the same command again, the archive\n-will be available and ready to be used.\n+If the archive was created by the same version of the JDK as the current\n+JVM, it will be loaded as a dynamic archive.\n+The archive will not be updated at VM exit.\n+.IP \\[bu] 2\n+In all other cases, the JVM will not load the archive, but will update\n+the archive at exit.\n+Thus, the archive will be ready to be loaded the next time the JVM is\n+launched with the same command line.\n@@ -5559,3 +5569,3 @@\n-The contents of the CDS archive file are specific to each version of the\n-JDK.\n-Therefore, if you upgrade to a newer JDK,\n+Note that the contents of the CDS archive file are specific to each\n+build of the JDK.\n+Therefore, if you switch to a different JDK build,\n@@ -5563,4 +5573,3 @@\n-archive.\n-.PP\n-To use this option, the specified CDS archive must be created by JDK 19\n-or above.\n+archive to match the JDK.\n+If you intend to use this feature with an existing archive, you should\n+make sure that the archive is created by at least version 19 of the JDK.\n","filename":"src\/java.base\/share\/man\/java.1","additions":25,"deletions":16,"binary":false,"changes":41,"status":"modified"}]}