{"files":[{"patch":"@@ -204,1 +204,1 @@\n-  \/\/ 0...00000 free               (Empty, should never happen)\n+  \/\/ 0...00000 free               (Empty, should never happen on a top-level ContainerPtr)\n@@ -212,1 +212,4 @@\n-  using ContainerPtr = void*;\n+  \/\/\n+  \/\/ The container's pointer starts off with an inline container and is then subsequently\n+  \/\/ coarsened as more cards are added.\n+  \/\/\n@@ -214,3 +217,20 @@\n-  \/\/ ContainerInlinePtr -> ContainerArrayOfCards -> ContainerHowl -> Full\n-  \/\/ Corsening of containers inside the ContainerHowl happens in the order:\n-  \/\/ ContainerInlinePtr -> ContainerArrayOfCards -> ContainerBitMap -> Full\n+  \/\/   ContainerInlinePtr -> ContainerArrayOfCards -> ContainerHowl -> Full\n+  \/\/\n+  \/\/ There is intentionally no bitmap based container that covers a full region; first,\n+  \/\/ a whole region is covered very well (and more flexibly) using the howl container and\n+  \/\/ even then the overhead of the ContainerPtr array with all-bitmaps vs. a single bitmap\n+  \/\/ is negligible, and most importantly transferring such a Howl container to a\n+  \/\/ \"Full Region Bitmap\" is fairly hard without missing entries that are added by\n+  \/\/ concurrent threads.\n+  \/\/\n+  \/\/ Howl containers are basically arrays of containers. An entry starts off with\n+  \/\/ Free. Further corsening of containers inside the ContainerHowl happens in the order:\n+  \/\/\n+  \/\/   Free -> ContainerInlinePtr -> ContainerArrayOfCards -> ContainerBitMap -> Full\n+  \/\/\n+  \/\/ Throughout the code it is assumed (and checked) that the last two bits of the encoding\n+  \/\/ for Howl (0b11) is assumed to be the same as the last two bits for \"FullCardSet\"; this\n+  \/\/ has been done in various places to not be required to check for a \"FullCardSet\" first\n+  \/\/ all the time in iteration code (only if there is a Howl card set container, that is\n+  \/\/ fairly uncommon).\n+  using ContainerPtr = void*;\n","filename":"src\/hotspot\/share\/gc\/g1\/g1CardSet.hpp","additions":25,"deletions":5,"binary":false,"changes":30,"status":"modified"}]}