{"files":[{"patch":"@@ -207,9 +207,12 @@\n- * <b>BCP 47 deviation:<\/b> Although BCP 47 requires field values to be registered\n- * in the IANA Language Subtag Registry, the {@code Locale} class\n- * does not validate this requirement. For example, the variant code <em>\"foobar\"<\/em>\n- * is well-formed since it is composed of 5 to 8 alphanumerics, but is not defined\n- * the IANA Language Subtag Registry. The {@link Builder}\n- * only checks if an individual field satisfies the syntactic\n- * requirement (is well-formed), but does not validate the value\n- * itself. Conversely, {@link #of(String, String, String) Locale::of} and its\n- * overloads do not make any syntactic checks on the input.\n+ * <b>BCP 47 deviation:<\/b> BCP47 defines the following two levels of\n+ * <a href=\"https:\/\/datatracker.ietf.org\/doc\/html\/rfc5646#section-2.2.9\">conformance<\/a>,\n+ * \"valid\" and \"well-formed\". A valid tag requires that it is well-formed, its\n+ * subtag values are registered in the IANA Language Subtag Registry, and it does not\n+ * contain duplicate variant or extension singleton subtags. The {@code Locale}\n+ * class does not enforce that subtags are registered in the Subtag Registry.\n+ * {@link Builder} only checks if an individual field satisfies the syntactic\n+ * requirement (is well-formed). When passed duplicate variants, {@code Builder}\n+ * accepts and includes them. When passed duplicate extension singletons, {@code\n+ * Builder} accepts but ignores the duplicate key and its associated value.\n+ * Conversely, {@link #of(String, String, String) Locale::of} and its\n+ * overloads do not check if the input is well-formed at all.\n@@ -249,1 +252,5 @@\n- * form as a locale type subtag).\n+ * form as a locale type subtag). Duplicate locale attributes as well\n+ * as locale keys do not convey meaning. For methods in {@code Locale} and\n+ * {@code Locale.Builder} that accept extensions, occurrences of duplicate\n+ * locale attributes as well as locale keys and their associated type are accepted\n+ * but ignored.\n@@ -564,0 +571,2 @@\n+ * @spec https:\/\/www.rfc-editor.org\/info\/rfc6067\n+ *      RFC 6067: BCP 47 Extension U\n@@ -1746,0 +1755,6 @@\n+     * <p>Duplicate variants are accepted and included by the builder.\n+     * However, duplicate extension singleton keys and their associated type\n+     * are accepted but ignored. The same behavior applies to duplicate locale\n+     * keys and attributes within a U extension. Note that subsequent subtags after\n+     * the occurrence of a duplicate are not ignored.\n+     *\n@@ -2720,0 +2735,5 @@\n+         * <p>Duplicate variants are accepted and included by the builder.\n+         * However, duplicate extension singleton keys and their associated type\n+         * are accepted but ignored. The same behavior applies to duplicate locale\n+         * keys and attributes within a U extension.\n+         *\n@@ -2811,1 +2831,2 @@\n-         * subtags, or an exception is thrown.\n+         * subtags, or an exception is thrown. Duplicate variants are\n+         * accepted and included by the builder.\n@@ -2844,1 +2865,2 @@\n-         * pairs with those defined in the extension.\n+         * pairs with those defined in the extension. Duplicate locale attributes\n+         * as well as locale keys and their associated type are accepted but ignored.\n","filename":"src\/java.base\/share\/classes\/java\/util\/Locale.java","additions":34,"deletions":12,"binary":false,"changes":46,"status":"modified"}]}