{"files":[{"patch":"@@ -127,6 +127,5 @@\n-\t<LI><P>SOCKS<BR>This is another type of proxy. It allows for lower-level\n-\ttype of tunneling since it works at the TCP level. In effect,\n-\tin the Java(tm) platform setting a SOCKS proxy server will result in\n-\tall TCP connections to go through that proxy, unless other proxies\n-\tare specified. If SOCKS is supported by a Java SE implementation, the\n-\tfollowing properties will be used:<\/P>\n+\t<LI><P>SOCKS<BR>The SOCKS proxy enables a lower-level type of tunneling\n+\tbecause it works at the TCP level. Specifying a SOCKS proxy server\n+\tresults in all java.net TCP connections going through that proxy server\n+\tunless other proxies are specified. The following proxy settings\n+\tare used by the SOCKS protocol handler.<\/P>\n@@ -138,1 +137,1 @@\n-                <LI><P><B>{@systemProperty socksProxyVersion}<\/B> (default: {@code 5})<BR>\n+\t\t<LI><P><B>{@systemProperty socksProxyVersion}<\/B> (default: {@code 5})<BR>\n@@ -143,9 +142,0 @@\n-\t\t<LI><P><B>{@systemProperty java.net.socks.username}<\/B> (default: &lt;none&gt;)<BR>\n-\t        Username to use if the SOCKSv5 server asks for authentication\n-\t        and no {@link java.net.Authenticator java.net.Authenticator} instance was found.<\/P>\n-\t\t<LI><P><B>{@systemProperty java.net.socks.password}<\/B> (default: &lt;none&gt;)<BR>\n-\t        Password to use if the SOCKSv5 server asks for authentication\n-\t        and no {@code java.net.Authenticator} instance was found.<\/P>\n-\t\t<P>Note that if no authentication is provided with either the above\n-\t\tproperties or an Authenticator, and the proxy requires one, then\n-\t\tthe <B>user.name<\/B> property will be used with no password.<\/P>\n@@ -195,2 +185,1 @@\n-\t<LI><P><B>{@systemProperty http.auth.digest.cnonceRepeat}<\/B> (default: {@code 5})<\/P>\n-\t<P>These 3 properties modify the behavior of the HTTP digest\n+\t<P>These properties modify the behavior of the HTTP digest\n@@ -201,1 +190,1 @@\n-\tfirst two properties can be set to true to enforce this check for\n+\tproperties can be set to true to enforce this check for\n@@ -203,6 +192,0 @@\n-\t<P>It is usually not necessary to change the third property. It\n-\tdetermines how many times a cnonce value is re-used. This can be\n-\tuseful when the MD5-sess algorithm is being used. Increasing this\n-\tvalue reduces the computational overhead on both client and server\n-\tby reducing the amount of material that has to be hashed for each\n-\tHTTP request.<\/P>\n","filename":"src\/java.base\/share\/classes\/java\/net\/doc-files\/net-properties.html","additions":8,"deletions":25,"binary":false,"changes":33,"status":"modified"}]}