{"files":[{"patch":"@@ -32,8 +32,14 @@\n- * recognized by {@code vmIntrinsics.hpp} and may be subject to intrinsification\n- * by the HotSpot VM.  (See {@code LibraryCallKit::try_to_inline} in {@code\n- * library_call.cpp} for logic that checks if an intrinsic is available and\n- * applicable at a given call site.)  Intrinsification replaces a candidate\n- * method's body, bytecode or native, with handwritten platform assembly and\/or\n- * compiler IR.  Many Java library methods have properties that cannot be\n- * deduced by the compiler for optimization, or can utilize specific hardware\n- * instructions not modeled by the compiler IR, making intrinsics necessary.\n+ * recognized by {@code vmIntrinsics.hpp} for special treatment by the HotSpot\n+ * VM, unlike the other methods.  The HotSpot VM checks, when loading a class,\n+ * the consistency of recognized methods and {@code @IntrinsicCandidate}\n+ * annotations, unless the {@code CheckIntrinsics} VM flag is disabled.\n+ *\n+ * <h2 id=\"intrinsification\">Intrinsification<\/h2>\n+ * The most frequently special treatment is intrinsification, which replaces a\n+ * candidate method's body, bytecode or native, with handwritten platform\n+ * assembly and\/or compiler IR.  (See {@code LibraryCallKit::try_to_inline} in\n+ * {@code library_call.cpp} for logic that checks if an intrinsic is available\n+ * and applicable at a given call site.)  Many Java library methods have\n+ * properties that cannot be deduced by the compiler for optimization, or can\n+ * utilize specific hardware instructions not modeled by the compiler IR, making\n+ * intrinsics necessary.\n@@ -85,4 +91,1 @@\n- * <\/blockquote><p>\n- * The HotSpot VM checks, when loading a class, the consistency of recognized\n- * methods and {@code @IntrinsicCandidate} annotations, unless the {@code\n- * CheckIntrinsics} VM flag is disabled.\n+ * <\/blockquote>\n","filename":"src\/java.base\/share\/classes\/jdk\/internal\/vm\/annotation\/IntrinsicCandidate.java","additions":15,"deletions":12,"binary":false,"changes":27,"status":"modified"}]}