{"files":[{"patch":"@@ -7,1 +7,1 @@\n-```\n+```java\n@@ -31,1 +31,1 @@\n-```\n+```java\n@@ -54,1 +54,1 @@\n-Adding this event handler will make ScrollPane react to navigation keys as it did before the update.\n+Adding this event handler will make `ScrollPane` react to navigation keys as it did before the update.\n","filename":"doc-files\/notes\/24\/JDK-8340852-ScrollPane.md","additions":3,"deletions":3,"binary":false,"changes":6,"status":"modified"},{"patch":"@@ -66,1 +66,1 @@\n-### Pluggable Image Loading via javax.imageio\n+### Pluggable Image Loading via `javax.imageio`\n@@ -70,1 +70,1 @@\n-Applications that want to use this feature can use existing open-source Image I\/O extension libraries, or register a custom Image I\/O service provider instance with the IIORegistry class. Refer to the Java Image I\/O documentation for more information.\n+Applications that want to use this feature can use existing open-source Image I\/O extension libraries, or register a custom Image I\/O service provider instance with the `IIORegistry` class. Refer to the Java [Image I\/O documentation](https:\/\/docs.oracle.com\/en\/java\/javase\/23\/docs\/api\/java.desktop\/javax\/imageio\/package-summary.html) for more information.\n@@ -74,1 +74,1 @@\n-### ScrollPane Consumes Navigation Keys Only When It Has Direct Focus\n+### `ScrollPane` Consumes Navigation Keys Only When It Has Direct Focus\n@@ -90,1 +90,1 @@\n-The following exception will be thrown when the JavaFX runtime is initialized if the Security Manager is enabled:\n+The following exception will be thrown when the JavaFX runtime is initialized with the Security Manager enabled:\n@@ -100,1 +100,1 @@\n-### JavaFX Warning Printed for Use of Terminally Deprecated Methods in sun.misc.Unsafe\n+### JavaFX Warning Printed for Use of Terminally Deprecated Methods in `sun.misc.Unsafe`\n@@ -154,0 +154,2 @@\n+See the API docs for a list of [new APIs](https:\/\/openjfx.io\/javadoc\/23\/new-list.html) and [deprecated APIs](https:\/\/openjfx.io\/javadoc\/23\/deprecated-list.html) in each release.\n+\n","filename":"doc-files\/release-notes-24.md","additions":7,"deletions":5,"binary":false,"changes":12,"status":"modified"}]}