{"files":[{"patch":"@@ -107,0 +107,24 @@\n+       \/*\n+        * The following code is based on: docs\/api\/jdk.management\/com\/sun\/management\/DiagnosticCommandMBean.html\n+        *\n+        * Copied from the documentation for reference:\n+        *\n+        * ... The DiagnosticCommandMBean is generated at runtime and is subject to modifications during the lifetime of\n+        * the Java virtual machine. A diagnostic command is represented as an operation of the DiagnosticCommandMBean\n+        * interface. Each diagnostic command has:\n+        *\n+        *    - the diagnostic command name which is the name being referenced in the HotSpot Virtual Machine\n+        *    - the MBean operation name which is the name generated for the diagnostic command operation invocation. The\n+        *      MBean operation name is implementation dependent\n+        *\n+        * The recommended way to transform a diagnostic command name into a MBean operation name is as follows:\n+        *\n+        *    - All characters from the first one to the first dot are set to be lower-case characters\n+        *    - Every dot or underline character is removed and the following character is set to be an upper-case character\n+        *    - All other characters are copied without modification\n+        *\n+        * A diagnostic command may or may not support options or arguments. All the operations return String and\n+        * either take no parameter for operations that do not support any option or argument, or take a String[]\n+        * parameter for operations that support at least one option or argument. Each option or argument must be stored in\n+        * a single String.\n+        *\/\n@@ -110,0 +134,4 @@\n+\n+            \/\/ The DiagnosticCommand MBean operations expect a String array parameter for command arguments\n+            \/\/ Even though AOT.end_recording doesn't need any arguments, you still need to pass an empty String array\n+            \/\/ The MBean framework requires you to specify both the parameters and their types (signatures)\n@@ -112,0 +140,2 @@\n+\n+            \/\/ The JCmd AOT.end_recording is invoked using 'aotEndRecording'\n@@ -113,0 +143,2 @@\n+\n+            \/\/ The result is the string output from the command\n","filename":"test\/hotspot\/jtreg\/runtime\/cds\/appcds\/aotCache\/DiagnosticCommandMBeanTest.java","additions":32,"deletions":0,"binary":false,"changes":32,"status":"modified"}]}