{"files":[{"patch":"@@ -578,4 +578,5 @@\n-     * Creates a new and empty file, failing if the file already exists. The\n-     * check for the existence of the file and the creation of the new file if\n-     * it does not exist are a single operation that is atomic with respect to\n-     * all other filesystem activities that might affect the directory.\n+     * Creates a new and empty file, failing if {@code path} locates an existing\n+     * file. The check for the existence of the file and the creation of the new\n+     * file if it does not exist are a single operation that is atomic with\n+     * respect to all other filesystem activities that might affect the\n+     * directory.\n@@ -601,1 +602,1 @@\n-     *          If a file of that name already exists\n+     *          if {@code path} locates an existing file\n@@ -614,1 +615,2 @@\n-     * Creates a new directory. The check for the existence of the file and the\n+     * Creates a new directory, failing if {@code dir} locates an existing\n+     * file. The check for the existence of the file and the\n@@ -639,2 +641,2 @@\n-     *          if a directory could not otherwise be created because a file of\n-     *          that name already exists <i>(optional specific exception)<\/i>\n+     *          if {@code dir} locates an existing file\n+     *          <i>(optional specific exception)<\/i>\n@@ -679,2 +681,2 @@\n-     *          if {@code dir} exists but is not a directory <i>(optional specific\n-     *          exception)<\/i>\n+     *          if {@code dir} locates an existing file that is not a directory\n+     *          <i>(optional specific exception)<\/i>\n@@ -933,1 +935,2 @@\n-     * Creates a symbolic link to a target <i>(optional operation)<\/i>.\n+     * Creates a symbolic link to a target, failing if {@code link} locates an\n+     * existing file <i>(optional operation)<\/i>.\n@@ -967,2 +970,2 @@\n-     *          if a file with the name already exists <i>(optional specific\n-     *          exception)<\/i>\n+     *          if {@code link} locates an existing file\n+     *          <i>(optional specific exception)<\/i>\n@@ -981,1 +984,2 @@\n-     * Creates a new link (directory entry) for an existing file <i>(optional\n+     * Creates a new link (directory entry) for an existing file,\n+     * failing if {@code link} locates an existing file <i>(optional\n@@ -1010,2 +1014,2 @@\n-     *          if the entry could not otherwise be created because a file of\n-     *          that name already exists <i>(optional specific exception)<\/i>\n+     *          if {@code link} locates an existing file\n+     *          <i>(optional specific exception)<\/i>\n","filename":"src\/java.base\/share\/classes\/java\/nio\/file\/Files.java","additions":20,"deletions":16,"binary":false,"changes":36,"status":"modified"}]}