{"files":[{"patch":"@@ -43,6 +43,12 @@\n-    \/\/ The reason why this option exists is public Unsafe.objectFieldOffset\n-    \/\/ refusing to tell the field offset in Records (and probably other future\n-    \/\/ new Java object flavors). See JDK-8247444. Internal Unsafe still allows it,\n-    \/\/ but it requires several very dirty moves to access. Since it pokes (*writes*)\n-    \/\/ into object internals, it is dangerous to use, and while the code tries to be\n-    \/\/ as defensive as possible, it might still cause issues.\n+    \/*\n+        The reason why this option exists is public Unsafe.objectFieldOffset\n+        refusing to tell the field offset in Records, Hidden Classes and probably\n+        other future new Java object flavors:\n+            * https:\/\/bugs.openjdk.java.net\/browse\/JDK-8247444\n+            * https:\/\/github.com\/openjdk\/jdk\/blob\/de784312c340b4a4f4c4d11854bfbe9e9e826ea3\/src\/jdk.unsupported\/share\/classes\/sun\/misc\/Unsafe.java#L644-L649\n+\n+        Internal Unsafe still allows field offset access, but it requires several\n+        very dirty moves to access. Since the magic field offset code pokes (*writes*)\n+        into object internals, it is dangerous to use, and while the code tries to be\n+        as defensive as possible, it might still cause issues.\n+    *\/\n@@ -463,1 +469,1 @@\n-            \/\/ Guess where the magic field is in AccessibleObject.\n+            \/\/ Guess where the magic boolean field is in AccessibleObject.\n@@ -476,1 +482,1 @@\n-                \/\/ Try to find the latest plausible offset.\n+                \/\/ Try to find the last plausible offset.\n@@ -517,2 +523,3 @@\n-                        \/\/ DIRTY HACK: Allow calling the method, despite module boundary protection\n-                        \/\/ by overriding the access control check.\n+                        \/\/ DIRTY HACK: Side-step module protections by overriding the access\n+                        \/\/ control check. This allows calling internal Unsafe methods that is\n+                        \/\/ normally disallowed.\n@@ -524,1 +531,1 @@\n-                        \/\/ Here be dragons\n+                        \/\/ NAKED MEMORY STORE. Here be dragons.\n@@ -527,1 +534,1 @@\n-                        \/\/ Check that we succeeded\n+                        \/\/ Check that we succeeded?\n","filename":"jol-core\/src\/main\/java\/org\/openjdk\/jol\/vm\/HotspotUnsafe.java","additions":19,"deletions":12,"binary":false,"changes":31,"status":"modified"}]}