{"files":[{"patch":"@@ -200,2 +200,2 @@\n- * <p>\n- * The layout direction for a branch of the scene graph is controlled by the\n+ *\n+ * The layout orientation for a branch of the scene graph is controlled by the\n@@ -205,3 +205,2 @@\n- * node and its descendants. It is effectively left-to-right by default, but can be right-to-left depending\n- * on the locale of the operating system. If a layout orientation is set on the scene or on any node of the\n- * scene graph, descendants of the scene or node will inherit the specified orientation.\n+ * node and its descendants. It is typically left-to-right by default, but can be right-to-left depending\n+ * on the locale of the operating system.\n@@ -210,8 +209,11 @@\n- * positions are interpreted (leading vs. trailing). In a left-to-right orientation, the first child usually\n- * appears at the left edge and subsequent children flow to the right. Similarly, in a right-to-left orientation,\n- * the first child usually appears at the right edge and subsequent children flow to the left. Containers that\n- * expose named regions keep the same API, but the visual placement is mirrored in right-to-left mode.\n- * For example, the {@code left} and {@code right} regions of {@link javafx.scene.layout.BorderPane BorderPane}\n- * and {@link javafx.scene.layout.HeaderBar HeaderBar} retain their names, yet when the orientation is\n- * right-to-left, the node in the {@code left} region is laid out on the right side, and the node in the\n- * {@code right} region is laid out on the left side.\n+ * positions are interpreted. In a left-to-right orientation, the first child usually appears at the left edge\n+ * and subsequent children flow to the right. Similarly, in a right-to-left orientation, the first child\n+ * usually appears at the right edge and subsequent children flow to the left. When a container exposes\n+ * named regions, the {@code left} region refers to the leading edge of the container, and the {@code right}\n+ * region refers to the trailing edge of the container. In right-to-left mode, the {@code left} region will\n+ * therefore be laid out on the right side, and the {@code right} region will be laid out on the left side.\n+ * <p>\n+ * Authors typically do not need to account for layout orientation when laying out nodes. In right-to-left\n+ * mode, a mirroring transform is automatically applied to nodes, flipping the visual flow in the horizontal\n+ * direction. If this behavior is not desired, nodes can override {@link javafx.scene.Node#usesMirroring()}\n+ * and return {@code false}.\n","filename":"modules\/javafx.graphics\/src\/main\/java\/javafx\/scene\/layout\/package-info.java","additions":15,"deletions":13,"binary":false,"changes":28,"status":"modified"}]}