{"files":[{"patch":"@@ -51,1 +51,1 @@\n-Once the plugin zip has been obtained, it can be installed in the IDE; go in `Help -> Find Action...`, and type `Install plugin from disk`, and then select the corresponding action from the drop down list. A new file dialog will pop up: point the IDE to the zip file you have created in the step above. The IDE will require a restart - once restart is completed the installation process is completed, and the plugin is ready to be used to run and debug jtreg tests.\n+Once the plugin zip has been obtained, it can be installed in the IDE; go in `Help -> Find Action...`, and type `Install plugin from disk`, and then select the corresponding action from the drop-down list. A new file dialog will pop up: point the IDE to the zip file you have created in the step above. The IDE will require a restart - once restart is completed the installation process is completed, and the plugin is ready to be used to run and debug jtreg tests.\n@@ -55,1 +55,1 @@\n-This section covers the the functionalities supported by the jtreg plugin.\n+This section covers the functionalities supported by the jtreg plugin.\n@@ -66,1 +66,1 @@\n-Configuring such parameters is possible through the dialog located under `File -> Settings`, under the `jtreg` panel. By default, such settings are saved on a per-project basis. If, however, you would like to specify IDE-wide default, you can do so by accessing a similar dialog under `File -> New Projects Setup -> Settings for New Projects...`.\n+Configuring such parameters is possible through the dialog located under `File -> Settings`, under the `jtreg` panel. By default, such settings are saved on a per-project basis. If, however, you would like to specify IDE-wide default, you can do so by accessing a similar dialog under `File -> New Projects Setup -> Settings for New Projects...` and expanding the `Other Settings` section.\n","filename":"plugins\/idea\/README.md","additions":3,"deletions":3,"binary":false,"changes":6,"status":"modified"}]}