{"files":[{"patch":"@@ -1091,7 +1091,12 @@\n-                     * Apply bounds first so the peer is positioned on the correct\n-                     * screen before updating the output scales and before sizing\n-                     * the window to the size of the scene. Not doing so could result\n-                     * in the window being sized based using a different scale which\n-                     * can result in the scene being sized slightly too small or\n-                     * large which can cause controls to be rendered smaller than\n-                     * their preferred sizes (and show ellipsis on Labels for example).\n+                     * Based on the position of the Window, find out on what Screen\n+                     * it is located to correctly set the output scales. The correct\n+                     * output scale is required for the scene to be sized properly\n+                     * as there may otherwise be slight differences in size depending\n+                     * on the scale (which can cause controls to be cut-off and show\n+                     * ellipsis for example).\n+                     *\n+                     * We don't apply the bounds to the peer just yet, as we need it\n+                     * to trigger a width\/height change to the Scene **after** we\n+                     * set the Scene to its preferred size. Setting the size on the\n+                     * scene cannot be skipped when both dimensions are set explicitly\n+                     * as PopupWindow seems to be relying on it.\n@@ -1100,1 +1105,1 @@\n-                    applyBounds();\n+                    Screen windowScreen = getWindowScreen();\n@@ -1102,1 +1107,3 @@\n-                    System.out.println(\"Window\/invalidationListener: after applying bounds screen=\" + screen.get());\n+                    updateOutputScales(windowScreen.getOutputScaleX(), windowScreen.getOutputScaleY());\n+\n+                    System.out.println(\"Window\/invalidationListener: used screen for output scales: \" + windowScreen);\n@@ -1104,1 +1111,0 @@\n-                    updateOutputScales(peer.getOutputScaleX(), peer.getOutputScaleY());\n@@ -1127,23 +1133,6 @@\n-\/\/                    if ((getScene() != null) && (!widthExplicit || !heightExplicit)) {\n-\/\/                        if (!isEmbeddedWindow) {\n-\/\/\n-\/\/                            \/*\n-\/\/                             * Only size the scene if both width and height are not set\n-\/\/                             * explicitly. The method name is a bit confusing, but it\n-\/\/                             * actually sets the scene to its preferred size, which\n-\/\/                             * should only be done if we need to know its width and\/or\n-\/\/                             * height (as the other dimension may have been set explicitly).\n-\/\/                             *\n-\/\/                             * After this call, adjustSize is called to ensure the Scene\n-\/\/                             * is again resized for the explicit dimension (if any).\n-\/\/                             *\/\n-\/\/\n-\/\/                            System.out.println(\"Window\/invalidationListener: size from scene: \" + getScene().getWidth() + \"x\" + getScene().getHeight());\n-\/\/                        }\n-\/\/\n-\/\/                    } else {\n-\/\/                        peerBoundsConfigurator.setSize(\n-\/\/                                getWidth(), getHeight(), -1, -1);\n-\/\/                    }\n-\n-                    adjustSize(true);\n+                    if ((getScene() != null) && (!widthExplicit || !heightExplicit)) {\n+                        adjustSize(true);\n+                    } else {\n+                        peerBoundsConfigurator.setSize(\n+                                getWidth(), getHeight(), -1, -1);\n+                    }\n","filename":"modules\/javafx.graphics\/src\/main\/java\/javafx\/stage\/Window.java","additions":22,"deletions":33,"binary":false,"changes":55,"status":"modified"}]}