{"files":[{"patch":"@@ -38,1 +38,1 @@\n-Becoming an [Author](https:\/\/openjdk.org\/bylaws#author) is the first step. To achieve this you need to contribute two changes to the project in which you wish to become an Author. Once your changes are pushed into the code base and has been vetted enough to determine that the changes were indeed good changes you can go ahead and send an email to the project lead of that particular project and ask to be added as an Author. The [OpenJDK Project description](https:\/\/openjdk.org\/projects\/#project-author) has a template for such an email. In response to your email you will get a time-limited invite which you should fill out.\n+Becoming an [Author](https:\/\/openjdk.org\/bylaws#author) is the first step. To achieve this you need to contribute two changes to the project in which you wish to become an Author. Once your changes are pushed into the code base and has been vetted enough to determine that the changes were indeed good changes you can go ahead and send an email to the project lead of that particular project and ask to be added as an Author. Note that \"the project\" is not OpenJDK, but rather the specific development project where you did your contributions (e.g. \"JDK\", \"JDK Updates\", \"Amber\", etc). The [OpenJDK Project description](https:\/\/openjdk.org\/projects\/#project-author) has a template for such an email. In short the email should contain your name, the project name, your email address, and GitHub links to your changes. In response to your email you will get a time-limited invite which you should fill out.\n@@ -42,1 +42,1 @@\n-As an Author you will get your OpenJDK user name. This should be associated with your GitHub account in order for the bots to be able to identify you on GitHub. See the [Skara documentation](https:\/\/wiki.openjdk.org\/display\/SKARA#Skara-AssociatingyourGitHubaccountandyourOpenJDKusername) for more details on that. Once that's done you can create PRs and get them reviewed, but you will still need a sponsor to approve your change before it can be integrated. You'll also get write access to [JBS](#jbs---jdk-bug-system) and the [OpenJDK wiki](https:\/\/wiki.openjdk.org) related to the project in question, and to [cr.openjdk.java.net](https:\/\/cr.openjdk.java.net) via an SSH key provided at the time you accept your invitation.\n+As an Author you will get your OpenJDK user name. Once you have gotten the user name, this should be associated with your GitHub account in order for the bots to be able to identify you on GitHub. See the [Skara documentation](https:\/\/wiki.openjdk.org\/display\/SKARA#Skara-AssociatingyourGitHubaccountandyourOpenJDKusername) for more details on that. Once that's done you can create PRs and get them reviewed, but you will still need a sponsor to approve your change before it can be integrated. You'll also get write access to [JBS](#jbs---jdk-bug-system) and the [OpenJDK wiki](https:\/\/wiki.openjdk.org) related to the project in question, and to [cr.openjdk.org](https:\/\/cr.openjdk.org) via an SSH key provided at the time you accept your invitation.\n","filename":"src\/guide\/introduction.md","additions":2,"deletions":2,"binary":false,"changes":4,"status":"modified"}]}