{"files":[{"patch":"@@ -67,2 +67,17 @@\n-        \/\/ while building the interim javac, the ClassReader will produce a warning when loading a class\n-        \/\/ keeping the constant of a feature that has been integrated or dropped, serves the purpose of muting such warnings.\n+        \/\/ The JDK build process involves creating an interim javac which is then\n+        \/\/ used to compile the rest of the JDK. The jdk.internal.javac.PreviewFeature\n+        \/\/ annotation from the current sources is used when compiling interim javac.\n+        \/\/ That's because the javac APIs of the current sources may be annotated with\n+        \/\/ this annotation and they may be using the enum constants of the current sources.\n+        \/\/ Furthermore, when compiling interim javac, the class files from the bootstrap JDK get\n+        \/\/ used and those may also contain the PreviewFeature annotation. However, they may be\n+        \/\/ using the enum constants of the bootstrap JDK's PreviewFeature annotation.\n+        \/\/ If javac sees an annotation with an unknown enum constant, it produces a warning,\n+        \/\/ and that in turn fails the build.\n+        \/\/ So, in the current sources, we need to preserve the PreviewFeature enum constants\n+        \/\/ for as long as the interim javac build needs it. As a result, we retain PreviewFeature\n+        \/\/ enum constants for preview features that are present in the bootstrap JDK.\n+        \/\/ Older constants can be removed.\n+        \/\/\n+        \/\/ For example, Class-File API became final in JDK 24. As soon as JDK 23 was dropped as\n+        \/\/ the bootstrap JDK, the CLASSFILE_API enum constant became eligible for removal.\n@@ -71,2 +86,0 @@\n-        IMPLICIT_CLASSES, \/\/to be removed when boot JDK is 25\n-        SCOPED_VALUES,\n@@ -75,4 +88,0 @@\n-        CLASSFILE_API,\n-        STREAM_GATHERERS,\n-        MODULE_IMPORTS, \/\/remove when the boot JDK is JDK 25\n-        KEY_DERIVATION, \/\/remove when the boot JDK is JDK 25\n","filename":"src\/java.base\/share\/classes\/jdk\/internal\/javac\/PreviewFeature.java","additions":17,"deletions":8,"binary":false,"changes":25,"status":"modified"}]}