{"files":[{"patch":"@@ -1,71 +0,0 @@\n-\/*\n- * Copyright (c) 2016, 2024, Oracle and\/or its affiliates. All rights reserved.\n- * DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER.\n- *\n- * This code is free software; you can redistribute it and\/or modify it\n- * under the terms of the GNU General Public License version 2 only, as\n- * published by the Free Software Foundation.  Oracle designates this\n- * particular file as subject to the \"Classpath\" exception as provided\n- * by Oracle in the LICENSE file that accompanied this code.\n- *\n- * This code is distributed in the hope that it will be useful, but WITHOUT\n- * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\n- * FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License\n- * version 2 for more details (a copy is included in the LICENSE file that\n- * accompanied this code).\n- *\n- * You should have received a copy of the GNU General Public License version\n- * 2 along with this work; if not, write to the Free Software Foundation,\n- * Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA.\n- *\n- * Please contact Oracle, 500 Oracle Parkway, Redwood Shores, CA 94065 USA\n- * or visit www.oracle.com if you need additional information or have any\n- * questions.\n- *\/\n-\n-package javafx.util;\n-\n-import java.security.BasicPermission;\n-\n-\/**\n- * This class is for JavaFX permissions.\n- * An {@code FXPermission} contains a target name but\n- * no actions list; you either have the named permission\n- * or you don't.\n- *\n- * @apiNote\n- * This permission cannot be used for controlling access to resources anymore\n- * as the Security Manager is no longer supported.\n- *\n- * @see java.security.BasicPermission\n- * @see java.security.Permission\n- * @see java.security.Permissions\n- * @see java.security.PermissionCollection\n- *\n- * @since 9\n- *\n- * @deprecated This class was only useful in connection with the\n- *       Security Manager, which is no longer supported.\n- *       There is no replacement for this class.\n- *\/\n-@Deprecated(since = \"24\", forRemoval = true)\n-public final class FXPermission extends BasicPermission {\n-\n-    private static final long serialVersionUID = 2890556410764946054L;\n-\n-    \/**\n-     * Creates a new {@code FXPermission} with the specified name.\n-     * The name is the symbolic name of the {@code FXPermission},\n-     * such as \"accessClipboard\", \"createTransparentWindow \", etc. An asterisk\n-     * may be used to indicate all JavaFX permissions.\n-     *\n-     * @param name the name of the FXPermission\n-     *\n-     * @throws NullPointerException if {@code name} is {@code null}.\n-     * @throws IllegalArgumentException if {@code name} is empty.\n-     *\/\n-    public FXPermission(String name) {\n-        super(name);\n-    }\n-\n-}\n","filename":"modules\/javafx.base\/src\/main\/java\/javafx\/util\/FXPermission.java","additions":0,"deletions":71,"binary":false,"changes":71,"status":"deleted"}]}