{"files":[{"patch":"@@ -116,1 +116,1 @@\n-static void SetupSplashScreenEnvVars(const char *splash_file_name, char *jar_path);\n+static void SetupSplashScreenEnvVars(const char *splash_file_path, char *jar_path);\n@@ -1398,0 +1398,9 @@\n+\/*\n+ * Sets the relevant environment variables that are subsequently used by\n+ * the ShowSplashScreen() function. The splash_file_path and jar_path parameters\n+ * are used to determine which environment variables to set.\n+ * The splash_file_path is the value that was provided to the \"-splash:\" option\n+ * when launching java. It may be null, which implies the \"-splash:\" option wasn't used.\n+ * The jar_path is the value that was provided to the \"-jar\" option when launching java.\n+ * It too may be null, which implies the \"-jar\" option wasn't used.\n+ *\/\n@@ -1399,4 +1408,1 @@\n-SetupSplashScreenEnvVars(const char *splash_file_path, \/\/ \"-splash:\" option value (may be NULL)\n-                         char *jar_path \/\/ the jar file being launched (may be NULL)\n-) {\n-\n+SetupSplashScreenEnvVars(const char *splash_file_path, char *jar_path) {\n","filename":"src\/java.base\/share\/native\/libjli\/java.c","additions":11,"deletions":5,"binary":false,"changes":16,"status":"modified"},{"patch":"@@ -58,5 +58,5 @@\n- * That support was discontinued starting Java 9. However, java launcher in JDK 1.8 can still\n- * be launched with JRE version selection options to launch higher versioned java runtimes,\n- * including the current JDK version. When it does that, the _JAVA_VERSION_SET environment variable\n- * is set by the Java 1.8 launcher. The value of this environment variable is the Main-Class name from\n- * within the executable jar file (if any).\n+ * That support was discontinued starting JDK 9. However, JDK 1.8 launcher can still\n+ * be launched with JRE version selection options to launch Java runtimes greater than Java 8.\n+ * In such cases, the JDK 1.8 launcher when exec()ing the JDK N launcher, will set and propagate\n+ * the _JAVA_VERSION_SET environment variable. The value of this environment variable is the\n+ * Main-Class name from within the executable jar file (if any).\n","filename":"src\/java.base\/share\/native\/libjli\/java.h","additions":5,"deletions":5,"binary":false,"changes":10,"status":"modified"}]}