{"files":[{"patch":"@@ -39,1 +39,1 @@\n-public interface InheritableTaglet extends Taglet {\n+public interface InheritableTaglet {\n","filename":"src\/jdk.javadoc\/share\/classes\/jdk\/javadoc\/internal\/doclets\/formats\/html\/taglets\/InheritableTaglet.java","additions":1,"deletions":1,"binary":false,"changes":2,"status":"modified"},{"patch":"@@ -33,0 +33,1 @@\n+import jdk.javadoc.internal.doclets.formats.html.markup.HtmlTree;\n@@ -37,0 +38,7 @@\n+ *\n+ * The public {@link jdk.javadoc.doclet.Taglet} interface only supports\n+ * output to strings.   This interface supports structured output,\n+ * to {@link Content} objects, such as {@link HtmlTree}.\n+ *\n+ * User-provided taglets are supported using the {@link UserTaglet}\n+ * wrapper class.\n","filename":"src\/jdk.javadoc\/share\/classes\/jdk\/javadoc\/internal\/doclets\/formats\/html\/taglets\/Taglet.java","additions":8,"deletions":0,"binary":false,"changes":8,"status":"modified"},{"patch":"@@ -27,1 +27,15 @@\n- * This package has classes used to generate output for documentation comment tags.\n+ * Classes used to build the output for documentation comment tags.\n+ *\n+ * Tags are either inline tags, meaning they can be used within a\n+ * sentence or phrase, or are block tags, meaning that they provide\n+ * additional details that follow the main description in a comment.\n+ * Taglets model that distinction.\n+ *\n+ * Inline tags are always processed individually, within the surrounding\n+ * context. In general, inline tags always generate some (non-empty) output,\n+ * even if the output is some form indicating an error. It is almost never\n+ * correct to not generate any output to fill the between the parts of the\n+ * comment that come before and after the tag in the underlying comment.\n+ *\n+ * Conversely, block tags of any given kind are always processed as a\n+ * group, even if they do not appear contiguously in the underlying comment.\n","filename":"src\/jdk.javadoc\/share\/classes\/jdk\/javadoc\/internal\/doclets\/formats\/html\/taglets\/package-info.java","additions":15,"deletions":1,"binary":false,"changes":16,"status":"modified"}]}