{"files":[{"patch":"@@ -257,1 +257,1 @@\n-An important aspect of any issue is making clear how it is connected\/related to other issues, this linking is done when closing an issue - such as marking an issue as a duplicate and [adding a duplicate link](#closing-issues-as-duplicates) or when using the ‘Create Backport’ or ‘Create CSR’ options are used which we automatically create ‘backported by’ or ‘csr for’ links (never create an issue of type Backport or CSR by hand). The other use of linking is to associate an issue with one or more other issues that share some relation with the issue and is done during the triage or resolution of the issue.\n+An important aspect of any issue is making clear how it is connected\/related to other issues. This can occur at any stage of the issue's lifecycle. For example, as information becomes available that might suggest a cause, or similar issue (relates to); or when a Backport or CSR request is created; or when closing as a duplicate of another issue.\n@@ -261,1 +261,1 @@\n-’duplicate of` - See [Closing issues as duplicates] for more information.\n+’duplicate of` - Normally set automatically - see [Closing issues as duplicates] for more information\n@@ -263,1 +263,1 @@\n-‘backported by’ - When creating a backport with the “More -> Create Backport” option a link is automatically created between the main issue and the new Backport\n+‘backported by’ - Normally set automatically when creating a backport with the “More -> Create Backport” option\n@@ -267,1 +267,1 @@\n-‘blocks’ - when a fix is broken down into a number of parts the ‘blocks’ link should be used to ensure they are all fixed before the main issue is considered resolved - see [implementing large changes](#implementing-large-changes]\n+‘blocks’ - For when other issues are dependent on the current issue being resolved\/fixed before they can be. For example, when a fix is broken down into a number of parts the ‘blocks’ link should be used to ensure they are all fixed before the main issue is considered resolved - see [implementing large changes](#implementing-large-changes]\n","filename":"src\/guide\/jbs-jdk-bug-system.md","additions":4,"deletions":4,"binary":false,"changes":8,"status":"modified"}]}