{"files":[{"patch":"@@ -1165,5 +1165,3 @@\n-          \/\/ Allow enabling of JVMTI DATA_DUMP_REQUEST support.\n-          \/\/ This is not a documented flag. This feature is only intended to be used\n-          \/\/ by debug agent developers. It is advised that you launch the debuggee\n-          \/\/ with -XX:+StartAttachListener. Otherwise the attach listener may fail to\n-          \/\/ startup due to the Signal Dispatcher thread being suspended due to an event.\n+          \/\/ Enable JVMTI DATA_DUMP_REQUEST support.\n+          \/\/ This is not a documented flag. This feature is experimental and is only intended\n+          \/\/ to be used by debug agent developers. See comment for cbDataDump() for more details.\n","filename":"src\/jdk.jdwp.agent\/share\/native\/libjdwp\/debugInit.c","additions":3,"deletions":5,"binary":false,"changes":8,"status":"modified"},{"patch":"@@ -1333,1 +1333,28 @@\n-\/* Event callback for JVMTI_EVENT_DATA_DUMP_REQUEST *\/\n+\/**\n+ * Event callback for JVMTI_EVENT_DATA_DUMP_REQUEST\n+ *\n+ * This callback is made when a JVMTI data dump is requested. The common way of doing\n+ * this is with \"jcmd <pid> JVMTI.data_dump\".\n+ *\n+ * Debug agent data dumps are experimental and only intended to be used by debug agent\n+ * developers. Data dumps are disabled by default.\n+ *\n+ * This callback is enabled by launching the debug agent with datadump=y. The easiest\n+ * way to enabled data dumps with debugger tests or when using jdb is to use the\n+ * _JAVA_JDWP_OPTIONS export. The following works well when running tests:\n+ *\n+ *  make test TEST=<test> \\\n+ *    JTREG='JAVA_OPTIONS=-XX:+StartAttachListener;OPTIONS=-e:_JAVA_JDWP_OPTIONS=datadump=y'\n+ *\n+ * Data dumps may fail to happen due to the debug agent suspending all threads.\n+ * This causes the Signal Dispatcher and Attach Listener threads to be suspended,\n+ * which can cause issues with jcmd attaching. Running with -XX:+StartAttachListener can\n+ * help, but in general it is best not to try a datadump when all threads are suspended.\n+ *\n+ * Data dumps are also risky when the debug agent is handling events or commands from\n+ * the debugger, due to dumping data that is not lock protected. This can cause a\n+ * crash.\n+ *\n+ * Data dumps are meant to aid with post mortem debugging (debugging after a\n+ * problem has been detected), not for ongoing periodic data gathering.\n+ *\/\n","filename":"src\/jdk.jdwp.agent\/share\/native\/libjdwp\/eventHandler.c","additions":28,"deletions":1,"binary":false,"changes":29,"status":"modified"}]}