{"files":[{"patch":"@@ -43,1 +43,1 @@\n-uses of native functionality, such as restricted methods or\n+uses of native functionalities, such as restricted method calls or\n@@ -54,2 +54,2 @@\n-that scans a JAR file for uses of native functionality, such as\n-restricted methods or \\f[V]native\\f[R] method declarations.\n+that scans a JAR file for uses of native functionalities, such as\n+restricted method calls or \\f[V]native\\f[R] method declarations.\n@@ -60,1 +60,1 @@\n-native functionality either in a tree like structure, which also\n+native functionalities either in a tree like structure, which also\n@@ -68,2 +68,3 @@\n-Used to specify a path list of class path jar files to be scanned.\n-All jar files specified through this path will be scanned.\n+Used to specify a list of paths pointing to jar files to be scanned.\n+.PP\n+All jar files specified through this list will be scanned.\n@@ -74,0 +75,2 @@\n+All the jar files found are treated as if they belonged to the unnamed\n+module.\n@@ -76,3 +79,4 @@\n-Used to specify a path list of jar files or directories containing\n-module path jar files.\n-The list jar files that will be scanned depends on the\n+Used to specify a list of paths pointing to jar files or directories\n+containing jar files, that the tool can use to find modules that need to\n+be scanned.\n+The list of jar files that will be scanned depends on the\n@@ -110,4 +114,4 @@\n-Used to specifiy a comma-separated list of module names that indicate\n-the root modules to scan.\n-All the modules in the root set will be scanned, as well as any modules\n-that they depend on.\n+Used to specify a comma-separated list of module names that indicate the\n+root modules to scan.\n+All the root modules will be scanned, as well as any modules that they\n+depend on.\n@@ -128,1 +132,2 @@\n-release version.\n+release version, which is the same as the version of the JDK that the\n+tool belongs to.\n@@ -146,4 +151,4 @@\n-For the module path, the tool scans all modules in the root module set\n-specified through \\f[V]--add-modules\\f[R], and any (transitive)\n-dependence module of the root set, including any modules that contain\n-service implementations that are used by a scanned module.\n+For the module path, the tool scans all root modules specified through\n+\\f[V]--add-modules\\f[R], and any (transitive) dependence of the root\n+modules, including any modules that contain service implementations that\n+are used by a scanned module.\n@@ -187,1 +192,1 @@\n-java.lang.foreign.MemorySegment::reinterpret(long)MemorySegment\n+      java.lang.foreign.MemorySegment::reinterpret(long)MemorySegment\n@@ -195,1 +200,1 @@\n-foo.Main::nativeMethod()void is a native method declaration\n+    foo.Main::nativeMethod()void is a native method declaration\n@@ -215,1 +220,1 @@\n-contains an access to native functionality.\n+contains an access to native functionalities.\n","filename":"src\/jdk.jdeps\/share\/man\/jnativescan.1","additions":26,"deletions":21,"binary":false,"changes":47,"status":"modified"}]}