{"files":[{"patch":"@@ -47,6 +47,6 @@\n- * A class is considered unloaded if its class loader is reclaimed.\n- * A runnable lambda is registered to JVM to be called whenever the\n- * class loader becomes unreachable.\n- * After setting the class loader to null, if within a timeout no notification\n- * of its reclaim is received, class is considered still loaded and\n- * <code>unloadClass()<\/code> method returns <i>false<\/i>.\n+ * A class is eligible for unloading if its class loader has been reclaimed.\n+ * A Cleaner is used to inform the main test code when the class loader\n+ * becomes unreachable and is reclaimed.\n+ * If, after setting the class loader to null, no notification that it has become\n+ * reclaimed is received within the timeout interval, then the class is considered\n+ * to still be loaded and <code>unloadClass()<\/code> returns <i>false<\/i>.\n@@ -80,1 +80,1 @@\n-     * Whole amount of time in milliseconds to wait for class loader reclaim.\n+     * Whole amount of time in milliseconds to wait for class loader to be reclaimed.\n@@ -85,1 +85,1 @@\n-     * Piece of time in milliseconds to wait in a loop for class loader reclaim.\n+     * Sleep time in milliseconds for the loop waiting for the class loader to be reclaimed.\n@@ -90,1 +90,1 @@\n-     * Has class loader been is_reclaimed or not.\n+     * Has class loader been reclaimed or not.\n@@ -141,1 +141,1 @@\n-        \/\/ When customClassLoader becomes unreachable, the lambda is called by JVM\/GC.\n+        \/\/ Register a Cleaner to inform us when the class loader has been reclaimed.\n@@ -157,1 +157,1 @@\n-        \/\/ When customClassLoader becomes unreachable, the lambda is called by JVM\/GC.\n+        \/\/ Register a Cleaner to inform us when the class loader has been reclaimed.\n@@ -277,1 +277,1 @@\n-        \/\/ class loader has not been is_reclaimed\n+        \/\/ class loader has not been reclaimed\n","filename":"test\/hotspot\/jtreg\/vmTestbase\/nsk\/share\/ClassUnloader.java","additions":12,"deletions":12,"binary":false,"changes":24,"status":"modified"}]}