{"files":[{"patch":"@@ -2,1 +2,1 @@\n- * Copyright (c) 2012, 2019, Oracle and\/or its affiliates. All rights reserved.\n+ * Copyright (c) 2012, 2026, Oracle and\/or its affiliates. All rights reserved.\n@@ -198,0 +198,20 @@\n+ *\n+ * <h2>Layout Orientation<\/h2>\n+ * <p>\n+ * The layout direction for a branch of the scene graph is controlled by the\n+ * {@link javafx.scene.Scene#nodeOrientationProperty() Scene.nodeOrientation} and\n+ * {@link javafx.scene.Node#nodeOrientationProperty() Node.nodeOrientation} properties.\n+ * A value set on a {@code Scene} applies to its root, and a value set on any {@code Node} applies to that\n+ * node and its descendants. It is effectively left-to-right by default, but can be right-to-left depending\n+ * on the locale of the operating system. If a layout orientation is set on the scene or on any node of the\n+ * scene graph, descendants of the scene or node will inherit the specified orientation.\n+ * <p>\n+ * For layout containers, the effective orientation determines how children are ordered and how horizontal\n+ * positions are interpreted (leading vs. trailing). In a left-to-right orientation, the first child usually\n+ * appears at the left edge and subsequent children flow to the right. Similarly, in a right-to-left orientation,\n+ * the first child usually appears at the right edge and subsequent children flow to the left. Containers that\n+ * expose named regions keep the same API, but the visual placement is mirrored in right-to-left mode.\n+ * For example, the {@code left} and {@code right} regions of {@link javafx.scene.layout.BorderPane BorderPane}\n+ * and {@link javafx.scene.layout.HeaderBar HeaderBar} retain their names, yet when the orientation is\n+ * right-to-left, the node in the {@code left} region is laid out on the right side, and the node in the\n+ * {@code right} region is laid out on the left side.\n","filename":"modules\/javafx.graphics\/src\/main\/java\/javafx\/scene\/layout\/package-info.java","additions":21,"deletions":1,"binary":false,"changes":22,"status":"modified"}]}