{"files":[{"patch":"@@ -13,2 +13,1 @@\n-The appropriate way to print logging output from HotSpot is through the [Unified Logging Framework (JEP 158)](https:\/\/openjdk.org\/jeps\/158).\n-It gives you a lot of nice features and enables common command-line options for all logging.\n+The appropriate way to print logging output from HotSpot is through the [Unified Logging Framework (JEP 158)](https:\/\/openjdk.org\/jeps\/158). It gives you a lot of nice features and enables common command-line options for all logging.\n@@ -22,3 +21,1 @@\n-Where 'gc' and 'marking' are tags, and 'info' is the log level. Tags associate log messages with certain subsystems or features and the log level\n-determines the importance and verbosity of the message. The most verbose output is trace, and the least is error. The full list of tags is available\n-[here](https:\/\/github.com\/openjdk\/jdk\/blob\/master\/src\/hotspot\/share\/logging\/logTag.hpp) and the full list of levels [here](https:\/\/github.com\/openjdk\/jdk\/blob\/master\/src\/hotspot\/share\/logging\/logLevel.hpp).\n+Where 'gc' and 'marking' are tags, and 'info' is the log level. Tags associate log messages with certain subsystems or features and the log level determines the importance and verbosity of the message. The most verbose output is trace, and the least is error. The full list of tags is available [here](https:\/\/github.com\/openjdk\/jdk\/blob\/master\/src\/hotspot\/share\/logging\/logTag.hpp) and the full list of levels [here](https:\/\/github.com\/openjdk\/jdk\/blob\/master\/src\/hotspot\/share\/logging\/logLevel.hpp).\n@@ -73,2 +70,1 @@\n-You enable logging in the JVM by using the `-Xlog` command line option specified.\n-For example, the messages from the examples would be visible if the JVM were run with any of the following options:\n+You enable logging in the JVM by using the `-Xlog` command line option specified. For example, the messages from the examples would be visible if the JVM were run with any of the following options:\n@@ -94,2 +90,1 @@\n-UL automatically applies a default argument of `-Xlog:all=warning:stdout:uptime,level,tags` when logging is enabled. This can be disabled by\n-prepending `-Xlog:disable` to your arguments.\n+UL automatically applies a default argument of `-Xlog:all=warning:stdout:uptime,level,tags` when logging is enabled. This can be disabled by prepending `-Xlog:disable` to your arguments.\n","filename":"src\/guide\/hotspot-development.md","additions":4,"deletions":9,"binary":false,"changes":13,"status":"modified"}]}