{"files":[{"patch":"@@ -261,6 +261,10 @@\n-         * 1. Caller and target processes share PID namespace and root filesystem (host to host or container to\n-         *    container with both \/tmp mounted between containers).\n-         * 2. Caller and target processes share PID namespace and root filesystem but the target process has elevated\n-         *    privileges (host to host).\n-         * 3. Caller and target processes share PID namespace but NOT root filesystem (container to container).\n-         * 4. Caller and target processes share neither PID namespace nor root filesystem (host to container)\n+         * 1. Caller and target processes share PID namespace and root\n+         *    filesystem (host to host or container to container with both \/tmp\n+         *    mounted between containers).\n+         * 2. Caller and target processes share PID namespace and root\n+         *    filesystem but the target process has elevated privileges\n+         *    (host to host).\n+         * 3. Caller and target processes share PID namespace but NOT root\n+         *    filesystem (container to container).\n+         * 4. Caller and target processes share neither PID namespace nor root\n+         *    filesystem (host to container)\n@@ -268,7 +272,5 @@\n-         * if target is elevated, we cant use \/proc\/<pid>\/... so we have to fallback to \/tmp, but that may not be shared\n-         * with the target\/attachee process, so we should check whether \/tmp on both is same. This method would throw\n-         * AttachNotSupportedException if they are different because we cannot make a connection with target VM.\n-         *\n-         * In addition, we can also check the target pid's signal masks to see if it catches SIGQUIT and only do so if in\n-         * fact it does ... this reduces the risk of killing an innocent process in the current ns as opposed to\n-         * attaching to the actual target JVM ... c.f: checkCatchesAndSendQuitTo() below.\n+         * if target is elevated, we cant use \/proc\/<pid>\/... so we have to\n+         * fallback to \/tmp, but that may not be shared with the target\/attachee\n+         * process, so we should check whether \/tmp on both is same. This method\n+         * would throw AttachOperationFailedException if they are different\n+         * because we cannot make a connection with target VM.\n@@ -299,2 +301,9 @@\n-            } catch (MonitorException | URISyntaxException e) {\n-                \/\/ Other exceptions (happened at MonitoredHost) would be wrapped with AttachOperationFailedException\n+            } catch (URISyntaxException e) {\n+                \/\/ URISyntaxException is defined as a checked exception at\n+                \/\/ MonitoredHost.getMonitoredHost() if the URI string poorly\n+                \/\/ formed. However \"\/\/localhost\" is hard-coded at here, so the\n+                \/\/ exception should not happen.\n+                throw new AssertionError(\"Unexpected exception\", e);\n+            } catch (MonitorException e) {\n+                \/\/ Other exceptions (happened at MonitoredHost) would be wrapped\n+                \/\/ with AttachOperationFailedException.\n","filename":"src\/jdk.attach\/linux\/classes\/sun\/tools\/attach\/VirtualMachineImpl.java","additions":24,"deletions":15,"binary":false,"changes":39,"status":"modified"}]}