{"files":[{"patch":"@@ -34,1 +34,0 @@\n-import javax.swing.UIManager;\n@@ -59,1 +58,2 @@\n-                1. Refer to bug report 4112270 for spec of keyboard navigation.\n+                1. Refer the below keyboard navigation specs\n+                 (referenced from bug report 4112270).\n@@ -61,1 +61,1 @@\n-                 shift and control verifying each change to the selection against\n+                  shift and control verifying each change to the selection against\n@@ -63,0 +63,33 @@\n+\n+                  Navigate In - Tab, shift-tab, control-tab, shift-control-tab\n+                  Return\/shift-return - move focus one cell down\/up.\n+                  Tab\/shift-tab - move focus one cell right\/left.\n+                  Up\/down arrow - deselect current selection; move focus one cell up\/down\n+                  Left\/right arrow - deselect current selection; move focus one cell\n+                                             left\/right\n+                  PageUp\/PageDown - deselect current selection; scroll up\/down one\n+                                    JViewport view; first visible cell in current\n+                                    column gets focus\n+                  Control-PageUp\/PageDown - deselect current selection; scroll\n+                                            left\/right one JViewport view; first\n+                                            visible cell in current row gets\n+                                            focus\n+                  Home\/end - deselect current selection; move focus and view to\n+                                     first\/last cell in current row\n+                  Control-home\/end - deselect current selection; move focus and view to\n+                                             upper-left\/lower-right cell in table\n+                  F2 - Allows editing in a cell containing information without\n+                               overwriting the information\n+                  Esc - Resets the cell content back to the state it was in before\n+                                editing started\n+                  Ctrl+A, Ctrl+\/ = Select all\n+                  Ctrl+\\\\ = De-select all\n+                  Shift-up\/down arrow - extend selection up\/down one row\n+                  Shift-left\/right arrow - extend selection left\/right one column\n+                  Control-shift up\/down arrow - extend selection to top\/bottom of column\n+                  Shift-home\/end - extend selection to left\/right end of row\n+                  Control-shift-home\/end - extend selection to beginning\/end of data\n+                  Shift-PageUp\/PageDown - extend selection up\/down one view and scroll\n+                                          table\n+                  Control-shift-PageUp\/PageDown - extend selection left\/right one view\n+                                                          and scroll table\n@@ -93,1 +126,1 @@\n-                INSTRUCTIONS, 5L, 6, 45);\n+                INSTRUCTIONS, 5L, 15, 50);\n","filename":"test\/jdk\/javax\/swing\/JTable\/KeyBoardNavigation.java","additions":37,"deletions":4,"binary":false,"changes":41,"status":"modified"}]}