{"files":[{"patch":"@@ -39,13 +39,14 @@\n- * <p><a id=\"accurate_model\">When used in the context of annotation processing, an accurate\n- * model of the element being represented must be returned.  As this\n- * is a language model, the source code provides the fiducial\n- * (reference) representation of the construct in question rather than\n- * a representation in an executable output like a class file.\n- * Executable output may serve as the basis for creating a modeling\n- * element.  However, the process of translating source code to\n- * executable output may not permit recovering some aspects of the\n- * source code representation.  For example, annotations with\n- * {@linkplain java.lang.annotation.RetentionPolicy#SOURCE source}\n- * {@linkplain java.lang.annotation.Retention retention} cannot be\n- * recovered from class files and class files might not be able to\n- * provide source position information.<\/a>\n+ * <p id=\"accurate_model\">When used in the context of annotation\n+ * processing, an accurate model of the element being represented must\n+ * be returned.  As this is a language model, the source code provides\n+ * the fiducial (reference) representation of the construct in\n+ * question rather than a representation in an executable output like\n+ * a class file.  Executable output may serve as the basis for\n+ * creating a modeling element.  However, the process of translating\n+ * source code to executable output may not permit recovering some\n+ * aspects of the source code representation.  For example,\n+ * annotations with {@linkplain\n+ * java.lang.annotation.RetentionPolicy#SOURCE source} {@linkplain\n+ * java.lang.annotation.Retention retention} cannot be recovered from\n+ * class files and class files might not be able to provide source\n+ * position information.\n","filename":"src\/java.compiler\/share\/classes\/javax\/lang\/model\/element\/package-info.java","additions":14,"deletions":13,"binary":false,"changes":27,"status":"modified"},{"patch":"@@ -765,1 +765,0 @@\n-\n@@ -798,1 +797,2 @@\n-     * a null file since it cannot be declared in a compilation unit.\n+     * a {@code null} file since it cannot be declared in a\n+     * compilation unit.\n@@ -802,4 +802,4 @@\n-     * ModuleElement#isUnnamed unnamed module} will have a null file\n-     * since it cannot be declared in a compilation unit.  An\n-     * {@linkplain #isAutomaticModule automatic module} will have a\n-     * null file since it is implicitly declared.\n+     * ModuleElement#isUnnamed unnamed module} will have a {@code\n+     * null} file since it cannot be declared in a compilation unit.\n+     * An {@linkplain #isAutomaticModule automatic module} will have a\n+     * {@code null} file since it is implicitly declared.\n","filename":"src\/java.compiler\/share\/classes\/javax\/lang\/model\/util\/Elements.java","additions":6,"deletions":6,"binary":false,"changes":12,"status":"modified"}]}