{"files":[{"patch":"@@ -1,34 +0,0 @@\n-\/*\n- * Copyright (c) 2022, Oracle and\/or its affiliates. All rights reserved.\n- *\n- * Redistribution and use in source and binary forms, with or without\n- * modification, are permitted provided that the following conditions\n- * are met:\n- *\n- *   - Redistributions of source code must retain the above copyright\n- *     notice, this list of conditions and the following disclaimer.\n- *\n- *   - Redistributions in binary form must reproduce the above copyright\n- *     notice, this list of conditions and the following disclaimer in the\n- *     documentation and\/or other materials provided with the distribution.\n- *\n- *   - Neither the name of Oracle nor the names of its\n- *     contributors may be used to endorse or promote products derived\n- *     from this software without specific prior written permission.\n- *\n- * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS\n- * IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,\n- * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR\n- * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE COPYRIGHT OWNER OR\n- * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\n- * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,\n- * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR\n- * PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\n- * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\n- * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\n- * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n- *\/\n-\n-#define PCRE2_CODE_UNIT_WIDTH 8\n-\n-#include <pcre2.h>\n","filename":"samples\/pcre2\/Pcre.h","additions":0,"deletions":34,"binary":false,"changes":34,"status":"deleted"},{"patch":"@@ -63,1 +63,0 @@\n-        pcre2_code_free_8(re);\n","filename":"samples\/pcre2\/PcreCheck.java","additions":0,"deletions":1,"binary":false,"changes":1,"status":"modified"},{"patch":"@@ -3,0 +3,1 @@\n+  -DPCRE2_CODE_UNIT_WIDTH=8 \\\n@@ -5,1 +6,1 @@\n-  Pcre.h\n+  \/usr\/local\/opt\/pcre2\/include\/pcre2.h\n","filename":"samples\/pcre2\/compile.sh","additions":2,"deletions":1,"binary":false,"changes":3,"status":"modified"},{"patch":"@@ -4,0 +4,1 @@\n+  -DPCRE2_CODE_UNIT_WIDTH=8 \\\n@@ -6,1 +7,1 @@\n-  Pcre.h\n+  \/usr\/local\/opt\/pcre2\/include\/pcre2.h\n","filename":"samples\/pcre2\/compilesource.sh","additions":2,"deletions":1,"binary":false,"changes":3,"status":"modified"}]}