{"files":[{"patch":"@@ -53,0 +53,1 @@\n+<li><a href=\"#local-function-objects\">Local Function Objects<\/a><\/li>\n@@ -257,2 +258,1 @@\n-<li><p>Generic lambdas. Lambdas are not (yet) permitted.<\/p><\/li>\n-<li><p>Lambda init captures. Lambdas are not (yet) permitted.<\/p><\/li>\n+<li><p>Also see <a href=\"#lambdaexpressions\">lambda expressions<\/a>.<\/p><\/li>\n@@ -291,0 +291,115 @@\n+<h3 id=\"local-function-objects\">Local Function Objects<\/h3>\n+<ul>\n+<li>Local function objects, including lambda expressions, may be used.<\/li>\n+<li>Lambda expressions must only be used as a downward value.<\/li>\n+<li>Prefer <code>[&amp;]<\/code> as the capture list of a lambda expression.<\/li>\n+<li>Return type deduction for lambda expressions is permitted, and indeed encouraged.<\/li>\n+<li>An empty parameter list for a lambda expression may be elided.<\/li>\n+<li>A lambda expression must not be <code>mutable<\/code>.<\/li>\n+<li>Generic lambda expressions are permitted.<\/li>\n+<li>Lambda expressions should be relatively simple.<\/li>\n+<li>Anonymous lambda expressions should not overly clutter the enclosing expression.<\/li>\n+<li>An anonymous lambda expression must not be directly invoked.<\/li>\n+<li>Bind expressions are forbidden.<\/li>\n+<\/ul>\n+<p>Single-use function objects can be defined locally within a function, directly at the point of use. This is an alternative to having a function or function object class defined at class or namespace scope.<\/p>\n+<p>This usage was somewhat limited by C++03, which does not permit such a class to be used as a template parameter. That restriction was removed by C++11 (<a href=\"http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2008\/n2657.htm\">n2657<\/a>). Use of this feature is permitted.<\/p>\n+<p>Many HotSpot protocols involve &quot;function-like&quot; objects that involve some named member function rather than a call operator. For example, a function that performs some action on all threads might be written as<\/p>\n+<pre><code>void do_something() {\n+  struct DoSomething : public ThreadClosure {\n+    virtual void do_thread(Thread* t) {\n+      ... do something with t ...\n+    }\n+  } closure;\n+  Threads::threads_do(&amp;closure);\n+}<\/code><\/pre>\n+<p>HotSpot code has historically usually placed the DoSomething class at namespace (or sometimes class) scope. This separates the function's code from its use, often to the detriment of readability. It requires giving the class a globally unique name (if at namespace scope). It also loses the information that the class is intended for use in exactly one place, and does not have any subclasses. (However, the latter can now be indicated by declaring it <code>final<\/code>.) Often, for simplicity, a local class will skip things like access control and accessor functions, giving the enclosing function direct access to the implementation and eliminating some boilerplate that might be provided if the class is in some outer (more accessible) scope. On the other hand, if there is a lot of surrounding code in the function body or the local class is of significant size, defining it locally can increase clutter and reduce readability.<\/p>\n+<p><a name=\"lambdaexpressions\"><\/a> C++11 added <em>lambda expressions<\/em> as a new way to write a function object. Simple lambda expressions can be significantly more concise than a function object, eliminating a lot of boiler-plate. On the other hand, a complex lambda expression may not provide much, if any, readability benefit compared to an ordinary function object. Also, while a lambda can encapsulate a call to a &quot;function-like&quot; object, it cannot be used in place of such.<\/p>\n+<p>A common use for local functions is as one-use <a href=\"https:\/\/en.cppreference.com\/w\/cpp\/language\/raii\" title=\"Resource Acquisition Is Initialization\">RAII<\/a> objects. The amount of boilerplate for a function object class (local or not) makes such usage somewhat clumsy and verbose. But with the help of a small amount of supporting utility code, lambdas work particularly well for this use case.<\/p>\n+<p>Another use for local functions is <a href=\"https:\/\/en.wikipedia.org\/wiki\/Partial_application\" title=\"Partial Application\">partial application<\/a>. Again here, lambdas are typically much simpler and less verbose than function object classes.<\/p>\n+<p>Because of these benefits, lambda expressions are permitted in HotSpot code, with some restrictions and usage guidance. An anonymous lambda is one which is passed directly as an argument. A named lambda is the value of a variable, which is its name.<\/p>\n+<p>Lambda expressions should only be passed downward. In particular, a lambda should not be returned from a function or stored in a global variable, whether directly or as the value of a member of some other object. Lambda capture is syntactically subtle (by design), and propagating a lambda in such ways can easily pass references to captured values to places where they are no longer valid. In particular, members of the enclosing <code>this<\/code> object are effectively captured by reference, even if the default capture is by-value. For such uses-cases a function object class should be used to make the desired value capturing and propagation explicit.<\/p>\n+<p>Limiting the capture list to <code>[&amp;]<\/code> (implicitly capture by reference) is a simplifying restriction that still provides good support for HotSpot usage, while reducing the cases a reader must recognize and understand.<\/p>\n+<ul>\n+<li><p>Many common lambda uses require reference capture. Not permitting it would substantially reduce the utility of lambdas.<\/p><\/li>\n+<li><p>Referential transparency. Implicit reference capture makes variable references in the lambda body have the same meaning they would have in the enclosing code. There isn't a semantic barrier across which the meaning of a variable changes.<\/p><\/li>\n+<li><p>Explicit reference capture introduces significant clutter, especially when lambda expressions are relatively small and simple, as they should be in HotSpot code.<\/p><\/li>\n+<li><p>There are a number of reasons why by-value capture might be used, but for the most part they don't apply to HotSpot code, given other usage restrictions.<\/p>\n+<ul>\n+<li><p>A primary use-case for by-value capture is to support escaping uses, where values captured by-reference might become invalid. That use-case doesn't apply if only downward lambdas are used.<\/p><\/li>\n+<li><p>By-value capture can also make a lambda-local copy for mutation, which requires making the lambda <code>mutable<\/code>; see below.<\/p><\/li>\n+<li><p>By-value capture might be viewed as an optimization, avoiding any overhead for reference capture of cheap to copy values. But the compiler can often eliminate any such overhead.<\/p><\/li>\n+<li><p>By-value capture by a non-<code>mutable<\/code> lambda makes the captured values const, preventing any modification by the lambda and making the captured value unaffected by modifications to the outer variable. But this only applies to captured auto variables, not member variables, and is inconsistent with referential transparency.<\/p><\/li>\n+<\/ul><\/li>\n+<li><p>Non-capturing lambdas (with an empty capture list - <code>[]<\/code>) have limited utility. There are cases where no captures are required (pure functions, for example), but if the function is small and simple then that's obvious anyway.<\/p><\/li>\n+<li><p>Capture initializers (a C++14 feature - <a href=\"https:\/\/isocpp.org\/files\/papers\/N3649.html\">N3649<\/a>) are not permitted. Capture initializers inherently increase the complexity of the capture list, and provide little benefit over an additional in-scope local variable.<\/p><\/li>\n+<\/ul>\n+<p>The use of <code>mutable<\/code> lambda expressions is forbidden because there don't seem to be many, if any, good use-cases for them in HotSpot. A lambda expression needs to be mutable in order to modify a by-value captured value. But with only downward lambdas, such usage seems likely to be rare and complicated. It is better to use a function object class in any such cases that arise, rather than requiring all HotSpot developers to understand this relatively obscure feature.<\/p>\n+<p>While it is possible to directly invoke an anonymous lambda expression, that feature should not be used, as such a form can be confusing to readers. Instead, name the lambda and call it by name.<\/p>\n+<p>Some reasons to prefer a named lambda instead of an anonymous lambda are<\/p>\n+<ul>\n+<li><p>The body contains non-trivial control flow or declarations or other nested constructs.<\/p><\/li>\n+<li><p>Its role in an argument list is hard to guess without examining the function declaration. Give it a name that indicates its purpose.<\/p><\/li>\n+<li><p>It has an unusual capture list.<\/p><\/li>\n+<li><p>It has a complex explicit return type or parameter types.<\/p><\/li>\n+<\/ul>\n+<p>Lambda expressions, and particularly anonymous lambda expressions, should be simple and compact. One-liners are good. Anonymous lambdas should usually be limited to a couple lines of body code. More complex lambdas should be named. A named lambda should not clutter the enclosing function and make it long and complex; do continue to break up large functions via the use of separate helper functions.<\/p>\n+<p>An anonymous lambda expression should either be a one-liner in a one-line expression, or isolated in its own set of lines. Don't place part of a lambda expression on the same line as other arguments to a function. The body of a multi-line lambda argument should be indented from the start of the capture list, as if that were the start of an ordinary function definition. The body of a multi-line named lambda should be indented one step from the variable's indentation.<\/p>\n+<p>Some examples:<\/p>\n+<ol type=\"1\">\n+<li><code>foo([&amp;] { ++counter; });<\/code><\/li>\n+<li><code>foo(x, [&amp;] { ++counter; });<\/code><\/li>\n+<li><code>foo([&amp;] { if (predicate) ++counter; });<\/code><\/li>\n+<li><code>foo([&amp;] { auto tmp = process(x); tmp.f(); return tmp.g(); })<\/code><\/li>\n+<li><p>Separate one-line lambda from other arguments:<\/p>\n+<pre><code>foo(c.begin(), c.end(),\n+    [&amp;] (const X&amp; x) { do_something(x); return x.value(); });<\/code><\/pre><\/li>\n+<li><p>Indentation for multi-line lambda:<\/p>\n+<pre><code>c.do_entries([&amp;] (const X&amp; x) {\n+               do_something(x, a);\n+               do_something1(x, b);\n+               do_something2(x, c);\n+             });<\/code><\/pre><\/li>\n+<li><p>Separate multi-line lambda from other arguments:<\/p>\n+<pre><code>foo(c.begin(), c.end(),\n+    [&amp;] (const X&amp; x) {\n+      do_something(x, a);\n+      do_something1(x, b);\n+      do_something2(x, c);\n+    });<\/code><\/pre><\/li>\n+<li><p>Multi-line named lambda:<\/p>\n+<pre><code>auto do_entry = [&amp;] (const X&amp; x) {\n+  do_something(x, a);\n+  do_something1(x, b);\n+  do_something2(x, c);\n+};<\/code><\/pre><\/li>\n+<\/ol>\n+<p>Item 4, and especially items 6 and 7, are pushing the simplicity limits for anonymous lambdas. Item 6 might be better written using a named lambda:<\/p>\n+<pre><code>c.do_entries(do_entry);<\/code><\/pre>\n+<p>Note that C++11 also added <em>bind expressions<\/em> as a way to write a function object for partial application, using <code>std::bind<\/code> and related facilities from the Standard Library. <code>std::bind<\/code> generalizes and replaces some of the binders from C++03. Bind expressions are not permitted in HotSpot code. They don't provide enough benefit over lambdas or local function classes in the cases where bind expressions are applicable to warrant the introduction of yet another mechanism in this space into HotSpot code.<\/p>\n+<p>References:<\/p>\n+<ul>\n+<li>Local and unnamed types as template parameters (<a href=\"http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2008\/n2657.htm\">n2657<\/a>)<\/li>\n+<li>New wording for C++0x lambdas (<a href=\"http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2009\/n2927.pdf\">n2927<\/a>)<\/li>\n+<li>Generalized lambda capture (init-capture) (<a href=\"https:\/\/isocpp.org\/files\/papers\/N3648.html\">N3648<\/a>)<\/li>\n+<li>Generic (polymorphic) lambda expressions (<a href=\"https:\/\/isocpp.org\/files\/papers\/N3649.html\">N3649<\/a>)<\/li>\n+<\/ul>\n+<p>References from C++17<\/p>\n+<ul>\n+<li>Wording for constexpr lambda (<a href=\"http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2016\/p0170r1.pdf\">p0170r1<\/a>)<\/li>\n+<li>Lambda capture of *this by Value (<a href=\"http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2016\/p0018r3.html\">p0018r3<\/a>)<\/li>\n+<\/ul>\n+<p>References from C++20<\/p>\n+<ul>\n+<li>Allow lambda capture [=, this] (<a href=\"http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2017\/p0409r2.html\">p0409r2<\/a>)<\/li>\n+<li>Familiar template syntax for generic lambdas (<a href=\"http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2017\/p0428r2.pdf\">p0428r2<\/a>)<\/li>\n+<li>Simplifying implicit lambda capture (<a href=\"http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2017\/p0588r1.html\">p0588r1<\/a>)<\/li>\n+<li>Default constructible and assignable stateless lambdas (<a href=\"http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2017\/p0624r2.pdf\">p0624r2<\/a>)<\/li>\n+<li>Lambdas in unevaluated contexts (<a href=\"http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2017\/p0315r4.pdf\">p0315r4<\/a>)<\/li>\n+<li>Allow pack expansion in lambda init-capture (<a href=\"http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2018\/p0780r2.html\">p0780r2<\/a>) (<a href=\"http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2020\/p2095r0.html\">p2095r0<\/a>)<\/li>\n+<li>Deprecate implicit capture of this via [=] (<a href=\"http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2018\/p0806r2.html\">p0806r2<\/a>)<\/li>\n+<\/ul>\n+<p>References from C++23<\/p>\n+<ul>\n+<li>Make () more optional for lambdas (<a href=\"http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2020\/p1102r2.html\">p1102r2<\/a>)<\/li>\n+<\/ul>\n@@ -308,1 +423,0 @@\n-<li><p>Local and unnamed types as template parameters (<a href=\"http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2008\/n2657.htm\">n2657<\/a>)<\/p><\/li>\n@@ -340,1 +454,0 @@\n-<li><p>Lambdas<\/p><\/li>\n","filename":"doc\/hotspot-style.html","additions":117,"deletions":4,"binary":false,"changes":121,"status":"modified"},{"patch":"@@ -599,3 +599,1 @@\n-* Generic lambdas.  Lambdas are not (yet) permitted.\n-\n-* Lambda init captures.  Lambdas are not (yet) permitted.\n+* Also see [lambda expressions](#lambdaexpressions).\n@@ -706,0 +704,267 @@\n+### Local Function Objects\n+\n+* Local function objects, including lambda expressions, may be used.\n+* Lambda expressions must only be used as a downward value.\n+* Prefer `[&]` as the capture list of a lambda expression.\n+* Return type deduction for lambda expressions is permitted, and indeed encouraged.\n+* An empty parameter list for a lambda expression may be elided.\n+* A lambda expression must not be `mutable`.\n+* Generic lambda expressions are permitted.\n+* Lambda expressions should be relatively simple.\n+* Anonymous lambda expressions should not overly clutter the enclosing expression.\n+* An anonymous lambda expression must not be directly invoked.\n+* Bind expressions are forbidden.\n+\n+Single-use function objects can be defined locally within a function,\n+directly at the point of use.  This is an alternative to having a function\n+or function object class defined at class or namespace scope.\n+\n+This usage was somewhat limited by C++03, which does not permit such a class\n+to be used as a template parameter.  That restriction was removed by C++11\n+([n2657]). Use of this feature is permitted.\n+\n+Many HotSpot protocols involve \"function-like\" objects that involve some\n+named member function rather than a call operator.  For example, a function\n+that performs some action on all threads might be written as\n+\n+```\n+void do_something() {\n+  struct DoSomething : public ThreadClosure {\n+    virtual void do_thread(Thread* t) {\n+      ... do something with t ...\n+    }\n+  } closure;\n+  Threads::threads_do(&closure);\n+}\n+```\n+\n+HotSpot code has historically usually placed the DoSomething class at\n+namespace (or sometimes class) scope.  This separates the function's code\n+from its use, often to the detriment of readability.  It requires giving the\n+class a globally unique name (if at namespace scope).  It also loses the\n+information that the class is intended for use in exactly one place, and\n+does not have any subclasses.  (However, the latter can now be indicated by\n+declaring it `final`.)  Often, for simplicity, a local class will skip\n+things like access control and accessor functions, giving the enclosing\n+function direct access to the implementation and eliminating some\n+boilerplate that might be provided if the class is in some outer (more\n+accessible) scope.  On the other hand, if there is a lot of surrounding code\n+in the function body or the local class is of significant size, defining it\n+locally can increase clutter and reduce readability.\n+\n+<a name=\"lambdaexpressions\"><\/a>\n+C++11 added _lambda expressions_ as a new way to write a function object.\n+Simple lambda expressions can be significantly more concise than a function\n+object, eliminating a lot of boiler-plate.  On the other hand, a complex\n+lambda expression may not provide much, if any, readability benefit compared\n+to an ordinary function object.  Also, while a lambda can encapsulate a call\n+to a \"function-like\" object, it cannot be used in place of such.\n+\n+A common use for local functions is as one-use [RAII] objects.  The amount\n+of boilerplate for a function object class (local or not) makes such usage\n+somewhat clumsy and verbose.  But with the help of a small amount of\n+supporting utility code, lambdas work particularly well for this use case.\n+\n+Another use for local functions is [partial application][PARTIALAPP].  Again\n+here, lambdas are typically much simpler and less verbose than function\n+object classes.\n+\n+Because of these benefits, lambda expressions are permitted in HotSpot code,\n+with some restrictions and usage guidance.  An anonymous lambda is one which\n+is passed directly as an argument.  A named lambda is the value of a\n+variable, which is its name.\n+\n+Lambda expressions should only be passed downward.  In particular, a lambda\n+should not be returned from a function or stored in a global variable,\n+whether directly or as the value of a member of some other object.  Lambda\n+capture is syntactically subtle (by design), and propagating a lambda in\n+such ways can easily pass references to captured values to places where they\n+are no longer valid.  In particular, members of the enclosing `this` object\n+are effectively captured by reference, even if the default capture is\n+by-value.  For such uses-cases a function object class should be used to\n+make the desired value capturing and propagation explicit.\n+\n+Limiting the capture list to `[&]` (implicitly capture by reference) is a\n+simplifying restriction that still provides good support for HotSpot usage,\n+while reducing the cases a reader must recognize and understand.\n+\n+* Many common lambda uses require reference capture.  Not permitting it\n+would substantially reduce the utility of lambdas.\n+\n+* Referential transparency.  Implicit reference capture makes variable\n+references in the lambda body have the same meaning they would have in the\n+enclosing code.  There isn't a semantic barrier across which the meaning of\n+a variable changes.\n+\n+* Explicit reference capture introduces significant clutter, especially when\n+lambda expressions are relatively small and simple, as they should be in\n+HotSpot code.\n+\n+* There are a number of reasons why by-value capture might be used, but for\n+the most part they don't apply to HotSpot code, given other usage restrictions.\n+\n+    * A primary use-case for by-value capture is to support escaping uses,\n+    where values captured by-reference might become invalid.  That use-case\n+    doesn't apply if only downward lambdas are used.\n+\n+    * By-value capture can also make a lambda-local copy for mutation, which\n+    requires making the lambda `mutable`; see below.\n+\n+    * By-value capture might be viewed as an optimization, avoiding any\n+    overhead for reference capture of cheap to copy values.  But the\n+    compiler can often eliminate any such overhead.\n+\n+    * By-value capture by a non-`mutable` lambda makes the captured values\n+    const, preventing any modification by the lambda and making the captured\n+    value unaffected by modifications to the outer variable.  But this only\n+    applies to captured auto variables, not member variables, and is\n+    inconsistent with referential transparency.\n+\n+* Non-capturing lambdas (with an empty capture list - `[]`) have limited\n+utility.  There are cases where no captures are required (pure functions,\n+for example), but if the function is small and simple then that's obvious\n+anyway.\n+\n+* Capture initializers (a C++14 feature - [N3649]) are not permitted.\n+Capture initializers inherently increase the complexity of the capture list,\n+and provide little benefit over an additional in-scope local variable.\n+\n+The use of `mutable` lambda expressions is forbidden because there don't\n+seem to be many, if any, good use-cases for them in HotSpot.  A lambda\n+expression needs to be mutable in order to modify a by-value captured value.\n+But with only downward lambdas, such usage seems likely to be rare and\n+complicated.  It is better to use a function object class in any such cases\n+that arise, rather than requiring all HotSpot developers to understand this\n+relatively obscure feature.\n+\n+While it is possible to directly invoke an anonymous lambda expression, that\n+feature should not be used, as such a form can be confusing to readers.\n+Instead, name the lambda and call it by name.\n+\n+Some reasons to prefer a named lambda instead of an anonymous lambda are\n+\n+* The body contains non-trivial control flow or declarations or other nested\n+constructs.\n+\n+* Its role in an argument list is hard to guess without examining the\n+function declaration.  Give it a name that indicates its purpose.\n+\n+* It has an unusual capture list.\n+\n+* It has a complex explicit return type or parameter types.\n+\n+Lambda expressions, and particularly anonymous lambda expressions, should be\n+simple and compact.  One-liners are good.  Anonymous lambdas should usually\n+be limited to a couple lines of body code.  More complex lambdas should be\n+named.  A named lambda should not clutter the enclosing function and make it\n+long and complex; do continue to break up large functions via the use of\n+separate helper functions.\n+\n+An anonymous lambda expression should either be a one-liner in a one-line\n+expression, or isolated in its own set of lines.  Don't place part of a\n+lambda expression on the same line as other arguments to a function.  The\n+body of a multi-line lambda argument should be indented from the start of\n+the capture list, as if that were the start of an ordinary function\n+definition.  The body of a multi-line named lambda should be indented one\n+step from the variable's indentation.\n+\n+Some examples:\n+\n+1. `foo([&] { ++counter; });`\n+2. `foo(x, [&] { ++counter; });`\n+3. `foo([&] { if (predicate) ++counter; });`\n+4. `foo([&] { auto tmp = process(x); tmp.f(); return tmp.g(); })`\n+5. Separate one-line lambda from other arguments:\n+\n+    ```\n+    foo(c.begin(), c.end(),\n+        [&] (const X& x) { do_something(x); return x.value(); });\n+    ```\n+6. Indentation for multi-line lambda:\n+\n+    ```\n+    c.do_entries([&] (const X& x) {\n+                   do_something(x, a);\n+                   do_something1(x, b);\n+                   do_something2(x, c);\n+                 });\n+    ```\n+7. Separate multi-line lambda from other arguments:\n+\n+    ```\n+    foo(c.begin(), c.end(),\n+        [&] (const X& x) {\n+          do_something(x, a);\n+          do_something1(x, b);\n+          do_something2(x, c);\n+        });\n+    ```\n+8. Multi-line named lambda:\n+\n+    ```\n+    auto do_entry = [&] (const X& x) {\n+      do_something(x, a);\n+      do_something1(x, b);\n+      do_something2(x, c);\n+    };\n+    ```\n+\n+Item 4, and especially items 6 and 7, are pushing the simplicity limits for\n+anonymous lambdas.  Item 6 might be better written using a named lambda:\n+```\n+c.do_entries(do_entry);\n+```\n+\n+Note that C++11 also added _bind expressions_ as a way to write a function\n+object for partial application, using `std::bind` and related facilities\n+from the Standard Library.  `std::bind` generalizes and replaces some of the\n+binders from C++03.  Bind expressions are not permitted in HotSpot code.\n+They don't provide enough benefit over lambdas or local function classes in\n+the cases where bind expressions are applicable to warrant the introduction\n+of yet another mechanism in this space into HotSpot code.\n+\n+References:\n+\n+* Local and unnamed types as template parameters ([n2657])\n+* New wording for C++0x lambdas ([n2927])\n+* Generalized lambda capture (init-capture) ([N3648])\n+* Generic (polymorphic) lambda expressions ([N3649])\n+\n+[n2657]: http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2008\/n2657.htm \n+[n2927]: http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2009\/n2927.pdf\n+[N3648]: https:\/\/isocpp.org\/files\/papers\/N3648.html\n+[N3649]: https:\/\/isocpp.org\/files\/papers\/N3649.html\n+\n+References from C++17\n+\n+* Wording for constexpr lambda ([p0170r1])\n+* Lambda capture of *this by Value ([p0018r3])\n+\n+[p0170r1]: http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2016\/p0170r1.pdf\n+[p0018r3]: http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2016\/p0018r3.html\n+\n+References from C++20\n+\n+* Allow lambda capture [=, this] ([p0409r2])\n+* Familiar template syntax for generic lambdas ([p0428r2])\n+* Simplifying implicit lambda capture ([p0588r1])\n+* Default constructible and assignable stateless lambdas ([p0624r2])\n+* Lambdas in unevaluated contexts ([p0315r4])\n+* Allow pack expansion in lambda init-capture ([p0780r2]) ([p2095r0])\n+* Deprecate implicit capture of this via [=] ([p0806r2])\n+\n+[p0409r2]: http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2017\/p0409r2.html\n+[p0428r2]: http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2017\/p0428r2.pdf\n+[p0588r1]: http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2017\/p0588r1.html\n+[p0624r2]: http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2017\/p0624r2.pdf\n+[p0315r4]: http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2017\/p0315r4.pdf\n+[p0780r2]: http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2018\/p0780r2.html\n+[p2095r0]: http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2020\/p2095r0.html\n+[p0806r2]: http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2018\/p0806r2.html\n+\n+References from C++23\n+\n+* Make () more optional for lambdas  ([p1102r2])\n+\n+[p1102r2]: http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2020\/p1102r2.html\n+\n@@ -760,3 +1025,0 @@\n-* Local and unnamed types as template parameters\n-([n2657](http:\/\/www.open-std.org\/jtc1\/sc22\/wg21\/docs\/papers\/2008\/n2657.htm))\n-\n@@ -840,3 +1102,0 @@\n-* Lambdas\n-\n-\n@@ -857,0 +1116,3 @@\n+\n+[PARTIALAPP]: https:\/\/en.wikipedia.org\/wiki\/Partial_application\n+  \"Partial Application\"\n","filename":"doc\/hotspot-style.md","additions":271,"deletions":9,"binary":false,"changes":280,"status":"modified"}]}