{"files":[{"patch":"@@ -83,3 +83,8 @@\n- * <p> Unless otherwise noted, {@linkplain java.nio.file##links symbolic links}\n- * are automatically redirected to the <i>target<\/i> of the link, whether they\n- * are provided by a pathname string or via a {@code File} object.\n+ * <p> Many operating systems and file systems have support for\n+ * {@linkplain java.nio.file##links symbolic links}.\n+ * A symbolic link is a special file that serves as a reference to another file.\n+ * Unless otherwise specified, symbolic links are transparent to applications\n+ * and operations on files that are symbolic links are automatically redirected\n+ * to the target of the link.  Methods that only operate on the abstract\n+ * pathname do not access the file system and thus do not resolve symbolic\n+ * links.\n@@ -92,2 +97,2 @@\n- * absolute pathname.  For example, the directory denoted by the abstract\n- * pathname {@code \"\/usr\"} is an ancestor of the directory denoted by the\n+ * absolute pathname.  For example, the directory located by the abstract\n+ * pathname {@code \"\/usr\"} is an ancestor of the directory located by the\n@@ -116,2 +121,2 @@\n- * <p> Instances of this class may or may not denote an actual file-system\n- * object such as a file or a directory.  If it does denote such an object\n+ * <p> Instances of this class may or may not locate an actual file-system\n+ * object such as a file or a directory.  If it does locate such an object\n@@ -451,1 +456,1 @@\n-     * Returns the name of the file or directory denoted by this abstract\n+     * Returns the name component of this abstract\n@@ -456,1 +461,1 @@\n-     * @return  The name of the file or directory denoted by this abstract\n+     * @return  The name component of this abstract\n@@ -595,1 +600,1 @@\n-     * <p> Every pathname that denotes an existing file or directory has a\n+     * <p> Every pathname that locates an existing file or directory has a\n@@ -604,1 +609,1 @@\n-     * @return  The canonical pathname string denoting the same file or\n+     * @return  The canonical pathname string locating the same file or\n@@ -626,1 +631,1 @@\n-     * @return  The canonical pathname string denoting the same file or\n+     * @return  The canonical pathname string locating the same file or\n@@ -659,1 +664,1 @@\n-     * the file denoted by this abstract pathname is a directory, then the\n+     * the file located by this abstract pathname is a directory, then the\n@@ -692,1 +697,1 @@\n-     * determined that the file denoted by this abstract pathname is a\n+     * determined that the file located by this abstract pathname is a\n@@ -743,1 +748,1 @@\n-     * Tests whether the application can read the file denoted by this\n+     * Tests whether the application can read the file located by this\n@@ -749,1 +754,1 @@\n-     * @return  {@code true} if and only if the file specified by this\n+     * @return  {@code true} if and only if the file located by this\n@@ -761,1 +766,1 @@\n-     * Tests whether the application can modify the file denoted by this\n+     * Tests whether the application can modify the file located by this\n@@ -768,1 +773,1 @@\n-     *          contains a file denoted by this abstract pathname <em>and<\/em>\n+     *          contains a file located by this abstract pathname <em>and<\/em>\n@@ -780,1 +785,1 @@\n-     * Tests whether the file or directory denoted by this abstract pathname\n+     * Tests whether the file or directory located by this abstract pathname\n@@ -783,1 +788,1 @@\n-     * @return  {@code true} if and only if the file or directory denoted\n+     * @return  {@code true} if and only if the file or directory located\n@@ -794,1 +799,1 @@\n-     * Tests whether the file denoted by this abstract pathname is a\n+     * Tests whether the file located by this abstract pathname is a\n@@ -803,1 +808,1 @@\n-     * @return {@code true} if and only if the file denoted by this\n+     * @return {@code true} if and only if the file located by this\n@@ -815,1 +820,1 @@\n-     * Tests whether the file denoted by this abstract pathname is a normal\n+     * Tests whether the file located by this abstract pathname is a normal\n@@ -826,1 +831,1 @@\n-     * @return  {@code true} if and only if the file denoted by this\n+     * @return  {@code true} if and only if the file located by this\n@@ -838,1 +843,1 @@\n-     * Tests whether the file named by this abstract pathname is a hidden\n+     * Tests whether the file located by this abstract pathname is a hidden\n@@ -852,1 +857,1 @@\n-     * @return  {@code true} if and only if the file denoted by this\n+     * @return  {@code true} if and only if the file located by this\n@@ -866,1 +871,1 @@\n-     * Returns the time that the file denoted by this abstract pathname was\n+     * Returns the time that the file located by this abstract pathname was\n@@ -900,2 +905,2 @@\n-     * Returns the length of the file denoted by this abstract pathname.\n-     * The return value is unspecified if this pathname denotes a directory.\n+     * Returns the length of the file located by this abstract pathname.\n+     * The return value is unspecified if this pathname locates a directory.\n@@ -909,1 +914,1 @@\n-     * @return  The length, in bytes, of the file denoted by this abstract\n+     * @return  The length, in bytes, of the file located by this abstract\n@@ -912,1 +917,1 @@\n-     *          denoting system-dependent entities such as devices or pipes.\n+     *          locating system-dependent entities such as devices or pipes.\n@@ -938,1 +943,1 @@\n-     *          already exists\n+     *          already exists, including if it is a symbolic link\n@@ -953,3 +958,3 @@\n-     * Deletes the file or directory denoted by this abstract pathname.  If\n-     * this pathname denotes a directory, then the directory must be empty in\n-     * order to be deleted.  If this pathname denotes a symbolic link, then the\n+     * Deletes the file or directory located by this abstract pathname.  If\n+     * this pathname locates a directory, then the directory must be empty in\n+     * order to be deleted.  If this pathname locates a symbolic link, then the\n@@ -974,1 +979,1 @@\n-     * Requests that the file or directory denoted by this abstract\n+     * Requests that the file or directory located by this abstract\n@@ -976,1 +981,1 @@\n-     * If this pathname denotes a symbolic link, then the\n+     * If this pathname locates a symbolic link, then the\n@@ -1006,1 +1011,1 @@\n-     * directory denoted by this abstract pathname.\n+     * directory located by this abstract pathname.\n@@ -1008,1 +1013,1 @@\n-     * <p> If this abstract pathname does not denote a directory, then this\n+     * <p> If this abstract pathname does not locate a directory, then this\n@@ -1011,1 +1016,1 @@\n-     * denoting the directory itself and the directory's parent directory are\n+     * locating the directory itself and the directory's parent directory are\n@@ -1026,1 +1031,1 @@\n-     *          directory denoted by this abstract pathname.  The array will be\n+     *          directory located by this abstract pathname.  The array will be\n@@ -1028,1 +1033,1 @@\n-     *          this abstract pathname does not denote a directory, or if an\n+     *          this abstract pathname does not locate a directory, or if an\n@@ -1037,1 +1042,1 @@\n-     * directory denoted by this abstract pathname.  The strings are\n+     * directory located by this abstract pathname.  The strings are\n@@ -1041,1 +1046,1 @@\n-     *          directory denoted by this abstract pathname.  The array will be\n+     *          directory located by this abstract pathname.  The array will be\n@@ -1043,1 +1048,1 @@\n-     *          this abstract pathname does not denote a directory, or if an\n+     *          this abstract pathname does not locate a directory, or if an\n@@ -1063,1 +1068,1 @@\n-     * directory denoted by this abstract pathname that satisfy the specified\n+     * directory located by this abstract pathname that satisfy the specified\n@@ -1071,1 +1076,1 @@\n-     * file or directory in the directory that it denotes.\n+     * file or directory in the directory that it locates.\n@@ -1077,1 +1082,1 @@\n-     *          directory denoted by this abstract pathname that were accepted\n+     *          directory located by this abstract pathname that were accepted\n@@ -1080,1 +1085,1 @@\n-     *          Returns {@code null} if this abstract pathname does not denote\n+     *          Returns {@code null} if this abstract pathname does not locate\n@@ -1100,2 +1105,2 @@\n-     * Returns an array of abstract pathnames denoting the files in the\n-     * directory denoted by this abstract pathname.\n+     * Returns an array of abstract pathnames locating the files in the\n+     * directory located by this abstract pathname.\n@@ -1103,1 +1108,1 @@\n-     * <p> If this abstract pathname does not denote a directory, then this\n+     * <p> If this abstract pathname does not locate a directory, then this\n@@ -1106,1 +1111,1 @@\n-     * denoting the directory itself and the directory's parent directory are\n+     * locating the directory itself and the directory's parent directory are\n@@ -1124,2 +1129,2 @@\n-     * @return  An array of abstract pathnames denoting the files and\n-     *          directories in the directory denoted by this abstract pathname.\n+     * @return  An array of abstract pathnames locating the files and\n+     *          directories in the directory located by this abstract pathname.\n@@ -1127,1 +1132,1 @@\n-     *          {@code null} if this abstract pathname does not denote a\n+     *          {@code null} if this abstract pathname does not locate a\n@@ -1144,2 +1149,2 @@\n-     * Returns an array of abstract pathnames denoting the files and\n-     * directories in the directory denoted by this abstract pathname that\n+     * Returns an array of abstract pathnames locating the files and\n+     * directories in the directory located by this abstract pathname that\n@@ -1154,1 +1159,1 @@\n-     * the directory that it denotes.\n+     * the directory that it locates.\n@@ -1159,2 +1164,2 @@\n-     * @return  An array of abstract pathnames denoting the files and\n-     *          directories in the directory denoted by this abstract pathname.\n+     * @return  An array of abstract pathnames locating the files and\n+     *          directories in the directory located by this abstract pathname.\n@@ -1162,1 +1167,1 @@\n-     *          {@code null} if this abstract pathname does not denote a\n+     *          {@code null} if this abstract pathname does not locate a\n@@ -1180,2 +1185,2 @@\n-     * Returns an array of abstract pathnames denoting the files and\n-     * directories in the directory denoted by this abstract pathname that\n+     * Returns an array of abstract pathnames locating the files and\n+     * directories in the directory located by this abstract pathname that\n@@ -1193,2 +1198,2 @@\n-     * @return  An array of abstract pathnames denoting the files and\n-     *          directories in the directory denoted by this abstract pathname.\n+     * @return  An array of abstract pathnames locating the files and\n+     *          directories in the directory located by this abstract pathname.\n@@ -1196,1 +1201,1 @@\n-     *          {@code null} if this abstract pathname does not denote a\n+     *          {@code null} if this abstract pathname does not locate a\n@@ -1258,2 +1263,2 @@\n-     * Renames the file denoted by this abstract pathname.  If this pathname\n-     * denotes a symbolic link, then the link itself, not its target, will be\n+     * Renames the file located by this abstract pathname.  If this pathname\n+     * locates a symbolic link, then the link itself, not its target, will be\n@@ -1294,1 +1299,1 @@\n-     * Sets the last-modified time of the file or directory named by this\n+     * Sets the last-modified time of the file or directory located by this\n@@ -1323,1 +1328,1 @@\n-     * Marks the file or directory named by this abstract pathname so that\n+     * Marks the file or directory located by this abstract pathname so that\n@@ -1344,1 +1349,2 @@\n-     * Sets the owner's or everybody's write permission for this abstract\n+     * Sets the owner's or everybody's write permission of the file or\n+     * directory located by this abstract\n@@ -1378,1 +1384,2 @@\n-     * A convenience method to set the owner's write permission for this abstract\n+     * A convenience method to set the owner's write permission for the file\n+     * or directory located by this abstract\n@@ -1405,1 +1412,2 @@\n-     * Sets the owner's or everybody's read permission for this abstract\n+     * Sets the owner's or everybody's read permission for the file or directory\n+     * located by this abstract\n@@ -1445,1 +1453,2 @@\n-     * A convenience method to set the owner's read permission for this abstract\n+     * A convenience method to set the owner's read permission for the file\n+     * or directory located by this abstract\n@@ -1478,1 +1487,2 @@\n-     * Sets the owner's or everybody's execute permission for this abstract\n+     * Sets the owner's or everybody's execute permission for the file or\n+     * directory located by this abstract\n@@ -1518,1 +1528,2 @@\n-     * A convenience method to set the owner's execute permission for this\n+     * A convenience method to set the owner's execute permission for the file\n+     * or directory located by this\n@@ -1551,1 +1562,1 @@\n-     * Tests whether the application can execute the file denoted by this\n+     * Tests whether the application can execute the file located by this\n@@ -1797,1 +1808,1 @@\n-     * <li> The file denoted by the returned abstract pathname did not exist\n+     * <li> The file located by the returned abstract pathname did not exist\n@@ -1840,1 +1851,1 @@\n-     * abstract pathname is valid and denotes an existing, writable directory,\n+     * abstract pathname is valid and locates an existing, writable directory,\n@@ -1857,1 +1868,1 @@\n-     * @return  An abstract pathname denoting a newly-created empty file\n+     * @return  An abstract pathname locating a newly-created empty file\n@@ -1914,1 +1925,1 @@\n-     * @return  An abstract pathname denoting a newly-created empty file\n+     * @return  An abstract pathname locating a newly-created empty file\n@@ -1937,1 +1948,3 @@\n-     * Microsoft Windows systems it is not.\n+     * Microsoft Windows systems it is not.  This method only compares the\n+     * abstract pathnames; it does not access the file system and the file is\n+     * not required to exist.\n@@ -1961,5 +1974,3 @@\n-     * on Microsoft Windows systems it is not.\n-     *\n-     * @apiNote This method only tests whether the abstract pathnames are equal;\n-     *          it does not access the file system and the file is not required\n-     *          to exist.\n+     * on Microsoft Windows systems it is not.  This method only tests whether\n+     * the abstract pathnames are equal; it does not access the file system and\n+     * the file is not required to exist.\n","filename":"src\/java.base\/share\/classes\/java\/io\/File.java","additions":99,"deletions":88,"binary":false,"changes":187,"status":"modified"}]}