{"files":[{"patch":"@@ -38,1 +38,1 @@\n-Becoming an [Author](https:\/\/openjdk.java.net\/bylaws#author) is the first step. To achieve this you need to contribute two non-trivial changes to the project in which you wish to become an Author. Once your changes are pushed into the code base and has been vetted enough to determine that the changes was indeed good changes you can go ahead and send an email to the project lead of that particular project and ask to be added as an Author.\n+Becoming an [Author](https:\/\/openjdk.java.net\/bylaws#author) is the first step. To achieve this you need to contribute two non-trivial changes to the project in which you wish to become an Author. Once your changes are pushed into the code base and has been vetted enough to determine that the changes were indeed good changes you can go ahead and send an email to the project lead of that particular project and ask to be added as an Author.\n@@ -56,0 +56,2 @@\n+Once you are deemed ready, a Reviewer in the project can start a vote by sending an email proposing that you should become a Reviewer. The email should follow the template found in the [OpenJDK Project description](https:\/\/openjdk.java.net\/projects\/).\n+\n@@ -60,1 +62,1 @@\n-Instead of describing the significant change (because that's quite difficult) provided here is a few examples of changes that would not be considered significant or for other reasnons wouldn't count as significant contributions.\n+Instead of describing the significant change (because that's quite difficult to define) provided here is a few examples of changes that wouldn't be considered significant or for other reasons wouldn't count as significant contributions.\n@@ -64,1 +66,1 @@\n-* Larger changes where only a non-significant portion of the work was done by the proposed Committer\n+* Larger changes where only a non-significant portion of the work was done by the Contributor under vote\n@@ -69,1 +71,1 @@\n-Contributing to OpenJDK can take many forms. Writing code and providing patches is just one of them. A big part of developing a feature or a bugfix is testing and code review. Anything you can do to help out in these areas will be recognised as a contribution. Join the [mailing lists](#mailing-lists) to engage in design discussions and reviews, and dowload the latest EA builds or project repositories to try out new features and give feedback.\n+Contributing to OpenJDK can take many forms. Writing code and providing patches is just one of them. A big part of developing a feature or a bugfix is testing and code review. Anything you can do to help out in these areas will be recognized as a contribution. Join the [mailing lists](#mailing-lists) to engage in design discussions and reviews, and download the latest EA builds or project repositories to try out new features and give feedback.\n@@ -71,1 +73,1 @@\n-Anything you can do to spread the word about Java, new features, and your experiences using the JDK will be helpful for the community and to the OpenJDK developers. Trying out a new feature and reporting your experiences is also a contribution. Wether you find that the new feature imroves your application, or if you find some area that needs to be improved, your feedback is valuable to the developers of that feature.\n+Anything you can do to spread the word about Java, new features, and your experiences using the JDK will be helpful for the community and to the OpenJDK developers. Trying out a new feature and reporting your experiences is also a contribution. Whether you find that the new feature improves your application, or if you find some area that needs to be improved, your feedback is valuable to the developers of that feature.\n@@ -75,1 +77,1 @@\n-If you're in a position to choose what programming language to use in a project, in a tutorial, or in a class, you have the power to enlarge the Java community in a very direct way, and your colleagues or students will get an oportunity to learn the most used programming language in the world.\n+If you're in a position to choose what programming language to use in a project, in a tutorial, or in a class, you have the power to enlarge the Java community in a very direct way, and your colleagues or students will get an opportunity to learn the most used programming language in the world.\n","filename":"src\/index.md","additions":8,"deletions":6,"binary":false,"changes":14,"status":"modified"}]}