{"files":[{"patch":"@@ -280,7 +280,8 @@\n-    Each documented package, class and interface has its own Use page.  This page describes what \\\n-    packages, classes, methods, constructors and fields use any part of the given class or \\\n-    package. Given a class or interface A, its Use page includes subclasses of A, fields declared \\\n-    as A, methods that return A, methods and constructors with parameters of type A, and \\\n-    subclasses with parameters of type A.  \\\n-    You can access this page by first going to the package, class or interface, then clicking on \\\n-    the USE link in the navigation bar.\n+    Each documented package, class or interface has its own Use page, which lists \\\n+    packages, classes, interfaces, methods, constructors and fields that use any \\\n+    part of that package, class or interface. Given a class or interface A, its \\\n+    Use page includes subclasses or subinterfaces of A, fields declared as A, \\\n+    methods that return A, methods and constructors with parameters of type A, \\\n+    and subclasses or subinterfaces with parameters of type A. You can access \\\n+    this page by first going to the package, class or interface, then clicking \\\n+    on the USE link in the navigation bar.\n","filename":"src\/jdk.javadoc\/share\/classes\/jdk\/javadoc\/internal\/doclets\/formats\/html\/resources\/standard.properties","additions":8,"deletions":7,"binary":false,"changes":15,"status":"modified"},{"patch":"@@ -98,1 +98,1 @@\n-     * Mapping of TypeElements to list of TypeElements which use this class in a superclass type parameter.\n+     * Mapping of TypeElements to list of TypeElements which use them in superclass type parameters.\n@@ -103,1 +103,1 @@\n-     * Mapping of TypeElements to list of TypeElements which use this class in a superclass type parameter.\n+     * Mapping of TypeElements to list of TypeElements which use them in superinterface type parameters.\n@@ -108,1 +108,1 @@\n-     * Mapping of TypeElements to list of TypeElements which use this interface in a superinterface type parameter.\n+     * Mapping of TypeElements to list of TypeElements which use them in implemented interface type parameters.\n","filename":"src\/jdk.javadoc\/share\/classes\/jdk\/javadoc\/internal\/doclets\/toolkit\/util\/ClassUseMapper.java","additions":3,"deletions":3,"binary":false,"changes":6,"status":"modified"}]}