{"files":[{"patch":"@@ -60,1 +60,1 @@\n- *           {@link javafx.scene.control.TableCell or {@link javafx.scene.control.TreeTableCell}}).\n+ *           {@link javafx.scene.control.TableCell} or {@link javafx.scene.control.TreeTableCell}).\n","filename":"modules\/javafx.controls\/src\/main\/java\/javafx\/scene\/control\/skin\/TableRowSkinBase.java","additions":1,"deletions":1,"binary":false,"changes":2,"status":"modified"},{"patch":"@@ -4283,1 +4283,1 @@\n-      <li>scroll-bar:horizontall &mdash; ScrollBar<\/li>\n+      <li>scroll-bar:horizontal &mdash; ScrollBar<\/li>\n","filename":"modules\/javafx.graphics\/src\/main\/docs\/javafx\/scene\/doc-files\/cssref.html","additions":1,"deletions":1,"binary":false,"changes":2,"status":"modified"},{"patch":"@@ -41,1 +41,1 @@\n- * When mouse event occurs, the top-most node under cursor is picked and\n+ * When a mouse event occurs, the top-most node under cursor is picked and\n@@ -60,1 +60,1 @@\n- * press-drag-release gesture is delivered to one node. When mouse\n+ * press-drag-release gesture is delivered to one node. When a mouse\n@@ -99,1 +99,1 @@\n- * When mouse enters a node, the node gets {@code MOUSE_ENTERED} event, when\n+ * When the mouse enters a node, the node gets {@code MOUSE_ENTERED} event, when\n@@ -107,1 +107,1 @@\n- * receive the {@code MOUSE_ENTERED_TARGET} event when mouse entered\n+ * receive the {@code MOUSE_ENTERED_TARGET} event when the mouse entered\n@@ -109,1 +109,1 @@\n- * these two cases event target can be tested on equality with the node.\n+ * these two cases, the event target can be tested on equality with the node.\n@@ -142,1 +142,1 @@\n-     * This event occurs when mouse button is pressed. This activates a\n+     * This event occurs when a mouse button is pressed. This activates a\n@@ -150,1 +150,1 @@\n-     * This event occurs when mouse button is released. It is delivered\n+     * This event occurs when a mouse button is released. It is delivered\n@@ -158,1 +158,1 @@\n-     * This event occurs when mouse button has been clicked (pressed and\n+     * This event occurs when a mouse button has been clicked (pressed and\n@@ -168,1 +168,1 @@\n-     * This event occurs when mouse enters a node. It's the bubbling variant,\n+     * This event occurs when the mouse enters a node. It's the bubbling variant,\n@@ -180,1 +180,1 @@\n-     * This event occurs when mouse enters a node. This event type is delivered\n+     * This event occurs when the mouse enters a node. This event type is delivered\n@@ -190,1 +190,1 @@\n-     * This event occurs when mouse exits a node. It's the bubbling variant,\n+     * This event occurs when the mouse exits a node. It's the bubbling variant,\n@@ -202,1 +202,1 @@\n-     * This event occurs when mouse exits a node. This event type is delivered\n+     * This event occurs when the mouse exits a node. This event type is delivered\n@@ -212,1 +212,1 @@\n-     * This event occurs when mouse moves within a node and no buttons\n+     * This event occurs when the mouse moves within a node and no buttons\n@@ -220,1 +220,1 @@\n-     * This event occurs when mouse moves with a pressed button.\n+     * This event occurs when the mouse moves with a pressed button.\n","filename":"modules\/javafx.graphics\/src\/main\/java\/javafx\/scene\/input\/MouseEvent.java","additions":14,"deletions":14,"binary":false,"changes":28,"status":"modified"}]}