{"files":[{"patch":"@@ -42,3 +42,3 @@\n- * A {@code SpotLight} is a {@code PointLight} that radiates light in a cone in a specific direction. The direction is\n- * defined by the {@link #directionProperty() direction} vector property relative to the rotation of the\n- * {@code SpotLight} that is set with the rotation transforms of the node. For example, if the direction vector is\n+ * A {@code SpotLight} is a {@code PointLight} that radiates light in a cone in a specific direction.\n+ * The direction is defined by the {@link #directionProperty() direction} vector property of the light. The direction\n+ * can be rotated by setting a rotation transform on the {@code SpotLight}. For example, if the direction vector is\n@@ -58,1 +58,1 @@\n- * For a point whose vector to the light source forms an angle {@code theta} with the direction of the light, if\n+ * For a point whose vector to the light position forms an angle {@code theta} with the direction of the light, if\n@@ -143,3 +143,3 @@\n-     * The angle of the spotlight's inner cone (as shown in the class doc image). A point whose angle to the light's\n-     * origin is less than this angle is not attenuated by the spotlight factor ({@code spot = 1}). At larger angles,\n-     * the light intensity starts to drop.\n+     * The angle of the spotlight's inner cone, in degrees (as shown in the class doc image). A point whose angle to the\n+     * light's position is less than this angle is not attenuated by the spotlight factor ({@code spot = 1}). At larger\n+     * angles, the light intensity starts to drop.\n@@ -173,3 +173,4 @@\n-     * The angle of the spotlight's outer cone (as shown in the class doc image). A point whose angle to the light's\n-     * origin is greater than this angle receive no light ({@code spot = 0}). At smaller angles, the light intensity\n-     * starts to increase.\n+     * The angle of the spotlight's outer cone, in degrees (as shown in the class doc image). A point whose angle to the\n+     * light's position is greater than this angle receives no light ({@code spot = 0}). A point whose angle to the\n+     * light's position is less than the outer angle but greater than the inner angle receives partial intensity\n+     * governed by the falloff factor.\n@@ -203,5 +204,5 @@\n-     * The intensity falloff factor of the spotlight's outer cone. A point whose angle to the light's origin is greater\n-     * than the inner angle but less than the outer angle receives partial intensity governed by this factor. The larger\n-     * the falloff, the sharper the drop in intensity from the inner cone. A falloff factor of 1 gives a linear drop in\n-     * intensity, values greater than 1 give a convex drop, and values smaller than 1 give a concave drop. See the class\n-     * docs for the mathematical definitions.\n+     * The intensity falloff factor of the spotlight's outer cone. A point whose angle to the light's position is\n+     * greater than the inner angle but less than the outer angle receives partial intensity governed by this factor.\n+     * The larger the falloff, the sharper the drop in intensity from the inner cone. A falloff factor of 1 gives a\n+     * linear drop in intensity, values greater than 1 give a convex drop, and values smaller than 1 give a concave\n+     * drop. See the class docs for the mathematical definitions.\n","filename":"modules\/javafx.graphics\/src\/main\/java\/javafx\/scene\/SpotLight.java","additions":16,"deletions":15,"binary":false,"changes":31,"status":"modified"},{"patch":"@@ -76,1 +76,1 @@\n-\/\/ Because pow(0, 0) is undefined (https:\/\/docs.microsoft.com\/en-us\/windows\/win32\/direct3dhlsl\/dx-graphics-hlsl-pow),\n+\/\/ Because pow(0, 0) is undefined (https:\/\/www.khronos.org\/registry\/OpenGL-Refpages\/es3.0\/html\/pow.xhtml),\n","filename":"modules\/javafx.graphics\/src\/main\/resources\/com\/sun\/prism\/es2\/glsl\/main2Lights.frag","additions":1,"deletions":1,"binary":false,"changes":2,"status":"modified"}]}