{"files":[{"patch":"@@ -27,1 +27,3 @@\n-Oracle are the stewards of the OpenJDK project, and owns the Java brand. In order to make your patch available for review you must first sign the [Oracle Contributor Agreement](https:\/\/www.oracle.com\/technical-resources\/oracle-contributor-agreement.html) (OCA). This agreement gives Oracle and you as a contributor joint copyright interests in the code. You will retain your copyright while also granting those rights to Oracle. If you try to create a PR before you have signed the OCA, you will get instructions telling you to do so, and the PR will not be published until this is done.\n+Oracle are the stewards of the OpenJDK project, and owns the Java brand. In order to make your patch available for review you must first sign the [Oracle Contributor Agreement](https:\/\/www.oracle.com\/technical-resources\/oracle-contributor-agreement.html) (OCA). This agreement gives Oracle and you as a contributor joint copyright interests in the code. You will retain your copyright while also granting those rights to Oracle. \n+\n+When you sign the OCA, please make sure that you specify your GitHub user name in the `Username` field of the OCA. If you try to create a PR before you have signed the OCA, or if you did not specify your GitHub user name, you will get instructions telling you to do so, and the PR will not be published until this is done. OCA registration is a manual process. Please allow for up to several days to have your OCA application processed, even though it's normally processed swiftly.\n@@ -55,1 +57,1 @@\n-You must be in the list to send to the list. Some lists are moderated to keep the content on topic. Each list has its own archive where you can browse older conversations on the list.\n+You must be a member of the the list to be able to post to the list. Some lists are moderated to keep the content on topic. Each list has its own archive where you can browse older conversations on the list.\n","filename":"src\/index.md","additions":4,"deletions":2,"binary":false,"changes":6,"status":"modified"}]}