{"files":[{"patch":"@@ -1537,0 +1537,1 @@\n+* [JDK Release Notes](https:\/\/www.oracle.com\/java\/technologies\/javase\/jdk-relnotes-index.html)\n@@ -1540,1 +1541,1 @@\n-Release notes for a product (e.g. the JDK) are part of the release deliverables. They describe changes that are important for a user of the product to know about. This is usually things that may affect the user's decision to upgrade to the specific version.\n+Release notes for a product (e.g. the JDK) are part of the release deliverables. They describe changes that are important for a user of the product to know. These are usually things that may affect the user's decision to upgrade to the specific version.\n@@ -1542,1 +1543,1 @@\n-When writing a release note for your feature, be prepared for rather picky review comments about grammar, typos, and wording. This is for the sake of the Java community as a whole, as the language of the release note sets the tone for many blogs and news articles. For a widely used product like the JDK, the release notes are often copied (word by word, including typos) and published to highlight news in the release. This means that we need to take extra care to make sure the text in the release note is correct and has a professional language.\n+When writing a release note for your feature, be prepared for rather picky review comments about grammar, typos, and wording. This is for the sake of the Java community as a whole, as the language of the release note sets the tone for many blogs and news articles. For a widely used product like the JDK, the release notes are often copied verbatim (including typos) and published to highlight news in the release. This means that we need to take extra care to make sure the text in the release note is correct and has a professional language.\n@@ -1544,1 +1545,1 @@\n-The release note itself is written in a JBS sub-task to the issue that is used to push the change. There are a few steps to follow in order for the release note to find its way from JBS to the actual release note document.\n+The release note itself is written in a JBS sub-task to the issue that is used to push the change. There are a few steps to follow for the release note to find its way from JBS to the actual release note document.\n@@ -1588,1 +1589,1 @@\n-Also see [release-note](#release-note).\n+For examples of JDK release notes, see [JDK Release Notes](https:\/\/www.oracle.com\/java\/technologies\/javase\/jdk-relnotes-index.html).\n","filename":"src\/index.md","additions":5,"deletions":4,"binary":false,"changes":9,"status":"modified"}]}