{"files":[{"patch":"@@ -0,0 +1,35 @@\n+The Universal Permissive License (UPL), Version 1.0\n+\n+Subject to the condition set forth below, permission is hereby granted to\n+any person obtaining a copy of this software, associated documentation\n+and\/or data (collectively the \"Software\"), free of charge and under any\n+and all copyright rights in the Software, and any and all patent rights\n+owned or freely licensable by each licensor hereunder covering either (i)\n+the unmodified Software as contributed to or provided by such licensor,\n+or (ii) the Larger Works (as defined below), to deal in both\n+\n+(a) the Software, and\n+\n+(b) any piece of software and\/or hardware listed in the lrgrwrks.txt file\n+if one is included with the Software (each a \"Larger Work\" to which the\n+Software is contributed by such licensors),\n+\n+without restriction, including without limitation the rights to copy,\n+create derivative works of, display, perform, and distribute the Software\n+and make, use, sell, offer for sale, import, export, have made, and have\n+sold the Software and the Larger Work(s), and to sublicense the foregoing\n+rights on either these or other terms.\n+\n+This license is subject to the following condition:\n+\n+The above copyright notice and either this complete permission notice or\n+at a minimum a reference to the UPL must be included in all copies or\n+substantial portions of the Software.\n+\n+THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\n+OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n+MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN\n+NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,\n+DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR\n+OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE\n+USE OR OTHER DEALINGS IN THE SOFTWARE.\n","filename":"src\/utils\/hsdis\/LICENSE","additions":35,"deletions":0,"binary":false,"changes":35,"status":"added"}]}