{"files":[{"patch":"@@ -0,0 +1,1 @@\n+<<<<<<< HEAD\n@@ -12,0 +13,41 @@\n+=======\n+\n+Welcome to the JDK!\n+===================\n+\n+For information about building the JDK, including how to retrieve all\n+of the source code, please see either of these files:\n+\n+  * doc\/building.html   (html version)\n+  * doc\/building.md     (markdown version)\n+\n+See http:\/\/openjdk.java.net\/ for more information about the OpenJDK\n+Community and the JDK.\n+\n+---\n+About Project Panama\n+===================\n+This repository contains changes which aim at improving the interoperability between the Java programming language and native libraries, which is one of the main goals of Project Panama. More information can be found at: https:\/\/openjdk.java.net\/projects\/panama\/\n+\n+The Project Panama JBS dashboard can be found at: https:\/\/bugs.openjdk.java.net\/Dashboard.jspa?selectPageId=18412\n+\n+Early acccess (EA) binary snapshots can be found at: http:\/\/jdk.java.net\/panama\/\n+\n+About the panama-foreign repository\n+===================\n+This repository houses three main branches:\n+- **foreign-memaccess**: Contains the developement of the foreign memory access API for [JEP 370](https:\/\/openjdk.java.net\/jeps\/370), which can be used to interact with different kinds of memory resources, including so-called off-heap or native memory.\n+- **foreign-abi**: Contains the developement of the foreign function interface (FFI), which can be used to call native code in a .dll\/.so\/.dylib, or to create a native function pointer to a Java method which can be passed to code in a native library.\n+- **foreign-jextract**: Contains the development of an API to parse native headers, which can be used to create an abstract representation (declarations) from a C header file. This branch also provides an accompanying extraction tool (jextract), which is built on top of the API, and can be used to generate Java bindings to access functions and\/or structs in a native library described by a given header file.\n+\n+The foreign-jextract branch depends on the foreign-abi branch, which in turn depends on the foreign-memaccess branch. As such, the foreign-jextract branch is the most complete of the three and therefore the default branch of this repository.\n+\n+Building notes\n+===================\n+Jextract requires [LLVM 9.x](https:\/\/releases.llvm.org\/download.html) as a dependency. So, to build the foreign-jextract branch, the flag `--with-libclang=\/path\/to\/llvm\/root` must be supplied when generating a build configuration. Please see [doc\/building.md](doc\/building.md) for general building instructions.\n+\n+Samples\n+=======\n+\n+Please see [doc\/panama_jextract.md](doc\/panama_jextract.md) for examples on how to use `jextract` to work with common native libraries.\n+>>>>>>> 4d7888c040767760b6250130ef6024ea16b43461\n","filename":"README.md","additions":42,"deletions":0,"binary":false,"changes":42,"status":"modified"}]}