{"files":[{"patch":"@@ -663,1 +663,1 @@\n-\/\/ There are four phases of the collection.\n+\/\/ A collection consists of the following phases.\n@@ -666,1 +666,3 @@\n-\/\/      - summary phase\n+\/\/      - summary phase (single-threaded)\n+\/\/      - forward (to new address) phase\n+\/\/      - adjust pointers phase\n@@ -671,0 +673,1 @@\n+\/\/\n@@ -672,0 +675,1 @@\n+\/\/      - calculating destination-region for each region for better parallellism in following phases\n@@ -673,0 +677,1 @@\n+\/\/      - adjust pointers to reflect new destination of objects\n@@ -676,6 +681,0 @@\n-\/\/ These three phases are invoked in PSParallelCompact::invoke_no_policy().  The\n-\/\/ marking phase is implemented in PSParallelCompact::marking_phase() and does a\n-\/\/ complete marking of the heap.  The summary phase is implemented in\n-\/\/ PSParallelCompact::summary_phase().  The move and update phase is implemented\n-\/\/ in PSParallelCompact::compact().\n-\/\/\n@@ -717,1 +716,2 @@\n-\/\/ The summary phase is done using 1 GC thread.\n+\/\/ The forward (to new address) phase calculates the new address of each\n+\/\/ objects and records old-addr-to-new-addr asssociation.\n@@ -719,2 +719,1 @@\n-\/\/ The compaction phase moves objects to their new location and updates all\n-\/\/ references in the object.\n+\/\/ The adjust pointers phase remap all pointers to reflect the new address of each object.\n@@ -722,6 +721,1 @@\n-\/\/ A current exception is that objects that cross a region boundary are moved\n-\/\/ but do not have their references updated.  References are not updated because\n-\/\/ it cannot easily be determined if the klass pointer KKK for the object AAA\n-\/\/ has been updated.  KKK likely resides in a region to the left of the region\n-\/\/ containing AAA.  These AAA's have their references updated at the end in a\n-\/\/ clean up phase.  See the method PSParallelCompact::update_deferred_object().\n+\/\/ The compaction phase moves objects to their new location.\n","filename":"src\/hotspot\/share\/gc\/parallel\/psParallelCompact.hpp","additions":11,"deletions":17,"binary":false,"changes":28,"status":"modified"}]}