{"files":[{"patch":"@@ -23,1 +23,1 @@\n-The most common Issue types are:\n+The most common [Issue]{.jbs-field} types are:\n@@ -25,2 +25,2 @@\n-<table class=\"dictionary\" summary=\"JBS Label Dictionary\">\n-  <tr style=\"text-align:left;\"><th>Type<\/th><th>Covers<\/th><\/tr>\n+<table class=\"dictionary\" summary=\"JBS Issue Types\">\n+<tr style=\"text-align:left;\"><th>Issue Type<\/th><th>Covers<\/th><\/tr>\n@@ -32,5 +32,10 @@\n-    <td class=\"dictionary\"><i>Improvement<\/i><\/td>\n-    <td class=\"dictionary\">When requesting an improvement in the JDK, the issue type used depends on the size\/scope of the improvement:<br \/>\n-    ([Enhancement]{.jbs-field}) - for a small improvement to existing functionality<br \/>\n-    ([New Feature]{.jbs-field}) - not recommended to use<br \/>\n-([JEP]{.jbs-field}) - for a proposal for a significant change or new feature which will take 4 weeks or more of work - see [JEP-1](https:\/\/openjdk.org\/jeps\/1)<\/td>\n+    <td class=\"dictionary\">[Enhancement]{.jbs-field}<\/td>\n+    <td class=\"dictionary\">For a small improvement to existing functionality<br \/>\n+<\/tr>\n+<tr>\n+    <td class=\"dictionary\">[New Feature]{.jbs-field}<\/td>\n+    <td class=\"dictionary\">Not recommended to use<br \/><\/td>\n+<\/tr>\n+<tr>\n+    <td class=\"dictionary\">[JEP]{.jbs-field}<\/td>\n+    <td class=\"dictionary\">For a proposal for a significant change or new feature which will take 4 weeks or more of work - see [JEP-1](https:\/\/openjdk.org\/jeps\/1)<\/td>\n@@ -44,5 +49,1 @@\n-    <td class=\"dictionary\">Where something needs to happen other than a code change - a request for a new JBS version value for example<\/td>\n-<\/tr>\n-<tr>\n-    <td class=\"dictionary\"><i>Vulnerability<\/i><\/td>\n-    <td class=\"dictionary\">If you suspect that the issue is a vulnerability, **don't file a JBS issue**, instead send your report to [vuln-report@openjdk.org](mailto:vuln-report@openjdk.org). <br>Please do *not* report or discuss potential vulnerabilities on any open lists or other public channels. <br>See [OpenJDK Vulnerabilities](https:\/\/openjdk.org\/groups\/vulnerability\/report) for more information.<\/td>\n+    <td class=\"dictionary\">Where something needs to happen other than a code change - for example a request for a new JBS version, or other work associated with a release<\/td>\n@@ -51,0 +52,1 @@\n+Note: If you suspect that the issue is a vulnerability, **don't file a JBS issue**, instead send your report to [vuln-report@openjdk.org](mailto:vuln-report@openjdk.org), also use this alias if you find an existing report which may be a vulnerability. Please do *not* report or discuss potential vulnerabilities on any open lists or other public channels - see [OpenJDK Vulnerabilities](https:\/\/openjdk.org\/groups\/vulnerability\/report) for more information.\n@@ -90,1 +92,1 @@\n-When managing the work for a large change, especially when the work involves multiple engineers, it is recommended that the work is distributed across one or more \"implementation\" issues which should be linked to the main [Enhancement]{.jbs-field} with a \"blocks\" link along with any relevant CSRs. The [Enhancement]{.jbs-field} should not be considered done until all the blocking element are completed.  The use of subTasks for [Enhancement]{.jbs}s is not recommended unless all the [Sub-task]{.jbs-field}s are relevant to the fix, if it were to be backported.\n+When managing the work for a large change, especially when the work involves multiple engineers, it is recommended that the work is distributed across one or more \"implementation\" issues which should be linked to the main [Enhancement]{.jbs-field} with a \"blocks\" link along with any relevant CSRs. The [Enhancement]{.jbs-field} should not be considered done until all the blocking elements are completed.  The use of subTasks for [Enhancement]{.jbs}s is not recommended unless all the [Sub-task]{.jbs-field}s are relevant to the fix, if it were to be backported.\n@@ -93,1 +95,1 @@\n-It recommended that for [JEP]{.jbs-field}s the implementation is spread across one or more [Enhancement]{.jbs-field}s as above.\n+It recommended that for [JEP]{.jbs-field}s that the implementation is spread across one or more [Enhancement]{.jbs-field}s as above.\n@@ -106,2 +108,2 @@\n-    <td class=\"dictionary\">Open<\/td>\n-    <td class=\"dictionary\">Most straightforward issues stay in this state until they are closed.  If the issue has some attention then use \"In Progress\" to show more clearly that the issue is being worked<\/td>\n+    <td class=\"dictionary\">[Open]{.jbs-field}<\/td>\n+    <td class=\"dictionary\">Most straightforward issues stay in this state until they are closed.  If the issue has some attention then use [In Progress]{.jbs-field} to show more clearly that the issue is being worked<\/td>\n@@ -110,2 +112,2 @@\n-    <td class=\"dictionary\">In Progress<\/td>\n-    <td class=\"dictionary\">The <i>In Progress<\/i> state has the option of the sub-states ([Understanding]{.jbs-field}): [Cause Known]{.jbs-field}, [Fix Understood]{.jbs-field}, [In Review]{.jbs-field}.<\/td>\n+    <td class=\"dictionary\">[In Progress]{.jbs-field}<\/td>\n+    <td class=\"dictionary\">The [In Progress]{.jbs-field} state has the option of the sub-states ([Understanding]{.jbs-field}): [Cause Known]{.jbs-field}, [Fix Understood]{.jbs-field}, [In Review]{.jbs-field}.<\/td>\n@@ -114,1 +116,1 @@\n-    <td class=\"dictionary\">Closed\/Resolved<\/td>\n+    <td class=\"dictionary\">[Closed]{.jbs-field}\/[Resolved]{.jbs-field}<\/td>\n@@ -150,1 +152,1 @@\n-  states(Fixed, Won't Fix, Duplicate etc.) --> Closed\n+  states[Fixed, Won't Fix, Duplicate etc.] --> Closed\n@@ -152,1 +154,1 @@\n-  Resolved[<font color=white>RESOLVED] -.-> Verify(Verify)\n+  Resolved(<font color=white>RESOLVED) -.-> Verify[Verify]\n@@ -171,1 +173,1 @@\n-First give the issue a general [Review]{.jbs-field}\n+First give the issue a general review\n@@ -175,1 +177,1 @@\n-1. If the issue is incomplete, add a comment noting what is needed and close the bug as [Resolved]{.jbs-field} - 'Incomplete'. If no more information is obtained within reasonable time, the issue should be closed (`Closed - Incomplete`).\n+1. If the issue is incomplete, add a comment noting what is needed and close the bug as [Resolved]{.jbs-field} - 'Incomplete'. If no more information is obtained within reasonable time, the issue should be closed ([Closed]{.jbs-field} - `Incomplete`).\n@@ -208,1 +210,1 @@\n-Once you are made, or you make yourself, the assignee of an Issue you take on the responsibility of moving the issue through to resolution and providing the current status, and ultimately leaving a record for others in the future to understand what happened.  There are no real rules for how you manage the bug while you are assigned to it, as it depends on the type and importance of an issue.  A simple update to the doc needs little to be done, fix the problem and close the issue; an intricate timing issue or crash should be handled differently - documenting your progress in identifying the problem (for example\n+Once you are made, or you make yourself, the assignee of an Issue you take on the responsibility of moving the issue through to resolution and providing the current status, and ultimately leaving a record for others in the future to understand what happened.  There are no set rules for how you manage the bug while you are assigned to it, as it depends on the type and importance of an issue.  A simple update to the doc needs little to be done, fix the problem and close the issue; an intricate timing issue or crash should be handled differently - documenting your progress in identifying the problem (for example\n@@ -212,2 +214,1 @@\n-), this is especially helpful if you ultimately move the Issue to a different area as you have found that the problem lies elsewhere or is closed as [Will Not Fix]{.jbs-field}.  Your updates can provide a resource to others to better understand the code. See [The Importance of Writing Stuff Down](https:\/\/stuartmarks.wordpress.com\/2023\/02\/22\/the-importance-of-writing-stuff-down) for a good explanation as to why it is also important to write an evaluation when something is not fixed.\n-\n+), this is especially helpful if you ultimately move the Issue to a different area as you have found that the problem lies elsewhere, or is closed as [Will Not Fix]{.jbs-field}.  Your updates then provide a resource to others to better understand what has been done or the code. See [The Importance of Writing Stuff Down](https:\/\/stuartmarks.wordpress.com\/2023\/02\/22\/the-importance-of-writing-stuff-down) for a good explanation as to why it is also important to write an evaluation when something is not fixed.\n@@ -217,1 +218,1 @@\n-- The description usually explains what went wrong and how the failure was found, then there's some investigation and eventually the root cause is found. At this point the Summary should be updated to correctly describe the bug. The Description however should remain a description of how the failure was found.\n+- The [Description]{.jbs-field} usually explains what went wrong and how the failure was found, then there's some investigation and eventually the root cause is found. At this point the [Summary]{.jbs-field} should be updated to correctly describe the bug. The [Description]{.jbs-field} however should remain a description of how the failure was found.\n@@ -249,1 +250,1 @@\n-    <td class=\"dictionary\">Use when a reproducer is provided (or clear steps) but it is not possible to see the same behavior. Where feasible try on the release the issue was reported against, as a way of confirming that it is indeed addressed, rather than you not having the right environment in which to reproduce the issue<\/td>\n+    <td class=\"dictionary\">Use when a reproducer is provided (or clear steps) but it is not possible to see the same behavior. When you can't reproduce an issue, where feasible try on the release the issue was reported against, as a way of confirming that it is indeed addressed on the latest release, rather than you not having the right environment in which to reproduce the issue<\/td>\n@@ -257,1 +258,1 @@\n-    <td class=\"dictionary\"><\/td>\n+    <td class=\"dictionary\">This status is not recommended<\/td>\n@@ -281,1 +282,1 @@\n-    <td class=\"dictionary\">Use to close out issues where a changeset is not produced, common examples are Release Notes<\/td>\n+    <td class=\"dictionary\">Use to close out issues where a change to the code is not required, common examples are Release Notes<\/td>\n","filename":"src\/guide\/jbs-jdk-bug-system.md","additions":32,"deletions":31,"binary":false,"changes":63,"status":"modified"}]}