{"files":[{"patch":"@@ -33,1 +33,2 @@\n- * annotated element, and in all elements contained in the annotated element.\n+ * annotated element, and in all elements contained in the annotated\n+ * element.\n@@ -37,3 +38,3 @@\n- * annotation can be used on any element.\n- * As a matter of style, programmers should always use this annotation\n- * on the most deeply nested element where it is effective. For example, if you want to\n+ * annotation can be used on any element.  As a matter of style,\n+ * programmers should always use this annotation on the most deeply\n+ * nested element where it is effective. For example, if you want to\n@@ -43,10 +44,11 @@\n- * <p>The set of warnings suppressed in a given element is\n- * a union of the warnings suppressed in all containing elements.  For\n- * example, if you annotate a class to suppress one warning and annotate a\n- * method in the class to suppress another, both warnings will be suppressed in the method.\n- * However, note that if a warning is suppressed in a {@code\n- * module-info} file, the suppression applies to elements within the\n- * file and <em>not<\/em> to types contained within the module.\n- * Likewise, if a warning is suppressed in a {@code\n- * package-info} file, the suppression applies to elements within the\n- * file and <em>not<\/em> to types contained within the package.\n+ * <p>The set of warnings suppressed in a given element is a union of\n+ * the warnings suppressed in all containing elements.  For example,\n+ * if you annotate a class to suppress one warning and annotate a\n+ * method in the class to suppress another, both warnings will be\n+ * suppressed in the method.  However, note that if a warning is\n+ * suppressed in a {@code module-info} file, the suppression applies\n+ * to elements within the file and <em>not<\/em> to types contained\n+ * within the module.  Likewise, if a warning is suppressed in a\n+ * {@code package-info} file, the suppression applies to elements\n+ * within the file and <em>not<\/em> to types contained within the\n+ * package.\n@@ -54,2 +56,2 @@\n- * <p>Java compilers must recognize all the kinds of warnings defined in\n- * the <cite>Java Language Specification<\/cite> (JLS section {@jls\n+ * <p>Java compilers must recognize all the kinds of warnings defined\n+ * in the <cite>Java Language Specification<\/cite> (JLS section {@jls\n@@ -65,6 +67,5 @@\n- * Whether or not a Java compiler recognizes other strings\n- * is a quality of implementation concern.\n- * Compiler vendors should document the\n- * additional warning names they support.\n- * Vendors are encouraged to cooperate to ensure\n- * that the same names work across multiple compilers.\n+ * Whether or not a Java compiler recognizes other strings is a\n+ * quality of implementation concern.  Compiler vendors should\n+ * document the additional warning names they support.  Vendors are\n+ * encouraged to cooperate to ensure that the same names work across\n+ * multiple compilers.\n","filename":"src\/java.base\/share\/classes\/java\/lang\/SuppressWarnings.java","additions":23,"deletions":22,"binary":false,"changes":45,"status":"modified"}]}