{"files":[{"patch":"@@ -37,1 +37,1 @@\n- * interface within the {@code MBeanServer} is: \"jdk.management:type=HotSpotAOTCache\".\n+ * interface within the {@code MBeanServer} is {@code jdk.management:type=HotSpotAOTCache}.\n@@ -42,4 +42,0 @@\n- * {@code HotSpotAOTCacheMXBean} defines one operation at this time to\n- * end the AOT recording. More operations and\/or properties may be added in a\n- * future release.\n- *\n@@ -50,1 +46,1 @@\n-     * If an AOT recording is in progress, ends the recording. This operation completes\n+     * If an AOT recording is in progress, ends the recording. This method returns\n@@ -53,1 +49,1 @@\n-     * <p>The JVM will start recording AOT artifacts upon start-up if certain JVM options are\n+     * <p>The JVM will start recording AOT artifacts upon start-up if appropriate JVM options are\n@@ -57,1 +53,1 @@\n-     * <p> java -XX:AOTCacheOutput=app.aot ....\n+     * <p> ${@code java -XX:AOTCacheOutput=app.aot ....}\n@@ -60,4 +56,3 @@\n-     *    The JVM will record optimization information about the current application\n-     *    that will be used to generate the AOT cache file app.aot. In a future execution of this application,\n-     *    -XX:AOTCache=app.aot can be provided to improve the application's\n-     *    start-up and warm-up performance.\n+     *    The JVM records optimization information for the current application in the AOT cache file\n+     *    {@code app.aot}. In a future run of the application, the option {@code -XX:AOTCache=app.aot} will\n+     *    cause the JVM to use the cache to improve the application's startup and warmup performance.\n@@ -66,1 +61,1 @@\n-     * <p> java -XX:AOTMode=record -XX:AOTConfiguration=app.aotconfig ....\n+     * <p>  ${@code java -XX:AOTMode=record -XX:AOTConfiguration=app.aotconfig ....}\n@@ -69,3 +64,2 @@\n-     *    The JVM will record optimization information about the current application\n-     *    into the AOT configuration file app.aotconfig. Subsequently, an AOT cache\n-     *    file can be created with the command:\n+     *    The JVM records optimization information for the current application in the AOT configuration\n+     *    file {@code app.aotconfig}. Subsequently, an AOT cache file can be created with the command:\n@@ -73,1 +67,1 @@\n-     *    <p>java -XX:AOTMode=create -XX:AOTConfiguration=app.aotconfig  -XX:AOTCache=app.aot ...\n+     *    <p>${@code java -XX:AOTMode=create -XX:AOTConfiguration=app.aotconfig  -XX:AOTCache=app.aot ...}\n@@ -80,4 +74,3 @@\n-     * <p>Note: Currently there are no APIs to start an AOT recording. AOT recordings must be\n-     * started using JVM command-line options such as -XX:AOTCacheOutput.\n-     *\n-     * <p> There are also no APIs to querying whether the AOT recording is in progress, or what AOT\n+     * <p>Currently there are no APIs to start an AOT recording. AOT recordings must be\n+     * started using JVM command-line options such as {@code -XX:AOTCacheOutput}.\n+     * There are also no APIs to query whether an AOT recording is in progress, or what AOT\n@@ -86,7 +79,9 @@\n-     * <p> It is possible for an application to end its own AOT recording programatically, but that\n-     * would require a change to the application’s own logic.  Even when such a change would\n-     * be feasible, training-specific logic injected into the application reduces the necessary\n-     * similarity between training runs and production runs.  Therefore, some AOT training\n-     * procedures rely on an external agent to select the correct moment to end training.\n-     * In this way the selected length of training produces the correct set of AOT\n-     * optimizations in the AOT archive, without interfering with the application code.\n+     * <p> This method enables an application to end its own AOT recording\n+     * programatically, but that is not necessarily the best approach. Doing so\n+     * requires changing the application’s code, which might not be\n+     * feasible. Even when it is feasible, injecting training-specific logic\n+     * into the application reduces the similarity between training runs and\n+     * production runs, potentially making the AOT cache less effective. It may\n+     * be better to arrange for an external agent to end the training run,\n+     * thereby creating an AOT cache without interfering with the application’s\n+     * code.\n","filename":"src\/jdk.management\/share\/classes\/jdk\/management\/HotSpotAOTCacheMXBean.java","additions":23,"deletions":28,"binary":false,"changes":51,"status":"modified"}]}