{"files":[{"patch":"@@ -65,1 +65,1 @@\n- * or translucnet materials such as water, glass, or ice. These materials rely on <i>Fresnel effects<\/i> that are not\n+ * or translucent materials such as water, glass, or ice. These materials rely on <i>Fresnel effects<\/i> that are not\n@@ -78,1 +78,0 @@\n- * <p>\n@@ -93,0 +92,1 @@\n+ * <p>\n@@ -103,3 +103,3 @@\n- * The alpha channel of the diffuse component controls the light that passes through it (transmitted). Decreasing this\n- * value increases the transparency of the material and causes the object to appear translucent, and ultimately makes\n- * it transparent. Materials such as glass and plastics can be simulated with a low alpha value.<br>\n+ * The alpha channel of the diffuse component controls the light that passes through it (transmitted). Decreasing the\n+ * alpha value increases the transparency of the material and causes the object to appear translucent, and ultimately\n+ * makes it transparent. Materials such as glass and plastics can be simulated with a low alpha value.<br>\n@@ -130,3 +130,1 @@\n- *\n- * A larger specular power simulates a smoother object, which\n- * results in a smaller reflection.\n+ * A larger specular power simulates a smoother object, which results in a smaller reflection.\n@@ -135,1 +133,1 @@\n- * on the incident ray direction, and also on the viewer position since it depends on the reflectance direction.\n+ * on the incident ray direction, and also on the viewer (camera) position since it depends on the reflectance direction.\n@@ -172,4 +170,4 @@\n- * The diffuse and and specular components are comprised of 3 factors: the geometry, the light's color, and the\n- * material's color, each considered at every point on the surface. The light's color computation is described in\n- * {@link LightBase} (and its subclasses). The material's color computation, as described above, is the multiplication\n- * of the color and map properties. These factors are multiplied to get the final color.\n+ * The diffuse and specular components are comprised of 3 factors: the geometry, the light's color, and the material's\n+ * color, each considered at every point on the surface. The light's color computation is described in {@link LightBase}\n+ * (and its subclasses). The material's color computation, as described above, is the multiplication of the color and\n+ * map properties. These factors are multiplied to get the final color.\n@@ -211,1 +209,1 @@\n- * vector and is non-existant when they are perpendicular.\n+ * vector and is non-existent when they are perpendicular.\n","filename":"modules\/javafx.graphics\/src\/main\/java\/javafx\/scene\/paint\/PhongMaterial.java","additions":12,"deletions":14,"binary":false,"changes":26,"status":"modified"}]}