{"files":[{"patch":"@@ -219,3 +219,4 @@\n-        \/\/ When a Parent and its Parent's font size is relative then that Parent's\n-        \/\/ font size is computed in relative to it's grand parent's font size.\n-        \/\/ For compatibility we are preserving this odd behaviour.\n+        \/\/ Ideally relative font size of a parent should be relative to font size of its parent.\n+        \/\/ But the current behavior is that when -fx-font-size of a parent and its parent is specified as a\n+        \/\/ relative size then the font size of that parent is computed relative to font size of its grandparent.\n+        \/\/ For compatibility we are preserving this odd behavior.\n@@ -254,5 +255,5 @@\n-        \/\/ This should have been the behavior of font size calculation with nested\n-        \/\/ set of parents and controls, that a Parent's font size is calculated with reference\n-        \/\/ to its Parent and not grand parent. We are not changing current behaviour to avoid\n-        \/\/ regressing any applications that rely on current behaviour.\n-        \/\/ Current behaviour can be observed in other -fx-font-size tests here.\n+        \/\/ The expected behavior of -fx-font-size calculation with nested set of parents is that\n+        \/\/ the font size of a parent is always calculated relative to font size of its parent.\n+        \/\/ But currently it is calculated relative to font size of grandparent.\n+        \/\/ We are not changing current behavior to avoid regressing any applications that rely on this behavior.\n+        \/\/ Current behavior can be observed in other -fx-font-size tests here.\n@@ -272,1 +273,1 @@\n-    \/\/ relativeFontSizeSetOnAllNestedParentsAndControlsTest() to test combinations of -fx-font-size\n+    \/\/ relativeFontSizeSetOnAllNestedParentsAndControlsTest() to test combinations of -fx-font-size.\n@@ -403,2 +404,2 @@\n-    \/\/ Test the following properties using Label, to verify that\n-    \/\/ 1. The relative size of css properties of a control are computed relative to\n+    \/\/ Test the following properties using Label control, to verify that\n+    \/\/ 1. The relative sized css properties are computed relative to\n@@ -464,1 +465,0 @@\n-\n","filename":"modules\/javafx.controls\/src\/test\/java\/test\/javafx\/css\/PropertySizeTest.java","additions":12,"deletions":12,"binary":false,"changes":24,"status":"modified"},{"patch":"@@ -574,8 +574,10 @@\n-    \/\/ The font size property of the Controls that are inherited from class Labeled is a shared a property,\n-    \/\/ it is shared with a child LabeledText. The Control's(inherited from Labeled) css properties are\n-    \/\/ first computed relative to the font size that was computed for the Control. And when the font size\n-    \/\/ is computed for LabeledText, it computes a different font size(which is not same as what was computed for Control).\n-    \/\/ This results in the behaviour that Control's relative sized properties do not remain relative to its font size.\n-    \/\/ This method is a remedy to this problem. It gets executed when LabeledText updates the shared font size property\n-    \/\/ and recalculates the relative sized properties of Control.\n-    \/\/ Currently this method is executed only by Labeled.fontProperty().set(), when it's font size\n+    \/\/ The font size property of Controls that are inherited from class Labeled is a shared property,\n+    \/\/ it is shared with a child LabeledText control.\n+    \/\/ This font size is first computed when applying CSS to the Control and then the relative sized\n+    \/\/ CSS properties of the Control are computed relative to this font size.\n+    \/\/ This shared font size may get changed if a different font size is computed for child LabeledText control.\n+    \/\/ So in such scenario if font size gets changed then the relative sized css properties of the Control\n+    \/\/ no longer remain relative to its font size.\n+    \/\/ This method is a remedy to above problem. It is executed when LabeledText changes the shared\n+    \/\/ font size property and it recalculates the relative sized properties of Control.\n+    \/\/ Currently this method is executed only by Labeled.fontProperty().set(), when its font size\n@@ -584,1 +586,1 @@\n-    \/\/ Any modifications to the method transitionToStates() should be relatively applied here if needed.\n+    \/\/ Any modifications to the method transitionToState() should be applied here if needed.\n@@ -627,1 +629,2 @@\n-            \/\/ This method is executed as a result of change in font size of the control, hence font property should be skipped.\n+            \/\/ This method is executed as a result of change in font size of the control,\n+            \/\/ hence font property should be skipped.\n@@ -648,1 +651,1 @@\n-                    \/\/ determine a way to find if any of the sub properties are specified with relative size.\n+                    \/\/ Determine a way to find if any of the sub properties are specified with relative size.\n","filename":"modules\/javafx.graphics\/src\/main\/java\/javafx\/scene\/CssStyleHelper.java","additions":14,"deletions":11,"binary":false,"changes":25,"status":"modified"}]}