{"files":[{"patch":"@@ -14,1 +14,1 @@\n-Release notes are associated with a JBS issue that has been fixed (or in some cases not been fixed) in a release and are generated with each build of a release. Any note should be considered as an integral part of the fix process, rather than waiting until the end of the release to determine what to write. In OpenJDK, release notes are currently being generated for the JDK and JDK Updates Projects.\n+Release notes are associated with a JBS issue that has been fixed (or in some cases not been fixed) in a release and are generated with each build of a release. Any release note should be considered an integral part of the fix process, rather than waiting until the end of the release to determine what to write. In OpenJDK, release notes are currently being generated for the JDK and JDK Updates Projects.\n@@ -18,1 +18,1 @@\n-Writing the release note is the responsibility of the engineer who owns the issue. The note should be generated before the fix is reviewed, or in the case of known issues, when it's determined that a fix won't be possible in the release the issue was found in.\n+Writing the release note is the responsibility of the engineer who owns the issue. The release note should be generated before the fix is reviewed, or in the case of known issues, when it's determined that a fix won't be possible in the release the issue was found in.\n@@ -36,1 +36,1 @@\n-   * Set the [Fix Version\/s]{.jbs-field} to the same value that the main issue - in almost all cases this will be the version of mainline.\n+   * Set the [Fix Version\/s]{.jbs-field} to the same value as the [Affects Version\/s]{.jbs-field}.\n@@ -77,1 +77,1 @@\n-    * A link to the parent issue that the note is a sub-task of, will be placed alongside the summary in the release notes. If note relates to additional changes, then add them as [Relates]{.jbs-field} links to the note and add the label [RN-MultipleLinks]{.jbs-label} - see [JDK-8284975](https:\/\/bugs.openjdk.org\/browse\/JDK-8284975) as an example.\n+    * A link to the parent issue that the release note is a sub-task of, will be placed alongside the summary in the release notes. If release note relates to additional changes, then add them as [relates-to]{.jbs-value} links to the release note sub-task and add the label [RN-MultipleLinks]{.jbs-label} - see [JDK-8284975](https:\/\/bugs.openjdk.org\/browse\/JDK-8284975) as an example.\n@@ -81,2 +81,2 @@\n-    * If an issue is backported to earlier releases the same note will be used - just add the new release version in the [Affects Version\/s]{.jbs-field} field of the release note.\n-    * Where a different release note is required, then create a separate note with the affects version for the new release - see [JDK-8308194](https:\/\/bugs.openjdk.org\/browse\/JDK-8308194) and [JDK-8322473](https:\/\/bugs.openjdk.org\/browse\/JDK-8322473) for an example.\n+    * If an issue is backported to earlier releases, the same release note will be used - just add the new release version in the [Affects Version\/s]{.jbs-field} and [Fix Version\/s]{.jbs-field} fields of the release note sub-task.\n+    * Where a different release note is required, then create a separate sub-task of the main JBS issue with the affects version for the new release - see [JDK-8308194](https:\/\/bugs.openjdk.org\/browse\/JDK-8308194) and [JDK-8322473](https:\/\/bugs.openjdk.org\/browse\/JDK-8322473) for an example.\n@@ -84,2 +84,2 @@\n-    * If a note needs to be added after the GA of a release, or an existing note needs updating then create the new note, or update the existing note, and then reach out to [ops@openjdk.org](mailto:ops@openjdk.org).\n-    * If an existing note should be extended to cover more releases (e.g. after the described change has been backported), update the [Affects Version\/s]{.jbs-field} field of the existing note. Only create a new release note if the text differs from the existing one.\n+    * If a release note needs to be added after the GA of a release, or an existing release note needs updating, then create the new release note sub-task, or update the existing release note, and then reach out to [ops@openjdk.org](mailto:ops@openjdk.org).\n+    * If an existing release note should be extended to cover more releases (e.g. if the main JBS issue has been backported), update the [Affects Version\/s]{.jbs-field} field of the existing release note sub-task. Only create a new release note sub-task if the new release note text differs from the existing one.\n@@ -89,1 +89,1 @@\n-Unless labeled otherwise it will be assumed that the release note documents a change in behavior (will have likely required a CSR) or other item which should be included in the release notes. If the note covers a more specific type of change, then one of the following labels can be included (notes of a similar type will be listed together).\n+Unless labeled otherwise it will be assumed that the release note documents a change in behavior (will have likely required a CSR) or other item which should be included in the release notes. If the release note covers a more specific type of change, then one of the following labels can be included (release notes of a similar type will be listed together).\n","filename":"src\/guide\/release-notes.md","additions":9,"deletions":9,"binary":false,"changes":18,"status":"modified"},{"patch":"@@ -330,1 +330,1 @@\n-   * Add a note to the CSR that explains the reason for the redo and the impact on the CSR.\n+   * Add a comment to the CSR that explains the reason for the redo and the impact on the CSR.\n","filename":"src\/guide\/testing-the-jdk.md","additions":1,"deletions":1,"binary":false,"changes":2,"status":"modified"}]}