{"files":[{"patch":"@@ -360,4 +360,4 @@\n-      \/\/ induced card marks in other region's remembered sets is, first, handled\n-      \/\/ by ignoring them during merging the remembered sets.\n-      \/\/ Second, wrt. to the remembered sets, there may be cases where regions\n-      \/\/ were reallocated after eager reclaim. This can cause scanning of outdated\n+      \/\/ induced card marks in other region's remembered sets is, if they are\n+      \/\/ now free, handled by ignoring them during merging the remembered sets.\n+      \/\/ Second, wrt. to the remembered sets, there may be cases where eagerly\n+      \/\/ reclaimed regions were reallocated.  This may cause scanning of outdated\n@@ -369,3 +369,1 @@\n-      \/\/ Do not allow non-typeArrays that were allocated before marking for eager\n-      \/\/ reclaim. All regions that were allocated before marking have a TAMS\n-      \/\/ != bottom.\n+      \/\/ All regions that were allocated before marking have a TAMS != bottom.\n@@ -373,3 +371,3 @@\n-      \/\/ TAMSes above are only reset after completing the entire mark cycle, during\n-      \/\/ bitmap clear. It is worth to override above when outside of actual\n-      \/\/ (concurrent) SATB marking.\n+      \/\/ TAMSes are only reset after completing the entire mark cycle, during\n+      \/\/ bitmap clearing. It is worth to not wait until then, and allow reclamation\n+      \/\/ outside of actual (concurrent) SATB marking.\n@@ -377,1 +375,1 @@\n-      \/\/ mark_in_progress() at the end of GC: no mutator is running that can\n+      \/\/ mark_in_progress() at the end of that GC: no mutator is running that can\n@@ -383,1 +381,1 @@\n-      \/\/ the candidate object. There is also a humongous object h that is candidate.\n+      \/\/ the candidate object h, which is humongous.\n@@ -386,3 +384,4 @@\n-      \/\/ no remembered set entry would be created, so h might be reclaimed. o1\n-      \/\/ still has the reference to o2, but since its already scanned we do not\n-      \/\/ detect o2 to be still live.\n+      \/\/ no remembered set entry would be created for keeping alive o2, as o1 and\n+      \/\/ o2 are in the same region. Object h might be reclaimed by the next\n+      \/\/ garbage collection. o1 still has the reference to o2, but since o1 had\n+      \/\/ already been scanned we do not detect o2 to be still live and reclaim it.\n@@ -391,1 +390,1 @@\n-      \/\/ is modifying the object graph to install this overlooked reference.\n+      \/\/ is modifying the object graph to install such an overlooked reference.\n","filename":"src\/hotspot\/share\/gc\/g1\/g1YoungCollector.cpp","additions":15,"deletions":16,"binary":false,"changes":31,"status":"modified"}]}