[{"commit":{"message":"8278267: ARM32: several vector test failures for ASHR\n\nIn ARM32, \"VSHL (register)\" instruction [1] is shared by vector left\nshift and vector right shift, and the condition to distinguish them is\nwhether the shift count value is positve or negative. Hence, negation\noperation is needed before conducting vector right shift.\n\nFor vector right shift, the shift count can be a RShiftCntV or a normal\nvector node. Take test case Byte64VectorTests.java [2][3] as an example.\nNote that RShiftCntV is already negated via rules \"vsrcntD\" and\n\"vsrcntX\" whereas the normal vector node is NOT, since we don't know\nwhether a normal vector node is used as a vector shift count or not.\nThis is the root cause for these vector test failures.\n\nThe fix is simple, moving the negation from \"vsrcntD|X\" to the\ncorresponding vector right shift rules.\n\nAffected rules are vsrlBB_reg and vsraBB_reg. Note that vector shift\nrelated rules are in form of \"vsAABB_CC\", where\n1) AA can be l (left shift), rl (logical right shift) and ra (arithmetic\n  right shift).\n2) BB can be 8B\/16B (byte type), 4S\/8S (short type), 2I\/4I (int type)\n  and 2L (long type).\n3) CC can be reg (register case) and immI (immediate case).\n\nMinor updates:\n1) Merge \"vslcntD\" and \"vsrcntD\" into rule \"vscntD\", as these two rules\nconduct the same duplication operation now.\n2) Update the \"match\" primitive for vsraBB_immI rules.\n3) Style issue: remove the surrounding space for \"ins_pipe\" primitive.\n\nTests:\nWe ran tier 1~3 tests on ARM32 platform. With this patch, previously\nfailed vector test cases can pass now without introducing test\nregression.\n\n[1] https:\/\/developer.arm.com\/documentation\/ddi0406\/c\/Application-Level-Architecture\/Instruction-Details\/Alphabetical-list-of-instructions\/VSHL--register-?lang=en\n[2] https:\/\/github.com\/openjdk\/jdk\/blame\/master\/test\/jdk\/jdk\/incubator\/vector\/Byte64VectorTests.java#L2237\n[3] https:\/\/github.com\/openjdk\/jdk\/blame\/master\/test\/jdk\/jdk\/incubator\/vector\/Byte64VectorTests.java#L2425"},"files":[{"filename":"src\/hotspot\/cpu\/arm\/arm.ad"}],"sha":"3d29fb2ccf303942ecbd104ed8639983cb3d7a60"}]