{"files":[{"patch":"@@ -51,2 +51,2 @@\n- * <li> {@link #innerAngleProperty() inner angle}: the angle of the inner cone (see image below)\n- * <li> {@link #outerAngleProperty() outer angle}: the angle of the outer cone (see image below)\n+ * <li> {@link #innerAngleProperty() innerAngle}: the angle of the inner cone (see image below)\n+ * <li> {@link #outerAngleProperty() outerAngle}: the angle of the outer cone (see image below)\n@@ -58,1 +58,2 @@\n- * For a point whose vector to the light position forms an angle {@code theta} with the direction of the light, if\n+ * The angle of a point to the light is defined as the angle between its vector to the light's position and the\n+ * direction of the light. For such an angle {@code theta}, if\n@@ -143,3 +144,3 @@\n-     * The angle of the spotlight's inner cone, in degrees (as shown in the class doc image). A point whose angle to the\n-     * light's position is less than this angle is not attenuated by the spotlight factor ({@code spot = 1}). At larger\n-     * angles, the light intensity starts to drop.\n+     * The angle of the spotlight's inner cone, in degrees. A point whose angle to the light is less than this angle is\n+     * not attenuated by the spotlight factor ({@code spot = 1}). At larger angles, the light intensity starts to drop.\n+     * See the class doc for more information.\n@@ -174,3 +175,3 @@\n-     * light's position is greater than this angle receives no light ({@code spot = 0}). A point whose angle to the\n-     * light's position is less than the outer angle but greater than the inner angle receives partial intensity\n-     * governed by the falloff factor.\n+     * light is greater than this angle receives no light ({@code spot = 0}). A point whose angle to the light is less\n+     * than the outer angle but greater than the inner angle receives partial intensity governed by the falloff factor.\n+     * See the class doc for more information.\n@@ -204,1 +205,1 @@\n-     * The intensity falloff factor of the spotlight's outer cone. A point whose angle to the light's position is\n+     * The intensity falloff factor of the spotlight's outer cone. A point whose angle to the light is\n@@ -208,1 +209,1 @@\n-     * drop. See the class docs for the mathematical definitions.\n+     * drop. See the class doc for more information.\n","filename":"modules\/javafx.graphics\/src\/main\/java\/javafx\/scene\/SpotLight.java","additions":12,"deletions":11,"binary":false,"changes":23,"status":"modified"}]}