{"files":[{"filename":"src\/java.base\/share\/classes\/jdk\/internal\/icu\/impl\/data\/icudt72b\/nfc.nrm","binary":true,"status":"deleted"},{"filename":"src\/java.base\/share\/classes\/jdk\/internal\/icu\/impl\/data\/icudt72b\/nfkc.nrm","binary":true,"status":"deleted"},{"filename":"src\/java.base\/share\/classes\/jdk\/internal\/icu\/impl\/data\/icudt72b\/ubidi.icu","binary":true,"status":"deleted"},{"filename":"src\/java.base\/share\/classes\/jdk\/internal\/icu\/impl\/data\/icudt72b\/uprops.icu","binary":true,"status":"deleted"},{"filename":"src\/java.base\/share\/classes\/jdk\/internal\/icu\/impl\/data\/icudt74b\/nfc.nrm","binary":true,"status":"added"},{"filename":"src\/java.base\/share\/classes\/jdk\/internal\/icu\/impl\/data\/icudt74b\/nfkc.nrm","binary":true,"status":"added"},{"filename":"src\/java.base\/share\/classes\/jdk\/internal\/icu\/impl\/data\/icudt74b\/ubidi.icu","binary":true,"status":"added"},{"filename":"src\/java.base\/share\/classes\/jdk\/internal\/icu\/impl\/data\/icudt74b\/uprops.icu","binary":true,"status":"added"},{"patch":"@@ -2,1 +2,1 @@\n- * Copyright (c) 2009, 2022, Oracle and\/or its affiliates. All rights reserved.\n+ * Copyright (c) 2009, 2023, Oracle and\/or its affiliates. All rights reserved.\n@@ -87,1 +87,1 @@\n- * \"https:\/\/github.com\/unicode-org\/icu\/blob\/main\/icu4j\/main\/tests\/core\/src\/com\/ibm\/icu\/dev\/test\/lang\/UCharacterCompare.java\">\n+ * \"https:\/\/github.com\/unicode-org\/icu\/blob\/main\/icu4j\/main\/core\/src\/test\/java\/com\/ibm\/icu\/dev\/test\/lang\/UCharacterCompare.java\">\n","filename":"src\/java.base\/share\/classes\/jdk\/internal\/icu\/lang\/UCharacter.java","additions":2,"deletions":2,"binary":false,"changes":4,"status":"modified"},{"patch":"@@ -2,1 +2,1 @@\n- * Copyright (c) 2019, 2020, Oracle and\/or its affiliates. All rights reserved.\n+ * Copyright (c) 2019, 2023, Oracle and\/or its affiliates. All rights reserved.\n@@ -66,1 +66,1 @@\n-         * <p>This option is useful for maps that map surrogate code *units* to\n+         * <p>This option is useful for maps that map surrogate code <i>units<\/i> to\n@@ -69,1 +69,1 @@\n-         * but those values are not to be associated with the lead surrogate code *points*.\n+         * but those values are not to be associated with the lead surrogate code <i>points<\/i>.\n@@ -83,1 +83,1 @@\n-         * <p>This option is useful for maps that map surrogate code *units* to\n+         * <p>This option is useful for maps that map surrogate code <i>units<\/i> to\n@@ -86,1 +86,1 @@\n-         * but those values are not to be associated with the lead surrogate code *points*.\n+         * but those values are not to be associated with the lead surrogate code <i>points<\/i>.\n","filename":"src\/java.base\/share\/classes\/jdk\/internal\/icu\/util\/CodePointMap.java","additions":5,"deletions":5,"binary":false,"changes":10,"status":"modified"},{"patch":"@@ -57,1 +57,1 @@\n-    public static final String ICU_DATA_VERSION_PATH = \"72b\";\n+    public static final String ICU_DATA_VERSION_PATH = \"74b\";\n","filename":"src\/java.base\/share\/classes\/jdk\/internal\/icu\/util\/VersionInfo.java","additions":1,"deletions":1,"binary":false,"changes":2,"status":"modified"},{"patch":"@@ -1,1 +1,1 @@\n-## International Components for Unicode (ICU4J) v72.1\n+## International Components for Unicode (ICU4J) v74.1\n@@ -5,0 +5,1 @@\n+UNICODE LICENSE V3\n@@ -6,33 +7,1 @@\n-COPYRIGHT AND PERMISSION NOTICE (ICU 58 and later)\n-\n-Copyright © 1991-2022 Unicode, Inc. All rights reserved.\n-Distributed under the Terms of Use in https:\/\/www.unicode.org\/copyright.html.\n-\n-Permission is hereby granted, free of charge, to any person obtaining\n-a copy of the Unicode data files and any associated documentation\n-(the \"Data Files\") or Unicode software and any associated documentation\n-(the \"Software\") to deal in the Data Files or Software\n-without restriction, including without limitation the rights to use,\n-copy, modify, merge, publish, distribute, and\/or sell copies of\n-the Data Files or Software, and to permit persons to whom the Data Files\n-or Software are furnished to do so, provided that either\n-(a) this copyright and permission notice appear with all copies\n-of the Data Files or Software, or\n-(b) this copyright and permission notice appear in associated\n-Documentation.\n-\n-THE DATA FILES AND SOFTWARE ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF\n-ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE\n-WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\n-NONINFRINGEMENT OF THIRD PARTY RIGHTS.\n-IN NO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS INCLUDED IN THIS\n-NOTICE BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT OR CONSEQUENTIAL\n-DAMAGES, OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE,\n-DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER\n-TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR\n-PERFORMANCE OF THE DATA FILES OR SOFTWARE.\n-\n-Except as contained in this notice, the name of a copyright holder\n-shall not be used in advertising or otherwise to promote the sale,\n-use or other dealings in these Data Files or Software without prior\n-written authorization of the copyright holder.\n+COPYRIGHT AND PERMISSION NOTICE\n@@ -40,1 +9,37 @@\n----------------------\n+Copyright © 2016-2023 Unicode, Inc.\n+\n+NOTICE TO USER: Carefully read the following legal agreement. BY\n+DOWNLOADING, INSTALLING, COPYING OR OTHERWISE USING DATA FILES, AND\/OR\n+SOFTWARE, YOU UNEQUIVOCALLY ACCEPT, AND AGREE TO BE BOUND BY, ALL OF THE\n+TERMS AND CONDITIONS OF THIS AGREEMENT. IF YOU DO NOT AGREE, DO NOT\n+DOWNLOAD, INSTALL, COPY, DISTRIBUTE OR USE THE DATA FILES OR SOFTWARE.\n+\n+Permission is hereby granted, free of charge, to any person obtaining a\n+copy of data files and any associated documentation (the \"Data Files\") or\n+software and any associated documentation (the \"Software\") to deal in the\n+Data Files or Software without restriction, including without limitation\n+the rights to use, copy, modify, merge, publish, distribute, and\/or sell\n+copies of the Data Files or Software, and to permit persons to whom the\n+Data Files or Software are furnished to do so, provided that either (a)\n+this copyright and permission notice appear with all copies of the Data\n+Files or Software, or (b) this copyright and permission notice appear in\n+associated Documentation.\n+\n+THE DATA FILES AND SOFTWARE ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY\n+KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n+MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF\n+THIRD PARTY RIGHTS.\n+\n+IN NO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS INCLUDED IN THIS NOTICE\n+BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT OR CONSEQUENTIAL DAMAGES,\n+OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,\n+WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION,\n+ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THE DATA\n+FILES OR SOFTWARE.\n+\n+Except as contained in this notice, the name of a copyright holder shall\n+not be used in advertising or otherwise to promote the sale, use or other\n+dealings in these Data Files or Software without prior written\n+authorization of the copyright holder.\n+\n+----------------------------------------------------------------------\n@@ -48,1 +53,3 @@\n-1. ICU License - ICU 1.8.1 to ICU 57.1\n+----------------------------------------------------------------------\n+\n+ICU License - ICU 1.8.1 to ICU 57.1\n@@ -83,1 +90,1 @@\n-2. Chinese\/Japanese Word Break Dictionary Data (cjdict.txt)\n+----------------------------------------------------------------------\n@@ -85,201 +92,0 @@\n- #     The Google Chrome software developed by Google is licensed under\n- # the BSD license. Other software included in this distribution is\n- # provided under other licenses, as set forth below.\n- #\n- #  The BSD License\n- #  http:\/\/opensource.org\/licenses\/bsd-license.php\n- #  Copyright (C) 2006-2008, Google Inc.\n- #\n- #  All rights reserved.\n- #\n- #  Redistribution and use in source and binary forms, with or without\n- # modification, are permitted provided that the following conditions are met:\n- #\n- #  Redistributions of source code must retain the above copyright notice,\n- # this list of conditions and the following disclaimer.\n- #  Redistributions in binary form must reproduce the above\n- # copyright notice, this list of conditions and the following\n- # disclaimer in the documentation and\/or other materials provided with\n- # the distribution.\n- #  Neither the name of  Google Inc. nor the names of its\n- # contributors may be used to endorse or promote products derived from\n- # this software without specific prior written permission.\n- #\n- #\n- #  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND\n- # CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES,\n- # INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\n- # MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n- # DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE\n- # LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n- # CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\n- # SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR\n- # BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF\n- # LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING\n- # NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\n- # SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n- #\n- #\n- #  The word list in cjdict.txt are generated by combining three word lists\n- # listed below with further processing for compound word breaking. The\n- # frequency is generated with an iterative training against Google web\n- # corpora.\n- #\n- #  * Libtabe (Chinese)\n- #    - https:\/\/sourceforge.net\/project\/?group_id=1519\n- #    - Its license terms and conditions are shown below.\n- #\n- #  * IPADIC (Japanese)\n- #    - http:\/\/chasen.aist-nara.ac.jp\/chasen\/distribution.html\n- #    - Its license terms and conditions are shown below.\n- #\n- #  ---------COPYING.libtabe ---- BEGIN--------------------\n- #\n- #  \/*\n- #   * Copyright (c) 1999 TaBE Project.\n- #   * Copyright (c) 1999 Pai-Hsiang Hsiao.\n- #   * All rights reserved.\n- #   *\n- #   * Redistribution and use in source and binary forms, with or without\n- #   * modification, are permitted provided that the following conditions\n- #   * are met:\n- #   *\n- #   * . Redistributions of source code must retain the above copyright\n- #   *   notice, this list of conditions and the following disclaimer.\n- #   * . Redistributions in binary form must reproduce the above copyright\n- #   *   notice, this list of conditions and the following disclaimer in\n- #   *   the documentation and\/or other materials provided with the\n- #   *   distribution.\n- #   * . Neither the name of the TaBE Project nor the names of its\n- #   *   contributors may be used to endorse or promote products derived\n- #   *   from this software without specific prior written permission.\n- #   *\n- #   * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n- #   * \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n- #   * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS\n- #   * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE\n- #   * REGENTS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,\n- #   * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n- #   * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\n- #   * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n- #   * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,\n- #   * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n- #   * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED\n- #   * OF THE POSSIBILITY OF SUCH DAMAGE.\n- #   *\/\n- #\n- #  \/*\n- #   * Copyright (c) 1999 Computer Systems and Communication Lab,\n- #   *                    Institute of Information Science, Academia\n- #       *                    Sinica. All rights reserved.\n- #   *\n- #   * Redistribution and use in source and binary forms, with or without\n- #   * modification, are permitted provided that the following conditions\n- #   * are met:\n- #   *\n- #   * . Redistributions of source code must retain the above copyright\n- #   *   notice, this list of conditions and the following disclaimer.\n- #   * . Redistributions in binary form must reproduce the above copyright\n- #   *   notice, this list of conditions and the following disclaimer in\n- #   *   the documentation and\/or other materials provided with the\n- #   *   distribution.\n- #   * . Neither the name of the Computer Systems and Communication Lab\n- #   *   nor the names of its contributors may be used to endorse or\n- #   *   promote products derived from this software without specific\n- #   *   prior written permission.\n- #   *\n- #   * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n- #   * \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n- #   * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS\n- #   * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE\n- #   * REGENTS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,\n- #   * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n- #   * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\n- #   * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n- #   * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,\n- #   * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n- #   * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED\n- #   * OF THE POSSIBILITY OF SUCH DAMAGE.\n- #   *\/\n- #\n- #  Copyright 1996 Chih-Hao Tsai @ Beckman Institute,\n- #      University of Illinois\n- #  c-tsai4@uiuc.edu  http:\/\/casper.beckman.uiuc.edu\/~c-tsai4\n- #\n- #  ---------------COPYING.libtabe-----END--------------------------------\n- #\n- #\n- #  ---------------COPYING.ipadic-----BEGIN-------------------------------\n- #\n- #  Copyright 2000, 2001, 2002, 2003 Nara Institute of Science\n- #  and Technology.  All Rights Reserved.\n- #\n- #  Use, reproduction, and distribution of this software is permitted.\n- #  Any copy of this software, whether in its original form or modified,\n- #  must include both the above copyright notice and the following\n- #  paragraphs.\n- #\n- #  Nara Institute of Science and Technology (NAIST),\n- #  the copyright holders, disclaims all warranties with regard to this\n- #  software, including all implied warranties of merchantability and\n- #  fitness, in no event shall NAIST be liable for\n- #  any special, indirect or consequential damages or any damages\n- #  whatsoever resulting from loss of use, data or profits, whether in an\n- #  action of contract, negligence or other tortuous action, arising out\n- #  of or in connection with the use or performance of this software.\n- #\n- #  A large portion of the dictionary entries\n- #  originate from ICOT Free Software.  The following conditions for ICOT\n- #  Free Software applies to the current dictionary as well.\n- #\n- #  Each User may also freely distribute the Program, whether in its\n- #  original form or modified, to any third party or parties, PROVIDED\n- #  that the provisions of Section 3 (\"NO WARRANTY\") will ALWAYS appear\n- #  on, or be attached to, the Program, which is distributed substantially\n- #  in the same form as set out herein and that such intended\n- #  distribution, if actually made, will neither violate or otherwise\n- #  contravene any of the laws and regulations of the countries having\n- #  jurisdiction over the User or the intended distribution itself.\n- #\n- #  NO WARRANTY\n- #\n- #  The program was produced on an experimental basis in the course of the\n- #  research and development conducted during the project and is provided\n- #  to users as so produced on an experimental basis.  Accordingly, the\n- #  program is provided without any warranty whatsoever, whether express,\n- #  implied, statutory or otherwise.  The term \"warranty\" used herein\n- #  includes, but is not limited to, any warranty of the quality,\n- #  performance, merchantability and fitness for a particular purpose of\n- #  the program and the nonexistence of any infringement or violation of\n- #  any right of any third party.\n- #\n- #  Each user of the program will agree and understand, and be deemed to\n- #  have agreed and understood, that there is no warranty whatsoever for\n- #  the program and, accordingly, the entire risk arising from or\n- #  otherwise connected with the program is assumed by the user.\n- #\n- #  Therefore, neither ICOT, the copyright holder, or any other\n- #  organization that participated in or was otherwise related to the\n- #  development of the program and their respective officials, directors,\n- #  officers and other employees shall be held liable for any and all\n- #  damages, including, without limitation, general, special, incidental\n- #  and consequential damages, arising out of or otherwise in connection\n- #  with the use or inability to use the program or any product, material\n- #  or result produced or otherwise obtained by using the program,\n- #  regardless of whether they have been advised of, or otherwise had\n- #  knowledge of, the possibility of such damages at any time during the\n- #  project or thereafter.  Each user will be deemed to have agreed to the\n- #  foregoing by his or her commencement of use of the program.  The term\n- #  \"use\" as used herein includes, but is not limited to, the use,\n- #  modification, copying and distribution of the program and the\n- #  production of secondary products from the program.\n- #\n- #  In the case where the program, whether in its original form or\n- #  modified, was distributed or delivered to or received by a user from\n- #  any person, organization or entity other than ICOT, unless it makes or\n- #  grants independently of ICOT any specific warranty to the user in\n- #  writing, such person, organization or entity, will also be exempted\n- #  from and not be held liable to the user for any such damages as noted\n- #  above as far as the program is concerned.\n- #\n- #  ---------------COPYING.ipadic-----END----------------------------------\n@@ -287,81 +93,1 @@\n-3. Lao Word Break Dictionary Data (laodict.txt)\n-\n- # Copyright (C) 2016 and later: Unicode, Inc. and others.\n- # License & terms of use: http:\/\/www.unicode.org\/copyright.html\n- # Copyright (c) 2015 International Business Machines Corporation\n- # and others. All Rights Reserved.\n- #\n- # Project: https:\/\/github.com\/rober42539\/lao-dictionary\n- # Dictionary: https:\/\/github.com\/rober42539\/lao-dictionary\/laodict.txt\n- # License: https:\/\/github.com\/rober42539\/lao-dictionary\/LICENSE.txt\n- #          (copied below)\n- #\n- #\tThis file is derived from the above dictionary version of Nov 22, 2020\n- #  ----------------------------------------------------------------------\n- #  Copyright (C) 2013 Brian Eugene Wilson, Robert Martin Campbell.\n- #  All rights reserved.\n- #\n- #  Redistribution and use in source and binary forms, with or without\n- #  modification, are permitted provided that the following conditions are met:\n- #\n- #  Redistributions of source code must retain the above copyright notice, this\n- #  list of conditions and the following disclaimer. Redistributions in binary\n- #  form must reproduce the above copyright notice, this list of conditions and\n- #  the following disclaimer in the documentation and\/or ther materials\n- #  provided with the distribution.\n- #\n- # THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n- # \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n- # LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS\n- # FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE\n- # COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,\n- # INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n- # (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\n- # SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)\n- # HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,\n- # STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n- # ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED\n- # OF THE POSSIBILITY OF SUCH DAMAGE.\n- #  --------------------------------------------------------------------------\n-\n-4. Burmese Word Break Dictionary Data (burmesedict.txt)\n-\n- #  Copyright (c) 2014 International Business Machines Corporation\n- #  and others. All Rights Reserved.\n- #\n- #  This list is part of a project hosted at:\n- #    github.com\/kanyawtech\/myanmar-karen-word-lists\n- #\n- #  --------------------------------------------------------------------------\n- #  Copyright (c) 2013, LeRoy Benjamin Sharon\n- #  All rights reserved.\n- #\n- #  Redistribution and use in source and binary forms, with or without\n- #  modification, are permitted provided that the following conditions\n- #  are met: Redistributions of source code must retain the above\n- #  copyright notice, this list of conditions and the following\n- #  disclaimer.  Redistributions in binary form must reproduce the\n- #  above copyright notice, this list of conditions and the following\n- #  disclaimer in the documentation and\/or other materials provided\n- #  with the distribution.\n- #\n- #    Neither the name Myanmar Karen Word Lists, nor the names of its\n- #    contributors may be used to endorse or promote products derived\n- #    from this software without specific prior written permission.\n- #\n- #  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND\n- #  CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES,\n- #  INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\n- #  MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n- #  DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS\n- #  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\n- #  EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED\n- #  TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n- #  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\n- #  ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR\n- #  TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF\n- #  THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF\n- #  SUCH DAMAGE.\n- #  --------------------------------------------------------------------------\n-\n-5. Time Zone Database\n+Time Zone Database\n@@ -390,33 +116,1 @@\n-6. Google double-conversion\n-\n-Copyright 2006-2011, the V8 project authors. All rights reserved.\n-Redistribution and use in source and binary forms, with or without\n-modification, are permitted provided that the following conditions are\n-met:\n-\n-    * Redistributions of source code must retain the above copyright\n-      notice, this list of conditions and the following disclaimer.\n-    * Redistributions in binary form must reproduce the above\n-      copyright notice, this list of conditions and the following\n-      disclaimer in the documentation and\/or other materials provided\n-      with the distribution.\n-    * Neither the name of Google Inc. nor the names of its\n-      contributors may be used to endorse or promote products derived\n-      from this software without specific prior written permission.\n-\n-THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n-\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n-LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n-A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\n-OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n-SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n-LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n-DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n-THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n-(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n-OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n-\n-====================================================\n-\n-Unicode® Copyright and Terms of Use\n-For the general privacy policy governing access to this site, see the  Unicode Privacy Policy.\n+----------------------------------------------------------------------\n@@ -424,58 +118,1 @@\n-Unicode Copyright\n-Copyright © 1991-2022 Unicode, Inc. All rights reserved.\n-Definitions\n-Unicode Data Files (\"DATA FILES\") include all data files under the directories:\n-https:\/\/www.unicode.org\/Public\/\n-https:\/\/www.unicode.org\/reports\/\n-https:\/\/www.unicode.org\/ivd\/data\/\n-\n-Unicode Data Files do not include PDF online code charts under the directory:\n-https:\/\/www.unicode.org\/Public\/\n-\n-Unicode Software (\"SOFTWARE\") includes any source code published in the Unicode Standard\n-or any source code or compiled code under the directories:\n-https:\/\/www.unicode.org\/Public\/PROGRAMS\/\n-https:\/\/www.unicode.org\/Public\/cldr\/\n-http:\/\/site.icu-project.org\/download\/\n-Terms of Use\n-Certain documents and files on this website contain a legend indicating that \"Modification is permitted.\" Any person is hereby authorized, without fee, to modify such documents and files to create derivative works conforming to the Unicode® Standard, subject to Terms and Conditions herein.\n-Any person is hereby authorized, without fee, to view, use, reproduce, and distribute all documents and files, subject to the Terms and Conditions herein.\n-Further specifications of rights and restrictions pertaining to the use of the Unicode DATA FILES and SOFTWARE can be found in the Unicode Data Files and Software License.\n-Each version of the Unicode Standard has further specifications of rights and restrictions of use. For the book editions (Unicode 5.0 and earlier), these are found on the back of the title page.\n-The Unicode PDF online code charts carry specific restrictions. Those restrictions are incorporated as the first page of each PDF code chart.\n-All other files, including online documentation of the core specification for Unicode 6.0 and later, are covered under these general Terms of Use.\n-No license is granted to \"mirror\" the Unicode website where a fee is charged for access to the \"mirror\" site.\n-Modification is not permitted with respect to this document. All copies of this document must be verbatim.\n-Restricted Rights Legend\n-Any technical data or software which is licensed to the United States of America, its agencies and\/or instrumentalities under this Agreement is commercial technical data or commercial computer software developed exclusively at private expense as defined in FAR 2.101, or DFARS 252.227-7014 (June 1995), as applicable. For technical data, use, duplication, or disclosure by the Government is subject to restrictions as set forth in DFARS 202.227-7015 Technical Data, Commercial and Items (Nov 1995) and this Agreement. For Software, in accordance with FAR 12-212 or DFARS 227-7202, as applicable, use, duplication or disclosure by the Government is subject to the restrictions set forth in this Agreement.\n-Warranties and Disclaimers\n-This publication and\/or website may include technical or typographical errors or other inaccuracies. Changes are periodically added to the information herein; these changes will be incorporated in new editions of the publication and\/or website. Unicode, Inc. may make improvements and\/or changes in the product(s) and\/or program(s) described in this publication and\/or website at any time.\n-If this file has been purchased on magnetic or optical media from Unicode, Inc. the sole and exclusive remedy for any claim will be exchange of the defective media within ninety (90) days of original purchase.\n-EXCEPT AS PROVIDED IN SECTION E.2, THIS PUBLICATION AND\/OR SOFTWARE IS PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND EITHER EXPRESS, IMPLIED, OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT. UNICODE, INC. AND ITS LICENSORS ASSUME NO RESPONSIBILITY FOR ERRORS OR OMISSIONS IN THIS PUBLICATION AND\/OR SOFTWARE OR OTHER DOCUMENTS WHICH ARE REFERENCED BY OR LINKED TO THIS PUBLICATION OR THE UNICODE WEBSITE.\n-Waiver of Damages\n-In no event shall Unicode, Inc. or its licensors be liable for any special, incidental, indirect or consequential damages of any kind, or any damages whatsoever, whether or not Unicode, Inc. was advised of the possibility of the damage, including, without limitation, those resulting from the following: loss of use, data or profits, in connection with the use, modification or distribution of this information or its derivatives.\n-Trademarks & Logos\n-The Unicode Word Mark and the Unicode Logo are trademarks of Unicode, Inc. “The Unicode Consortium” and “Unicode, Inc.” are trade names of Unicode, Inc. Use of the information and materials found on this website indicates your acknowledgement of Unicode, Inc.’s exclusive worldwide rights in the Unicode Word Mark, the Unicode Logo, and the Unicode trade names.\n-The Unicode Consortium Name and Trademark Usage Policy (“Trademark Policy”) are incorporated herein by reference and you agree to abide by the provisions of the Trademark Policy, which may be changed from time to time in the sole discretion of Unicode, Inc.\n-All third party trademarks referenced herein are the property of their respective owners.\n-Miscellaneous\n-Jurisdiction and Venue. This website is operated from a location in the State of California, United States of America. Unicode, Inc. makes no representation that the materials are appropriate for use in other locations. If you access this website from other locations, you are responsible for compliance with local laws. This Agreement, all use of this website and any claims and damages resulting from use of this website are governed solely by the laws of the State of California without regard to any principles which would apply the laws of a different jurisdiction. The user agrees that any disputes regarding this website shall be resolved solely in the courts located in Santa Clara County, California. The user agrees said courts have personal jurisdiction and agree to waive any right to transfer the dispute to any other forum.\n-Modification by Unicode, Inc. Unicode, Inc. shall have the right to modify this Agreement at any time by posting it to this website. The user may not assign any part of this Agreement without Unicode, Inc.’s prior written consent.\n-Taxes. The user agrees to pay any taxes arising from access to this website or use of the information herein, except for those based on Unicode’s net income.\n-Severability.  If any provision of this Agreement is declared invalid or unenforceable, the remaining provisions of this Agreement shall remain in effect.\n-Entire Agreement. This Agreement constitutes the entire agreement between the parties.\n-\n-=======================================================\n-\n-UNICODE, INC. LICENSE AGREEMENT - DATA FILES AND SOFTWARE\n-\n-See Terms of Use\n-for definitions of Unicode Inc.’s Data Files and Software.\n-\n-NOTICE TO USER: Carefully read the following legal agreement.\n-BY DOWNLOADING, INSTALLING, COPYING OR OTHERWISE USING UNICODE INC.'S\n-DATA FILES (\"DATA FILES\"), AND\/OR SOFTWARE (\"SOFTWARE\"),\n-YOU UNEQUIVOCALLY ACCEPT, AND AGREE TO BE BOUND BY, ALL OF THE\n-TERMS AND CONDITIONS OF THIS AGREEMENT.\n-IF YOU DO NOT AGREE, DO NOT DOWNLOAD, INSTALL, COPY, DISTRIBUTE OR USE\n-THE DATA FILES OR SOFTWARE.\n+======================================================================\n@@ -483,1 +120,0 @@\n-COPYRIGHT AND PERMISSION NOTICE\n@@ -485,2 +121,1 @@\n-Copyright © 1991-2022 Unicode, Inc. All rights reserved.\n-Distributed under the Terms of Use in https:\/\/www.unicode.org\/copyright.html.\n+From: https:\/\/www.unicode.org\/copyright.html\n@@ -488,23 +123,1 @@\n-Permission is hereby granted, free of charge, to any person obtaining\n-a copy of the Unicode data files and any associated documentation\n-(the \"Data Files\") or Unicode software and any associated documentation\n-(the \"Software\") to deal in the Data Files or Software\n-without restriction, including without limitation the rights to use,\n-copy, modify, merge, publish, distribute, and\/or sell copies of\n-the Data Files or Software, and to permit persons to whom the Data Files\n-or Software are furnished to do so, provided that either\n-(a) this copyright and permission notice appear with all copies\n-of the Data Files or Software, or\n-(b) this copyright and permission notice appear in associated\n-Documentation.\n-\n-THE DATA FILES AND SOFTWARE ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF\n-ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE\n-WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\n-NONINFRINGEMENT OF THIRD PARTY RIGHTS.\n-IN NO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS INCLUDED IN THIS\n-NOTICE BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT OR CONSEQUENTIAL\n-DAMAGES, OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE,\n-DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER\n-TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR\n-PERFORMANCE OF THE DATA FILES OR SOFTWARE.\n+For the general privacy policy governing access to this site, see the  Unicode Privacy Policy.\n@@ -512,4 +125,45 @@\n-Except as contained in this notice, the name of a copyright holder\n-shall not be used in advertising or otherwise to promote the sale,\n-use or other dealings in these Data Files or Software without prior\n-written authorization of the copyright holder.\n+    Unicode Copyright\n+        Copyright © 1991-2023 Unicode, Inc. All rights reserved.\n+    Definitions\n+\n+    Unicode Data Files (\"DATA FILES\") include all data files under the directories:\n+    https:\/\/www.unicode.org\/Public\/\n+    https:\/\/www.unicode.org\/reports\/\n+    https:\/\/www.unicode.org\/ivd\/data\/\n+\n+    Unicode Data Files do not include PDF online code charts under the directory:\n+    https:\/\/www.unicode.org\/Public\/\n+\n+    Unicode Software (\"SOFTWARE\") includes any source code published in the Unicode Standard\n+    or any source code or compiled code under the directories:\n+    https:\/\/www.unicode.org\/Public\/PROGRAMS\/\n+    https:\/\/www.unicode.org\/Public\/cldr\/\n+    http:\/\/site.icu-project.org\/download\/\n+\n+    Terms of Use\n+        Certain documents and files on this website contain a legend indicating that \"Modification is permitted.\" Any person is hereby authorized, without fee, to modify such documents and files to create derivative works conforming to the Unicode® Standard, subject to Terms and Conditions herein.\n+        Any person is hereby authorized, without fee, to view, use, reproduce, and distribute all documents and files, subject to the Terms and Conditions herein.\n+        Further specifications of rights and restrictions pertaining to the use of the Unicode DATA FILES and SOFTWARE can be found in the Unicode Data Files and Software License.\n+        Each version of the Unicode Standard has further specifications of rights and restrictions of use. For the book editions (Unicode 5.0 and earlier), these are found on the back of the title page.\n+        The Unicode PDF online code charts carry specific restrictions. Those restrictions are incorporated as the first page of each PDF code chart.\n+        All other files, including online documentation of the core specification for Unicode 6.0 and later, are covered under these general Terms of Use.\n+        No license is granted to \"mirror\" the Unicode website where a fee is charged for access to the \"mirror\" site.\n+        Modification is not permitted with respect to this document. All copies of this document must be verbatim.\n+    Restricted Rights Legend\n+        Any technical data or software which is licensed to the United States of America, its agencies and\/or instrumentalities under this Agreement is commercial technical data or commercial computer software developed exclusively at private expense as defined in FAR 2.101, or DFARS 252.227-7014 (June 1995), as applicable. For technical data, use, duplication, or disclosure by the Government is subject to restrictions as set forth in DFARS 202.227-7015 Technical Data, Commercial and Items (Nov 1995) and this Agreement. For Software, in accordance with FAR 12-212 or DFARS 227-7202, as applicable, use, duplication or disclosure by the Government is subject to the restrictions set forth in this Agreement.\n+    Warranties and Disclaimers\n+        This publication and\/or website may include technical or typographical errors or other inaccuracies. Changes are periodically added to the information herein; these changes will be incorporated in new editions of the publication and\/or website. Unicode, Inc. may make improvements and\/or changes in the product(s) and\/or program(s) described in this publication and\/or website at any time.\n+        If this file has been purchased on magnetic or optical media from Unicode, Inc. the sole and exclusive remedy for any claim will be exchange of the defective media within ninety (90) days of original purchase.\n+        EXCEPT AS PROVIDED IN SECTION E.2, THIS PUBLICATION AND\/OR SOFTWARE IS PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND EITHER EXPRESS, IMPLIED, OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, ANY WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT. UNICODE, INC. AND ITS LICENSORS ASSUME NO RESPONSIBILITY FOR ERRORS OR OMISSIONS IN THIS PUBLICATION AND\/OR SOFTWARE OR OTHER DOCUMENTS WHICH ARE REFERENCED BY OR LINKED TO THIS PUBLICATION OR THE UNICODE WEBSITE.\n+    Waiver of Damages\n+        In no event shall Unicode, Inc. or its licensors be liable for any special, incidental, indirect or consequential damages of any kind, or any damages whatsoever, whether or not Unicode, Inc. was advised of the possibility of the damage, including, without limitation, those resulting from the following: loss of use, data or profits, in connection with the use, modification or distribution of this information or its derivatives.\n+    Trademarks & Logos\n+        The Unicode Word Mark and the Unicode Logo are trademarks of Unicode, Inc. “The Unicode Consortium” and “Unicode, Inc.” are trade names of Unicode, Inc. Use of the information and materials found on this website indicates your acknowledgement of Unicode, Inc.’s exclusive worldwide rights in the Unicode Word Mark, the Unicode Logo, and the Unicode trade names.\n+        The Unicode Consortium Name and Trademark Usage Policy (“Trademark Policy”) are incorporated herein by reference and you agree to abide by the provisions of the Trademark Policy, which may be changed from time to time in the sole discretion of Unicode, Inc.\n+        All third party trademarks referenced herein are the property of their respective owners.\n+    Miscellaneous\n+        Jurisdiction and Venue. This website is operated from a location in the State of California, United States of America. Unicode, Inc. makes no representation that the materials are appropriate for use in other locations. If you access this website from other locations, you are responsible for compliance with local laws. This Agreement, all use of this website and any claims and damages resulting from use of this website are governed solely by the laws of the State of California without regard to any principles which would apply the laws of a different jurisdiction. The user agrees that any disputes regarding this website shall be resolved solely in the courts located in Santa Clara County, California. The user agrees said courts have personal jurisdiction and agree to waive any right to transfer the dispute to any other forum.\n+        Modification by Unicode, Inc. Unicode, Inc. shall have the right to modify this Agreement at any time by posting it to this website. The user may not assign any part of this Agreement without Unicode, Inc.’s prior written consent.\n+        Taxes. The user agrees to pay any taxes arising from access to this website or use of the information herein, except for those based on Unicode’s net income.\n+        Severability.  If any provision of this Agreement is declared invalid or unenforceable, the remaining provisions of this Agreement shall remain in effect.\n+        Entire Agreement. This Agreement constitutes the entire agreement between the parties.\n","filename":"src\/java.base\/share\/legal\/icu.md","additions":94,"deletions":440,"binary":false,"changes":534,"status":"modified"}]}