{"files":[{"patch":"@@ -1305,1 +1305,1 @@\n-In addition to the testing you run manually before publishing your changes, it's recommended that you take advantage of this automated testing that the GHA offers. To enable this on your personal fork of the JDK on GitHub go to the \"Actions\" tab and click the big green button saying \"I understand my workflows, go ahead and enable them\". If you don't understand these workflows there's a link to the actual file that describes them right below the green button.\n+In addition to the testing you run manually before publishing your changes, it's recommended that you take advantage of this automated testing that the GHA offers. This will for instance allow you to run tests on platforms that you may not otherwise have access to. To enable this on your personal fork of the JDK on GitHub go to the \"Actions\" tab and click the big green button saying \"I understand my workflows, go ahead and enable them\". If you don't understand these workflows there's a link to the actual file that describes them right below the green button.\n@@ -1309,1 +1309,1 @@\n-Please keep in mind that the tier 1 tests run by the GHA should only be seen as a smoke test that finds the most critical breakages, like build errors or if the JDK is DOA. These tests can never replace the targeted testing that you always must do on your changes.\n+Please keep in mind that the tier 1 tests run by the GHA should only be seen as a smoke test that finds the most critical breakages, like build errors or if the JDK is DOA. These tests can never replace the targeted testing that you always must do on your changes. There are several areas of the JDK that aren't part of tier 1 at all. To see exactly what tier 1 includes, please see the various TEST.groups files that you will find in the subdirectories of [`jdk\/test\/`](https:\/\/github.com\/openjdk\/jdk\/tree\/master\/test).\n","filename":"src\/index.md","additions":2,"deletions":2,"binary":false,"changes":4,"status":"modified"}]}