{"files":[{"patch":"@@ -832,3 +832,6 @@\n-We are using the thread-index `kc.gix` to access, in theory, the same row of a\n-matrix for all `kc.giy` thread-indexes.\n-But this is not how the CUDA thread mapping works. As mentioned in\n+We are using the thread-index `kc.gix` to access, what we pretended, \n+contiguous elements of the the same row of the matrix (row-major).\n+HAT maps the parallel construct `kc.gix` to an equivalent parallel construct\n+of the underlying programming model, and our case, CUDA. \n+When we have 2D matrices, or multi-dimensional arrays for that matter, \n+this indexing is not how the CUDA thread mapping works. As mentioned in\n@@ -838,1 +841,2 @@\n-> laid out linearly with the X index, or `threadIdx.x`, moving the fastest.\n+> laid out linearly with the X index, or `threadIdx.x` [(or global index)], \n+> moving the fastest.\n@@ -841,3 +845,2 @@\n-within a block). In HAT, this is the equivalent of `kernelContext.lix`. Note\n-that these built-in functions in HAT are common for all backends, including\n-OpenCL and CUDA.\n+within a block). In HAT, this is the equivalent of `kc.lix`. But\n+our our purpose here, it is also equivalent to our global thread-index (`kc.gix`).\n@@ -846,1 +849,2 @@\n-block, the way consecutive threads are organized are as follows:\n+block, the way consecutive threads using `kc.gix, kc.giy` are \n+organized are as follows:\n@@ -852,2 +856,9 @@\n-Thus, for matrix A of our example, the following indexing applies for\n-consecutive threads based on the previous kernel:\n+As mentioned in the CUDA documentation, since the first index moves faster,\n+the `kc.gix` index moves faster in HAT, and we are using this parallel built-in\n+to access the rows of `matrixA`.\n+\n+That means that, for each consecutive threads in the first dimension `kc.gix`, \n+(gix, gix+1), we are accessing the matrices in column-major, instead of \n+row-major. Thus, for matrix A of our example, \n+the following indexing applies for consecutive threads based on the \n+previous kernel:\n@@ -865,1 +876,0 @@\n-Basically, we transform column-major access to row-major.\n","filename":"site\/articles\/hat-matmul.md","additions":21,"deletions":11,"binary":false,"changes":32,"status":"modified"}]}