{"files":[{"patch":"@@ -51,0 +51,43 @@\n+ * <h2><a id=\"shutdown\">Shutdown Sequence<\/a><\/h2>\n+ * <p>\n+ * The Java Virtual Machine initiates the <i>shutdown sequence<\/i> in response\n+ * to one of several events:\n+ * <ol>\n+ * <li>when the number of non-daemon threads drops to zero for the first time;<\/li>\n+ * <li>when the {@link #exit Runtime.exit} or {@link System#exit System.exit} method is called; or<\/li>\n+ * <li>when some external event occurs, such as an interrupt or a signal is received from\n+ * the operating system.<\/li>\n+ * <\/ol>\n+ *\n+ * <p>At the beginning of the shutdown sequence, the set of registered\n+ * {@linkplain #addShutdownHook shutdown hooks}\n+ * is established atomically. After this point, registration and de-registration\n+ * of shutdown hooks with\n+ * {@link #addShutdownHook addShutdownHook}\n+ * and\n+ * {@link #removeShutdownHook removeShutdownHook}\n+ * is prohibited. The shutdown hooks are then started in some unspecified order,\n+ * and they are allowed to run concurrently. Any already-existing threads and any\n+ * newly started threads also continue to run concurrently during the shutdown sequence.\n+ * <p>\n+ * When all shutdown hooks have completed, the Java Virtual Machine terminates as described\n+ * below. If for some reason one of the shutdown hooks does not complete, if for example\n+ * {@link #exit exit} is called, this will prevent the shutdown sequence from completing.\n+ * In this case other threads (including shutdown hooks) continue to execute and can\n+ * terminate the JVM via the {@link #halt halt} method.\n+ * <h2><a id=\"termination\">Virtual Machine Termination<\/a><\/h2>\n+ * When the JVM terminates, all threads (daemon, non-daemon, and shutdown hooks) are immediately\n+ * prevented from executing any further Java code. The threads' current methods do\n+ * not complete normally or abruptly. No {@code finally} clause of any method\n+ * is executed, nor is any uncaught exception handler.\n+ *\n+ * @implNote\n+ * Conventionally, the native code that has launched the JVM will invoke the JNI function\n+ * <a href=\"{@docRoot}\/..\/specs\/jni\/invocation.html#destroyjavavm\">DestroyJavaVM<\/a>.\n+ * This function is responsible for initiating the shutdown sequence when the number of\n+ * non-daemon threads drops to zero. When the shutdown sequence completes and the JVM\n+ * terminates, control is returned to native invocation code.\n+ * <p>\n+ * In typical JVM implementations, calling {@link #exit exit} or {@link #halt halt} will\n+ * also terminate the OS process hosting the JVM.\n+ *\n@@ -52,0 +95,1 @@\n+ * @jls     12.8 Program Exit\n@@ -76,2 +120,4 @@\n-     * Terminates the currently running Java virtual machine by initiating its\n-     * shutdown sequence.  This method never returns normally.  The argument\n+     * Initiates the <a href=\"#shutdown\">shutdown sequence<\/a> of the Java Virtual\n+     * Machine. This method blocks indefinitely; it never returns or throws an\n+     * exception (that is, it does not complete either normally or abruptly).\n+     * The argument\n@@ -81,5 +127,0 @@\n-     * <p> All registered {@linkplain #addShutdownHook shutdown hooks}, if any,\n-     * are started in some unspecified order and allowed to run concurrently\n-     * until they finish.  Once this is done the virtual machine\n-     * {@linkplain #halt halts}.\n-     *\n@@ -88,3 +129,6 @@\n-     * terminate the VM with the given status code. All other invocations\n-     * will block indefinitely. If this method is invoked from a shutdown\n-     * hook the system will deadlock.\n+     * halt the VM with the given status code. All other invocations\n+     * simply block indefinitely.\n+     *\n+     * <p> Because this method always blocks indefinitely, if it is invoked from\n+     * a shutdown hook, it will prevent that shutdown hook from completing.\n+     * Consequently, this will prevent the entire shutdown sequence from completing.\n@@ -122,15 +166,0 @@\n-     * <p> The Java virtual machine <i>shuts down<\/i> in response to two kinds\n-     * of events:\n-     *\n-     *   <ul>\n-     *\n-     *   <li> The program <i>exits<\/i> normally, when the last non-daemon\n-     *   thread exits or when the {@link #exit exit} (equivalently,\n-     *   {@link System#exit(int) System.exit}) method is invoked, or\n-     *\n-     *   <li> The virtual machine is <i>terminated<\/i> in response to a\n-     *   user interrupt, such as typing {@code ^C}, or a system-wide event,\n-     *   such as user logoff or system shutdown.\n-     *\n-     *   <\/ul>\n-     *\n@@ -138,18 +167,13 @@\n-     * thread.  When the virtual machine begins its shutdown sequence it will\n-     * start all registered shutdown hooks in some unspecified order and let\n-     * them run concurrently.  When all the hooks have finished it will then\n-     * halt. Note that daemon threads will continue to run during the shutdown\n-     * sequence, as will non-daemon threads if shutdown was initiated by\n-     * invoking the {@link #exit exit} method.\n-     *\n-     * <p> Once the shutdown sequence has begun it can be stopped only by\n-     * invoking the {@link #halt halt} method, which forcibly\n-     * terminates the virtual machine.\n-     *\n-     * <p> Once the shutdown sequence has begun it is impossible to register a\n-     * new shutdown hook or de-register a previously-registered hook.\n-     * Attempting either of these operations will cause an\n-     * {@link IllegalStateException} to be thrown.\n-     *\n-     * <p> Shutdown hooks run at a delicate time in the life cycle of a virtual\n-     * machine and should therefore be coded defensively.  They should, in\n+     * thread. Shutdown hooks are started at the beginning of the\n+     * <a href=\"shutdown\">shutdown sequence<\/a>.\n+     * Registration and de-registration of shutdown hooks is disallowed\n+     * once the shutdown sequence has begun.\n+     * <p>\n+     * Uncaught exceptions are handled in shutdown hooks just as in any other thread,\n+     * by invoking the {@link ThreadGroup#uncaughtException uncaughtException}\n+     * method of the thread's {@link ThreadGroup} object. After the uncaught exception\n+     * handler has completed, the shutdown hook is considered to have completed and\n+     * is not treated differently from a hook that has completed normally.\n+     * @apiNote\n+     * Shutdown hooks run at a delicate time in the life cycle of a virtual\n+     * machine and should therefore be coded defensively. They should, in\n@@ -157,1 +181,1 @@\n-     * as possible.  They should also not rely blindly upon services that may\n+     * as possible. They should also not rely blindly upon services that may\n@@ -159,1 +183,1 @@\n-     * the process of shutting down.  Attempts to use other thread-based\n+     * the process of shutting down. Attempts to use other thread-based\n@@ -162,3 +186,3 @@\n-     *\n-     * <p> Shutdown hooks should also finish their work quickly.  When a\n-     * program invokes {@link #exit exit} the expectation is\n+     * <p>\n+     * Shutdown hooks should also finish their work quickly.  When a\n+     * program invokes {@link #exit exit}, the expectation is\n@@ -167,2 +191,2 @@\n-     * underlying operating system may only allow a fixed amount of time in\n-     * which to shut down and exit.  It is therefore inadvisable to attempt any\n+     * underlying operating system may only allow a limited amount of time in\n+     * which to shut down and exit. It is therefore inadvisable to attempt any\n@@ -172,18 +196,0 @@\n-     * <p> Uncaught exceptions are handled in shutdown hooks just as in any\n-     * other thread, by invoking the\n-     * {@link ThreadGroup#uncaughtException uncaughtException} method of the\n-     * thread's {@link ThreadGroup} object. The default implementation of this\n-     * method prints the exception's stack trace to {@link System#err} and\n-     * terminates the thread; it does not cause the virtual machine to exit or\n-     * halt.\n-     *\n-     * <p> In rare circumstances the virtual machine may <i>abort<\/i>, that is,\n-     * stop running without shutting down cleanly.  This occurs when the\n-     * virtual machine is terminated externally, for example with the\n-     * {@code SIGKILL} signal on Unix or the {@code TerminateProcess} call on\n-     * Microsoft Windows.  The virtual machine may also abort if a native\n-     * method goes awry by, for example, corrupting internal data structures or\n-     * attempting to access nonexistent memory.  If the virtual machine aborts\n-     * then no guarantee can be made about whether or not any shutdown hooks\n-     * will be run.\n-     *\n@@ -194,3 +200,3 @@\n-     *          If the specified hook has already been registered,\n-     *          or if it can be determined that the hook is already running or\n-     *          has already been run\n+     *          If the same hook (compared using {@code ==}) as the specified hook has\n+     *          already been registered, or if it can be determined that the hook is\n+     *          already running or has already been run\n@@ -199,2 +205,1 @@\n-     *          If the virtual machine is already in the process\n-     *          of shutting down\n+     *          If the shutdown sequence has already begun\n@@ -222,0 +227,3 @@\n+     * Hooks are compared using {@code ==}.\n+     * Registration and de-registration of shutdown hooks is disallowed\n+     * once the shutdown sequence has begun.\n@@ -229,2 +237,1 @@\n-     *          If the virtual machine is already in the process of shutting\n-     *          down\n+     *          If the shutdown sequence has already begun\n@@ -250,8 +257,11 @@\n-     * Forcibly terminates the currently running Java virtual machine.  This\n-     * method never returns normally.\n-     *\n-     * <p> This method should be used with extreme caution.  Unlike the\n-     * {@link #exit exit} method, this method does not cause shutdown\n-     * hooks to be started.  If the shutdown sequence has already been\n-     * initiated then this method does not wait for any running\n-     * shutdown hooks to finish their work.\n+     * Immediately terminates the Java Virtual Machine.\n+     * <a href=\"#termination\">Termination<\/a>\n+     * is unconditional and immediate. This method does not initiate the\n+     * <a href=\"#shutdown\">shutdown sequence<\/a>,\n+     * nor does it await its completion if it is already in progress.\n+     * This method never returns normally.\n+     *\n+     * @apiNote\n+     * This method should be used with extreme caution. Using it may circumvent or disrupt\n+     * any cleanup actions intended to be performed by shutdown hooks, possibly\n+     * leading to data corruption.\n","filename":"src\/java.base\/share\/classes\/java\/lang\/Runtime.java","additions":93,"deletions":83,"binary":false,"changes":176,"status":"modified"},{"patch":"@@ -1886,1 +1886,2 @@\n-     * Terminates the currently running Java Virtual Machine. The\n+     * Initiates the <a href=\"Runtime.html#shutdown\">shutdown sequence<\/a> of the Java Virtual\n+     * Machine. This method always blocks indefinitely. The\n","filename":"src\/java.base\/share\/classes\/java\/lang\/System.java","additions":2,"deletions":1,"binary":false,"changes":3,"status":"modified"}]}