{"files":[{"patch":"@@ -788,3 +788,6 @@\n-     * Gets the fully qualified domain name for this IP address.\n-     * Best effort method, meaning we may not be able to return\n-     * the FQDN depending on the underlying system configuration.\n+     * Gets the fully qualified domain name for this\n+     * {@linkplain InetAddress#getAddress() IP address} using the system-wide\n+     * {@linkplain InetAddressResolver resolver}. This is a best effort method,\n+     * meaning we may not be able to return the fully qualified domain name; in\n+     * which case this method returns the\n+     * {@linkplain #getHostAddress() textual representation} of the IP address.\n@@ -800,3 +803,4 @@\n-     * @return  the fully qualified domain name for this IP address,\n-     *    or if the operation is not allowed by the security check,\n-     *    the textual representation of the IP address.\n+     * @return  the fully qualified domain name for this IP address. \n+     *          If either the operation is not allowed by the security check\n+     *          or the system-wide resolver wasn't able to determine the fully qualified domain\n+     *          name for the IP address, the textual representation of the IP address is returned instead.\n@@ -817,1 +821,1 @@\n-     * Returns the hostname for this address.\n+     * Returns the fully qualified domain for this address.\n@@ -827,4 +831,0 @@\n-     * @return  the host name for this IP address, or if the operation\n-     *    is not allowed by the security check, the textual\n-     *    representation of the IP address.\n-     *\n@@ -833,0 +833,5 @@\n+     * @return  the fully qualified domain name for this IP address, or the textual representation\n+     *          of the IP address if either the operation is not allowed by the security check\n+     *          or the system-wide resolver wasn't able to determine the fully qualified domain\n+     *          name for the IP address.\n+     *\n","filename":"src\/java.base\/share\/classes\/java\/net\/InetAddress.java","additions":16,"deletions":11,"binary":false,"changes":27,"status":"modified"}]}