{"files":[{"patch":"@@ -44,1 +44,1 @@\n-<p>The make system can generate a Visual Studio project for a limited subset of native sources. After configuring, the project can be generated using:<\/p>\n+<p>The make system can generate a Visual Studio project for the Hotspot native source. After configuring, the project is generated using:<\/p>\n@@ -54,1 +54,1 @@\n-<p>The JDK project has a script that can be used for indexing the project with IntelliJ. After configuring and building the JDK, IntelliJ workspace can be generated using:<\/p>\n+<p>The JDK project has a script that can be used for indexing the project with IntelliJ. After configuring and building the JDK, an IntelliJ workspace can be generated by running the following command in the top-level folder of the cloned repository:<\/p>\n@@ -56,1 +56,1 @@\n-<p>This creates a subfolder called <code>.idea<\/code> in the current folder. To use it, choose <code>File -&gt; Open...<\/code> in IntelliJ and select the folder where you run the above script.<\/p>\n+<p>To use it, choose <code>File -&gt; Open...<\/code> in IntelliJ and select the folder where you ran the above script.<\/p>\n","filename":"doc\/ide.html","additions":3,"deletions":3,"binary":false,"changes":6,"status":"modified"},{"patch":"@@ -48,2 +48,2 @@\n-The make system can generate a Visual Studio project for a limited subset\n-of native sources. After configuring, the project can be generated using:\n+The make system can generate a Visual Studio project for the Hotspot\n+native source. After configuring, the project is generated using:\n@@ -81,2 +81,3 @@\n-with IntelliJ. After configuring and building the JDK, IntelliJ workspace\n-can be generated using:\n+with IntelliJ. After configuring and building the JDK, an IntelliJ workspace\n+can be generated by running the following command in the top-level folder\n+of the cloned repository:\n@@ -88,3 +89,2 @@\n-This creates a subfolder called `.idea` in the current folder. To use it,\n-choose `File -> Open...` in IntelliJ and select the folder where you run\n-the above script.\n+To use it, choose `File -> Open...` in IntelliJ and select the folder where\n+you ran the above script.\n","filename":"doc\/ide.md","additions":7,"deletions":7,"binary":false,"changes":14,"status":"modified"}]}