{"files":[{"patch":"@@ -11,0 +11,6 @@\n+## Requesting a change\n+\n+If you want to request a change to the JDK, but don't have the intention to implement the change yourself, you should always contact the developers through the appropriate [mailing list](#mailing-lists). This is also the case if you find a change that you would like to see backported to an eralier JDK release. Never reach out directly to any developer.\n+\n+Before you reach out, make sure you have read [Things to consider before proposing changes to OpenJDK code](#things-to-consider-before-proposing-changes-to-openjdk-code) and [Why is my change rejected?](#why-is-my-change-rejected) below.\n+\n@@ -35,0 +41,9 @@\n+## I found an issue in JBS that I want to fix\n+\n+Great! This is a good way to get started with OpenJDK development. There are a few things you should think about before getting started.\n+\n+- As with any change, do bring it up for discussion on the [mailing lists](#mailing-lists) before spending time on the fix. Even though the issue has been filed in JBS there may be reasons not to fix that particular issue right now.\n+- Never work on an issue that is assigned to someone else. Duplicating work is pointless. If you think that an issue should be fixed and it has been assinged to someone for a long time without progress, reach out to that person and ask what the current status is. Many issues requires a lot of thought, and there may be half-baked solutions that you can build on to avoid the traps the initial developer has already fallen into.\n+\n+Once you are the assignee of an issue, continue reading [I have a patch, what do I do?](#i-have-a-patch-what-do-i-do) below. (Ideally before you have a patch.)\n+\n@@ -75,6 +90,0 @@\n-## Requesting a change\n-\n-If you want to request a change to the JDK, but don't have the intention to implement the change yourself, you should always contact the developers through the appropriate [mailing list](#mailing-lists). This is also the case if you find a change that you would like to see backported to an eralier JDK release. Never reach out directly to any developer.\n-\n-Before you reach out, make sure you have read [Why is my change rejected?](#why-is-my-change-rejected) below.\n-\n","filename":"src\/guide\/contributing-to-an-open-jdk-project.md","additions":15,"deletions":6,"binary":false,"changes":21,"status":"modified"}]}