{"files":[{"patch":"@@ -312,4 +312,3 @@\n-         * When a connection timeout is configured, an {@link HttpClient}\n-         * implementation applies it to the entire connection phase, from the\n-         * moment a connection is requested until it is established. The\n-         * elapsed time includes any SSL\/TLS handshake.\n+         * A connection timeout applies to the entire connection phase, from the\n+         * moment a connection is requested until it is established. The elapsed\n+         * time includes any SSL\/TLS handshake.\n","filename":"src\/java.net.http\/share\/classes\/java\/net\/http\/HttpClient.java","additions":3,"deletions":4,"binary":false,"changes":7,"status":"modified"},{"patch":"@@ -265,2 +265,1 @@\n-         * When a timeout is configured, an {@link HttpClient} implementation\n-         * should apply it over the duration measured from the instant the\n+         * A timeout applies to the duration measured from the instant the\n@@ -273,5 +272,5 @@\n-         * When a timeout is configured, the JDK built-in implementation of the\n-         * {@link HttpClient} applies it over the duration measured from the\n-         * instant the request execution starts to <b>the instant the response\n-         * body is consumed<\/b>, if present. This is implemented by stopping\n-         * the timer after the response body subscriber completion.\n+         * The JDK built-in implementation applies timeout over the duration\n+         * measured from the instant the request execution starts to <b>the\n+         * instant the response body is consumed<\/b>, if present. This is\n+         * implemented by stopping the timer after the response body subscriber\n+         * completion.\n","filename":"src\/java.net.http\/share\/classes\/java\/net\/http\/HttpRequest.java","additions":6,"deletions":7,"binary":false,"changes":13,"status":"modified"},{"patch":"@@ -148,4 +148,3 @@\n-         * When a connection timeout value is present, a {@link WebSocket}\n-         * implementation should apply it over the duration measured from the\n-         * instant a connection is requested to the instant that one is\n-         * established. This duration includes SSL handshakes, if required.\n+         * A connection timeout applies to the entire connection phase, from the\n+         * moment a connection is requested until it is established. The elapsed\n+         * time includes any SSL\/TLS handshake.\n","filename":"src\/java.net.http\/share\/classes\/java\/net\/http\/WebSocket.java","additions":3,"deletions":4,"binary":false,"changes":7,"status":"modified"}]}