{"files":[{"patch":"@@ -26,1 +26,1 @@\n-> :    General discussions around the project. The special case `discuss@openjdk.org` is used for general discussions around OpenJDK. Discussions around new project proposals usually happens here.\n+> :    General discussions around the project. The special case `discuss@openjdk.org` is used for general discussions around OpenJDK. Discussions around new project proposals usually happen here.\n","filename":"src\/guide\/mailing-lists.md","additions":1,"deletions":1,"binary":false,"changes":2,"status":"modified"},{"patch":"@@ -0,0 +1,66 @@\n+# Project Maintenance\n+\n+Many OpenJDK projects build on top of the JDK source code. When doing this there are a number of common workflows that are dealt with by most project maintainers. For instance updating the code (merging) to bring in the latest changes from the upstream JDK project.\n+\n+## Merging JDK mainline into a project repository\n+\n+Merging changes from one git repository to another is basically the same thing as getting your own changes merged into the project repository, with the slight twist that you don't write all the changes yourself, you just pull them from somewhere else.\n+\n+In this example we'll use a separate clone of the project repository to perform the merge in. This can be done using branches as well, but let's keep it simple for now.\n+\n+### Init - done once\n+\n+First set up your personal fork of the project repository, in this example called `my-project`. If you already are a contributor to the project you most likely have this set up. If not, see [Cloning the JDK](#cloning-the-jdk) for details on how to do that.\n+\n+~~~\n+git clone git@github.com:OpenDuke\/my-project.git project-merge\n+cd project-merge\n+git remote add upstream git@github.com:openjdk\/my-project.git\n+git remote add mainline git@github.com:openjdk\/jdk.git\n+~~~\n+\n+We clone the personal fork into a local directory, here called `project-merge`. We then set up two remotes, `upstream` and `mainline`.\n+\n+### Performing the merge\n+\n+The clone we set up above is used each time you want to bring changes from mainline in to your project. This is done by first pulling the changes from mainline and then pushing to your personal fork. A regular PR will then be created which you can integrate into your main project repository. It sounds easy, and it is, but there are a few details below to keep in mind.\n+\n+~~~\n+cd project-merge\n+git pull upstream master\n+git push\n+git switch -c Merge_mainline\n+git fetch mainline\n+git merge mainline\/master\n+~~~\n+\n+We start by updating the local fork with the latest changes from the main project repository. Note that we then create a new branch in which the merge will happen.\n+\n+The commands above will likely run without a hitch up until the `git merge`. This is where you need to combine the changes that were made in mainline with the changes that have been made in your project repository. If there are no conflicts you're in luck, then the merge will be completely automated and you will end up with a commit ready to push. If there are conflicts however you'll need to manually go through the files where the conflicts are and make sure you select the correct version for each change. Using `git status` you can see what files that need to be merged. Depending on how much code your project has touched this can be quite a bit of work.\n+\n+Once you have a working version of your merged code (make sure you test it properly) you're ready to create the commit and push. Please note that `git commit` is only needed if there were conflicts. If the changes were successfully merged by `git merge`, you're already ready to push.\n+\n+~~~\n+git commit -m \"Merge\"\n+git push --set-upstream origin Merge_mainline\n+~~~\n+\n+Now it's time to create the PR on GitHub. Just opening the PR page in your browser will most often be enough to see a message about new code that was pushed to your personal fork, with a question if you want to create a PR. You do.\n+\n+Make sure the name of the PR starts with \"Merge\". You may have noticed that when you integrate a \"normal\" PR into an OpenJDK repository, all commits that have been done in that PR will be squashed into a single commit. For normal changes this is a good thing as each PR normally corresponds to a single JBS issue, but for a merge it would be highly undesirable to squash all the different commits that you pull in from mainline. A PR with a name that starts with \"Merge\" won't be squashed. That means that all the changes that you brought over will remain separate changes.\n+\n+Wether a merge requires a review or not is up to your project lead to decide. Many projects don't require this so the GitHub bots will allow you to push the merge as soon as the [GHA](#github-actions)s are done. (They actually allow you to push even before the GHAs are done, but that's in general not a good idea.)\n+\n+Once the PR has been integrated you can go back to your local clone and clean it up in preparation for the next merge.\n+\n+~~~\n+git switch master\n+git branch -d Merge_mainline\n+git push -d origin Merge_mainline\n+~~~\n+\n+These commands will remove the temporary branch that we created to perform the merge.\n+\n+::: {.box}\n+[To the top](#){.boxheader}\n+:::\n","filename":"src\/guide\/project-maintenance.md","additions":66,"deletions":0,"binary":false,"changes":66,"status":"added"},{"patch":"@@ -61,1 +61,1 @@\n-@requires os.family != ”windows”\n+@requires os.family != \"windows\"\n","filename":"src\/guide\/testing-the-jdk.md","additions":1,"deletions":1,"binary":false,"changes":2,"status":"modified"},{"patch":"@@ -27,1 +27,1 @@\n-:    The ramp down of a release starts with a fork of the mainline repository. A clone of the entire code base is made and hosted in a separate ramp down repository (e.g. [openjdk\/jdk17](https:\/\/github.com\/openjdk\/jdk17)). During the ramp down of a release we focus on bug fixing and stabilization in order to get the JDK ready for release. In RDP1 you may continue to fix P1-P3 product bugs (and some other issues) in the stabilization repo. For detailed information on what can be fixed when, see [JEP 3](https:\/\/openjdk.org\/jeps\/3). The start of RDP1 is essentially the deadline for integrating JEPs and enhancements into this particular release.\n+:    The ramp down of a release starts with a fork of the mainline repository. A clone of the entire code base is made and hosted in a separate ramp down repository (e.g. [openjdk\/jdk17](https:\/\/github.com\/openjdk\/jdk17)). During the ramp down of a release we focus on bug fixing and stabilization in order to get the JDK ready for release. In RDP1 you may continue to fix P1-P3 product bugs (and some other issues) in the stabilization repo. For detailed information on what can be fixed when, see [Push or defer](#push-or-defer-during-rampdown) below. The start of RDP1 is essentially the deadline for integrating JEPs and enhancements into this particular release.\n@@ -33,1 +33,1 @@\n-:    In RDP2 the bar is higher to get changes into the release. For product bugs, only P1:s and P2:s are supposed to be fixed here, and to do so an approval is needed. See the [Fix-Request Process](https:\/\/openjdk.org\/jeps\/3#Fix-Request-Process) for details on how to obtain one. All other product bugs should be deferred. Again, see [JEP 3](https:\/\/openjdk.org\/jeps\/3) for more details.\n+:    In RDP2 the bar is higher to get changes into the release. For product bugs, only P1:s and P2:s are supposed to be fixed here, and to do so an approval is needed. See the [Fix-Request Process](https:\/\/openjdk.org\/jeps\/3#Fix-Request-Process) for details on how to obtain one. All other product bugs should be deferred. See [Push or defer](#push-or-defer-during-rampdown) below for more details.\n@@ -41,0 +41,6 @@\n+### Push or defer during rampdown\n+\n+[JEP 3](https:\/\/openjdk.org\/jeps\/3) contains the exact definitions for what can be done when. This is a visualization of those definitions that may or may not clarify things.\n+\n+![Push and defer guidelines during rampdown](push-defer.png)\n+\n","filename":"src\/guide\/the-jdk-release-process.md","additions":8,"deletions":2,"binary":false,"changes":10,"status":"modified"},{"patch":"@@ -75,0 +75,2 @@\n+   If you want to update the title of the PR, remember that the one and only truth is the JBS issue, so the title must first be changed there.\n+\n","filename":"src\/guide\/working-with-pull-requests.md","additions":2,"deletions":0,"binary":false,"changes":2,"status":"modified"},{"filename":"src\/push-defer.png","binary":true,"status":"added"},{"patch":"@@ -14,0 +14,2 @@\n+the-jdk-release-process.md\n+project-maintenance.md\n@@ -16,1 +18,0 @@\n-the-jdk-release-process.md\n","filename":"src\/toc.conf","additions":2,"deletions":1,"binary":false,"changes":3,"status":"modified"}]}