{"files":[{"patch":"@@ -90,1 +90,8 @@\n-\/\/ escape at ctl if there is no node that make it escape at any transitive input of ctl\n+\/\/ escape at ctl if there is no node that:\n+\/\/ 1. Make the allocation escape.\n+\/\/ 2. Either:\n+\/\/   a. Has no control input.\n+\/\/   b. Has a control input that is a transitive control input of ctl.\n+\/\/\n+\/\/ In other word, alloc is determined not to escape at ctl if all nodes that make alloc escape have\n+\/\/ a control input that is not a transitive control input of ctl.\n@@ -92,1 +99,1 @@\n-  if (!phase->is_IterGVN() || alloc == nullptr) {\n+  if (!phase->is_IterGVN() || alloc == nullptr || ctl->is_top()) {\n@@ -123,2 +130,1 @@\n-  \/\/ Find all control nodes from ctl to alloc, alloc must dominate ctl, which means all paths from\n-  \/\/ ctl must arrive at alloc, or a dead end\n+  \/\/ Find all transitive control inputs of ctl\n@@ -126,0 +132,1 @@\n+  Node* start = phase->C->start();\n@@ -130,2 +137,2 @@\n-    assert(!n->is_Start(), \"alloc must dominate ctl\");\n-    if (n == alloc) {\n+    assert(n->bottom_type() == Type::CONTROL || n->bottom_type()->base() == Type::Tuple, \"must be a control node %s\", n->Name());\n+    if (n == start) {\n@@ -150,2 +157,2 @@\n-  if (!controls.member(alloc)) {\n-    \/\/ If there is no control path from ctl to alloc, ctl is a dead path, give up\n+  if (!controls.member(start)) {\n+    \/\/ If there is no control path from ctl to start, ctl is a dead path, give up\n@@ -155,1 +162,2 @@\n-  \/\/ Find all nodes that may escape alloc, and see whether they may be between ctl and alloc\n+  \/\/ Find all nodes that may escape alloc, and decide that it is provable that they must be\n+  \/\/ executed after ctl\n@@ -166,2 +174,2 @@\n-          \/\/ out is not executed before ctl, so it does not affect the escape status of alloc at\n-          \/\/ ctl\n+          \/\/ c is not a transitive control input of ctl, so out is not executed before ctl, which\n+          \/\/ means it does not affect the escape status of alloc at ctl\n","filename":"src\/hotspot\/share\/opto\/memnode.cpp","additions":19,"deletions":11,"binary":false,"changes":30,"status":"modified"}]}