{"files":[{"patch":"@@ -18,0 +18,4 @@\n+p {\n+    margin-top: 0em;\n+}\n+\n@@ -22,0 +26,12 @@\n+ul {\n+    margin: 1em;\n+}\n+\n+ul ul {\n+    margin: 0em;\n+}\n+\n+li p ~ ul {\n+    margin-top: -1em;\n+}\n+\n@@ -61,1 +77,2 @@\n-    color: #060\n+    color: #060;\n+    white-space: nowrap;\n","filename":"src\/guidestyle.css","additions":18,"deletions":1,"binary":false,"changes":19,"status":"modified"},{"patch":"@@ -38,1 +38,1 @@\n-Becoming an [Author](https:\/\/openjdk.java.net\/bylaws#author) is the first step. To achieve this you need to contribute two changes to the project in which you wish to become an Author. Once your changes are pushed into the code base and has been vetted enough to determine that the changes were indeed good changes you can go ahead and send an email to the project lead of that particular project and ask to be added as an Author.\n+Becoming an [Author](https:\/\/openjdk.java.net\/bylaws#author) is the first step. To achieve this you need to contribute two changes to the project in which you wish to become an Author. Once your changes are pushed into the code base and has been vetted enough to determine that the changes were indeed good changes you can go ahead and send an email to the project lead of that particular project and ask to be added as an Author. The [OpenJDK Project description](https:\/\/openjdk.java.net\/projects\/#project-author) has a template for such an email.\n@@ -46,1 +46,1 @@\n-Once you have the required changes, a Committer in the project can start a vote by sending an email proposing that you should become a Committer. The email should follow the template found in the [OpenJDK Project description](https:\/\/openjdk.java.net\/projects\/).\n+Once you have the required changes, a Committer in the project can start a vote by sending an email proposing that you should become a Committer. The email should follow the template found in the [OpenJDK Project description](https:\/\/openjdk.java.net\/projects\/#project-committer).\n@@ -56,1 +56,1 @@\n-Once you are deemed ready, a Reviewer in the project can start a vote by sending an email proposing that you should become a Reviewer. The email should follow the template found in the [OpenJDK Project description](https:\/\/openjdk.java.net\/projects\/).\n+Once you are deemed ready, a Reviewer in the project can start a vote by sending an email proposing that you should become a Reviewer. The email should follow the template found in the [OpenJDK Project description](https:\/\/openjdk.java.net\/projects\/#project-reviewer).\n@@ -390,1 +390,1 @@\n-      Used to indicate that an issue is related to Ahead of Time Compilation.\n+      Used to identify issues in Ahead of Time Compilation.\n@@ -398,1 +398,1 @@\n-      **Deprecated.** Was used to indicate that an issue was related to Application Class-Data Sharing. The [cds]{.jbs-label} label is now used instead.\n+      **Deprecated.** Was used to identify issues in Application Class-Data Sharing. The [cds]{.jbs-label} label is now used instead.\n@@ -406,1 +406,1 @@\n-      Used to indicate that an issue is related to the C1 JIT compiler.\n+      Used to identify issues in the C1 JIT compiler.\n@@ -415,1 +415,1 @@\n-      Used to indicate that an issue is related to the C2 JIT compiler.\n+      Used to identify issues in the C2 JIT compiler.\n@@ -425,1 +425,1 @@\n-      Used to indicate that an issue is related to Class Data Sharing.\n+      Used to identify issues in Class Data Sharing.\n@@ -441,1 +441,1 @@\n-      Used to indicate that an issue is related to docker support.\n+      Used to identify issues in docker support.\n@@ -449,1 +449,1 @@\n-      Used to indicate that an issue is related to a specific garbage collector in the JVM. E.g., [gc-g1]{.jbs-label}, [gc-shenandoah]{.jbs-label}, [gc-serial]{.jbs-label}, [gc-epsilon]{.jbs-label}\n+      Used to identify issues in specific garbage collectors in the JVM. E.g., [gc-g1]{.jbs-label}, [gc-shenandoah]{.jbs-label}, [gc-serial]{.jbs-label}, [gc-epsilon]{.jbs-label}\n@@ -491,1 +491,1 @@\n-      Used to tag bugs that are found in the \"same binary runs\", a stress testing method used to find intermittent failures.\n+      Used to identify issues that are found in the \"same binary runs\", a stress testing method used to find intermittent failures.\n@@ -507,1 +507,1 @@\n-      Used to indicate that an issue is related to internationalization. i18n is short for internationalization meaning \"i 18 letters and an n\".\n+      Used to identify issue in internationalization. i18n is short for internationalization meaning \"i 18 letters and an n\".\n@@ -618,1 +618,1 @@\n-      Used to identify a bug with noticeable performance impact. Either positive or negative.\n+      Used to identify an issue with noticeable performance impact. Either positive or negative.\n@@ -642,1 +642,1 @@\n-      A regression is a bug that didn't exist in the previous release. Ideally all regressions must be fixed in order to release the next major version.\n+      Used to identify regressions. A regression is a bug that didn't exist in the previous release. Ideally all regressions must be fixed in order to release the next major version.\n@@ -686,1 +686,1 @@\n-      Used to identify a bug as affecting Java SE startup performance.\n+      Used to identify an issue as affecting Java SE startup performance.\n@@ -720,0 +720,8 @@\n+  <tr>\n+    <td class=\"dictionary\">\n+      [[vthreads]{.jbs-label}]{#vthreads}\n+    <\/td>\n+    <td class=\"dictionary\">\n+      Used to identify an issue in the virtual thread implementation.\n+    <\/td>\n+  <\/tr>\n@@ -733,1 +741,1 @@\n-      Used to indicate that an issue is related to ZGC.\n+      Used to identify an issue in ZGC.\n@@ -1609,0 +1617,1 @@\n+\n@@ -1648,0 +1657,1 @@\n+\n@@ -1658,0 +1668,1 @@\n+\n@@ -1659,0 +1670,1 @@\n+\n","filename":"src\/index.md","additions":28,"deletions":16,"binary":false,"changes":44,"status":"modified"}]}