{"files":[{"patch":"@@ -206,8 +206,0 @@\n-\/\/ Scavenge objects on dirty cards of the given stripe [start, end). Accesses to\n-\/\/ the card table and scavenging is strictly limited to the stripe. The work on\n-\/\/ objects covering multiple stripes is shared among the worker threads owning the\n-\/\/ stripes.  To support this the card table is preprocessed before\n-\/\/ scavenge. Imprecise dirty marks of non-objArrays are copied from start stripes\n-\/\/ to all stripes (if any) they extend to.\n-\/\/ A copy of card table entries corresponding to the stripe called \"shadow\" table\n-\/\/ is used to separate card reading, clearing and redirtying.\n@@ -222,0 +214,3 @@\n+  \/\/ The \"shadow\" table is a copy of the card table entries of the current stripe.\n+  \/\/ It is used to separate card reading, clearing and redirtying which reduces\n+  \/\/ complexity significantly.\n@@ -279,2 +274,0 @@\n-\/\/ Propagate imprecise card marks from object start to all stripes an object extends to\n-\/\/ this thread is assigned to.\n@@ -307,1 +300,1 @@\n-      \/\/ potentially been marked imprecisely.  Mark first card of the stripe\n+      \/\/ potentially been marked imprecisely. Mark first card of the stripe\n@@ -352,0 +345,8 @@\n+\/\/ Scavenging and accesses to the card table are strictly limited to the stripe.\n+\/\/ In particular scavenging of an object crossing stripe boundaries is shared\n+\/\/ among the threads assigned to the stripes it resides on. This reduces\n+\/\/ complexity and enables shared scanning of large objects.\n+\/\/ It requires preprocessing of the card table though where imprecise card marks of\n+\/\/ objects crossing stripe boundaries are propagated to the first card of\n+\/\/ each stripe covered by the individual object.\n+\n@@ -358,0 +359,1 @@\n+  \/\/ ObjectStartArray queries can be expensive for large objects. We cache known objects.\n@@ -363,0 +365,1 @@\n+  \/\/ Queries must be monotonic because we don't check addr >= cached_obj.start_addr.\n","filename":"src\/hotspot\/share\/gc\/parallel\/psCardTable.cpp","additions":14,"deletions":11,"binary":false,"changes":25,"status":"modified"},{"patch":"@@ -50,1 +50,2 @@\n-  \/\/ Propagate imprecise card marks from object start to the stripes an object extends to.\n+  \/\/ Iterate the stripes with the given index and copy imprecise card marks of\n+  \/\/ objects reaching into a stripe to its first card.\n@@ -58,0 +59,1 @@\n+  \/\/ Scavenge contents on dirty cards of the given stripe [start, end).\n@@ -83,2 +85,0 @@\n-  void pre_scavenge(HeapWord* old_gen_bottom, uint active_workers);\n-\n@@ -86,1 +86,2 @@\n-\n+  void pre_scavenge(HeapWord* old_gen_bottom, uint active_workers);\n+  \/\/ Scavenge contents of stripes with the given index.\n","filename":"src\/hotspot\/share\/gc\/parallel\/psCardTable.hpp","additions":5,"deletions":4,"binary":false,"changes":9,"status":"modified"}]}