{"files":[{"patch":"@@ -40,1 +40,1 @@\n- * and a Gatherer may buffer arbitrarily much input before producing any output.\n+ * and may buffer input before producing any output.\n@@ -63,1 +63,1 @@\n- * <p>Each invocation to {@link #initializer()}, {@link #integrator()},\n+ * <p>Each invocation of {@link #initializer()}, {@link #integrator()},\n@@ -118,2 +118,2 @@\n- * <p>As an example, in order to create a gatherer to implement a sequential\n- * Prefix Scan as a Gatherer, it could be done the following way:\n+ * <p>As an example, a Gatherer implementing a sequential Prefix Scan \n+ * could be done the following way:\n@@ -152,1 +152,1 @@\n- * @implSpec Libraries that implement transformation based on {@code Gatherer},\n+ * @implSpec Libraries that implement transformations based on {@code Gatherer},\n@@ -185,1 +185,1 @@\n- *     be discarded if processing an earlier segment short-circuits.<\/li>\n+ *     be discarded if processing an earlier partition short-circuits.<\/li>\n@@ -501,1 +501,1 @@\n-         * Allows for checking whether the next stage is known to not want\n+         * Checks whether the next stage is known to not want\n","filename":"src\/java.base\/share\/classes\/java\/util\/stream\/Gatherer.java","additions":7,"deletions":7,"binary":false,"changes":14,"status":"modified"},{"patch":"@@ -329,1 +329,1 @@\n-     * An operation which executes operations concurrently\n+     * An operation which executes a function concurrently\n@@ -338,3 +338,3 @@\n-     * <p>If the mapper throws an exception during evaluation of this Gatherer,\n-     * and the result of that invocation is to be produced to the downstream,\n-     * then that exception will instead be rethrown as a {@link RuntimeException}.\n+     * <p>If a result of the function is to be pushed downstream but instead the function completed\n+     * exceptionally then the corresponding exception will instead be rethrown by this method as an \n+     * instance of {@link RuntimeException}. After which any remaining tasks are canceled. \n","filename":"src\/java.base\/share\/classes\/java\/util\/stream\/Gatherers.java","additions":4,"deletions":4,"binary":false,"changes":8,"status":"modified"}]}