{"files":[{"patch":"@@ -42,1 +42,1 @@\n-A few things to keep in mind when filing an issue:\n+#### Things to keep in mind when filing an issue\n@@ -49,2 +49,2 @@\n-  * If the failure is found in an update train of the JDK (e.g. 11.0.x), if possible please see if it's also present in [mainline](https:\/\/github.com\/openjdk\/jdk).\n-  * For enhancements the [Affects Version]{.jbs-field} should be left empty, unless it is only relevant to a specific release family.\n+  * If the failure is found in an update train of the JDK (e.g. 11.0.x), if possible please see if it's also present in [mainline](https:\/\/github.com\/openjdk\/jdk). See [Indicating what releases an issue is applicable to](#indicating-what-releases-an-issue-is-applicable-to) for more details.\n+  * For an enhancement the [Affects Version]{.jbs-field} should be left empty, unless it is only relevant to a specific release family.\n@@ -75,1 +75,44 @@\n-Things to keep in mind when requesting an improvement:\n+#### Indicating what releases an issue is applicable to\n+\n+Knowing when an issue was introduced is important to determine the impact of the issue and where it needs to be resolved. While in some cases it may be clear, it is likely that on submission and during triage this won't be known, instead we will have one or two data points from which we can begin to understand the range of releases which the issue impacts.\n+\n+The [Affects Version]{.jbs-field} field is used to indicate which releases an issue is applicable to, and to avoid having to set it to an exhaustive list of impacted releases the following assumptions are used to give that range:\n+\n+1) If an issue is applicable to a feature release N, it is assumed to be applicable to all (more recent) releases unless indicated otherwise (see [(Rel)-na](#usage-of-rel-na-label) below).\n+    - Note that if it is reported against an update release then all we can say is that it is applicable to all the following update releases, not necessarily the next feature release as it may have been introduced in an update.  Given this, it is always important to try and reproduce the issue in either the corresponding feature release or the following.\n+\n+1) If an issue is applicable to release N, then it can't be assumed that it is applicable to older releases less than N. It may be, but in general this is less important to know, as the majority of issues are only fixed in the latest feature release.  If the issue is a crash or important in another way, then it becomes worthwhile to take the time to determine if it is relevant to earlier LTS releases.\n+\n+Another aspect of an issue is when, the feature it is a part of, was added or removed from the JDK, which in either case limits the range of releases the issue impacts.  Knowing that a feature was removed before the oldest currently supported release means it can be resolved as will-not-fix.\n+\n+##### Setting the Affects Versions field\n+Set the [Affects Versions]{.jbs-field} field to the lowest release value that the bug is known to be reproducible on.\n+\n+* The [Affects Version\/s]{.jbs-field} isn't meant to be an exhaustive list of releases the issue is relevant to - it should initially be set to the release the issue was reproduced or identified on, and by implication it will be relevant to all releases past that point (see the [Usage of (Rel)[-na]{.jbs-label} Label](#usage-of-rel-na-label)). If it's later found to be applicable to an earlier release family then adding that earlier release is encouraged if the issue needs to be fixed in that release.\n+* Do not add additional release values to [Affects Version\/s]{.jbs-field} for the same release family. For example, if there is the value [11.0.2]{.jbs-value}, don't add [11.0.5]{.jbs-value}, [11.0.7]{.jbs-value} etc. Adding an additional value for a separate release family where it's still reproducible, e.g. JDK [21]{.jbs-value}, is encouraged, especially if there is not currently a feature release value set, or, it has been a few releases since it was last reproduced\/reviewed. For example if the [Affects Version\/s]{.jbs-field} is JDK [8]{.jbs-value}, but it is still relevant to the latest mainline release.\n+\n+##### Usage of (Rel)-na Label\n+\n+Labels of the form [(Rel)-na]{.jbs-label} (eg. [17-na]{.jbs-label}) should be used when a bug is not applicable to a more recent release family. For example:\n+\n+[Affects Version]{.jbs-field}: [7u111]{.jbs-value}, [8u131]{.jbs-value}\n+\n+add the label [9-na]{.jbs-label} if the issue is not relevant to JDK 9 and above.\n+Reasons why this would be the case include the fact that the source has been removed from a later release or rewritten such that the issue is no longer relevant.\n+\n+Do not:\n+\n+- use the label to indicate that a bug is not relevant to an earlier release, for example<br>[Affects Version]{.jbs-field}: [11.0.20]{.jbs-value}, [17]{.jbs-value}<br> the label [8-na]{.jbs-label} would not be needed - as it doesn't have a JDK 8 release, or earlier, value in the [Affects Versions]{.jbs-field}, it is not relevant to JDK 8.\n+- add multiple [-na]{.jbs-label} labels: you only need one, for example don't add both [9-na]{.jbs-label} and [11-na]{.jbs-label} — [9-na]{.jbs-label} implies all following releases therefore [11-na]{.jbs-label}, or [17-na]{.jbs-label} etc. are not needed.\n+\n+##### Usage of (Rel)-wnf Label\n+\n+Labels of the form [(Rel)-wnf]{.jbs-label} (e.g. [11-wnf]{.jbs-label}) should be used to indicate that a bug is not going to be fixed in a release that it is applicable to, or any earlier releases. For example, [11-wnf]{.jbs-label} states it won't be fixed in JDK 11 and implicitly indicates it won't be fixed in JDK 8 either).\n+\n+Add a comment when adding a [(Rel)-wnf]{.jbs-label} label so that it is clear for those looking at the issue, why it won't be fixed in that release.\n+\n+##### Examples\n+\n+![Guidelines for setting Affects Version](affects_versions.png)\n+\n+#### Things to keep in mind when requesting an improvement\n@@ -166,5 +209,4 @@\n-   * This may involve reproducing the bug, if doing so is fast and easy.\n-   * In addition to the version where the bug was found, take special care to also investigate if the bug affects mainline.\n-   * The [Affects Version\/s]{.jbs-field} isn't meant to be an exhaustive list of releases the issue is relevant to - it should initially be set to the release the issue was reproduced or identified on, and by implication it will be relevant on all releases past that point (see the [(Rel)[-na]{.jbs-label}](#rel-na) label). If it's later found to be applicable to an earlier release family then adding that earlier release is encouraged if the issue needs to be fixed in that release.\n-   * Do not add additional release values to [Affects Version\/s]{.jbs-field} for the same release family. E.g. If there is the value [11.0.2]{.jbs-value}, don't add [11.0.5]{.jbs-value}, [11.0.7]{.jbs-value} etc. Adding an additional value for a separate release family where it's still reproducible, e.g. [12]{.jbs-value}, isn't necessary but ok, especially if there's been a few releases since the latest version noted. E.g. [Affects Version\/s]{.jbs-field} is [8]{.jbs-value} but its still relevant to the latest mainline release.\n-   * For enhancements the [Affects Version]{.jbs-field} should be empty unless you feel that it is only relevant to a particular release family, and should not go into a future mainline release.\n+    * This may involve reproducing the bug, if doing so is fast and easy.\n+    * In addition to the version where the bug was found, take special care to also investigate if the bug affects mainline.\n+      * See [Indicating what releases an issue is applicable to](#indicating-what-releases-an-issue-is-applicable-to) for more details.\n+    * For enhancements the [Affects Version]{.jbs-field} should be empty unless it is only relevant to a particular release family, and should not go into a future mainline release.\n","filename":"src\/guide\/jbs-jdk-bug-system.md","additions":51,"deletions":9,"binary":false,"changes":60,"status":"modified"},{"filename":"src\/images\/affects_versions.png","binary":true,"status":"added"}]}