{"files":[{"patch":"@@ -82,1 +82,1 @@\n-    - Note that if it is reported against an update release then all we can say is that it is applicable to all the following update releases, not necessarily the next feature release as it may have been introduced in an update.  Given this, it is always important to try and reproduce the issue in either the corresponding feature release or the following.\n+    - Note that if it is reported against an update release then all we can say is that it is applicable to all the following update releases, not necessarily the next feature release as it may have been introduced in an update.  Given this, it is always important to try and reproduce the issue in either the corresponding feature release as well as the mainline.\n@@ -92,1 +92,1 @@\n-* Do not add additional release values to [Affects Version\/s]{.jbs-field} for the same release family. For example, if there is the value [11.0.2]{.jbs-value}, don't add [11.0.5]{.jbs-value}, [11.0.7]{.jbs-value} etc. Adding an additional value for a separate release family where it's still reproducible, e.g. JDK [21]{.jbs-value}, is encouraged, especially if there is not currently a feature release value set, or, it has been a few releases since it was last reproduced\/reviewed. For example if the [Affects Version\/s]{.jbs-field} is JDK [8]{.jbs-value}, but it is still relevant to the latest mainline release.\n+* Do not add additional release values to [Affects Version\/s]{.jbs-field} for the same release family. For example, if there is the value [11.0.2]{.jbs-value}, don't add [11.0.5]{.jbs-value}, [11.0.7]{.jbs-value} etc. Adding an additional value for a separate release family where it's still reproducible, e.g. JDK [21]{.jbs-value}, is encouraged, especially if there is not currently a feature release value set, or, it has been a few releases since it was last reproduced\/reviewed. For example, if the [Affects Version\/s]{.jbs-field} is JDK [8]{.jbs-value}, but it is still relevant to the latest mainline release.\n","filename":"src\/guide\/jbs-jdk-bug-system.md","additions":2,"deletions":2,"binary":false,"changes":4,"status":"modified"}]}