{"files":[{"patch":"@@ -519,1 +519,1 @@\n-     * Reads a char from this address and index with given layout.\n+     * Reads a char from this address and index, scaled by given layout size.\n@@ -537,1 +537,1 @@\n-     * Writes a char to this address instance and index with given layout.\n+     * Writes a char to this address instance and index, scaled by given layout size.\n@@ -555,1 +555,1 @@\n-     * Reads a short from this address and index with given layout.\n+     * Reads a short from this address and index, scaled by given layout size.\n@@ -573,1 +573,1 @@\n-     * Writes a short to this address instance and index with given layout.\n+     * Writes a short to this address instance and index, scaled by given layout size.\n@@ -591,1 +591,1 @@\n-     * Reads an int from this address and index with given layout.\n+     * Reads an int from this address and index, scaled by given layout size.\n@@ -609,1 +609,1 @@\n-     * Writes an int to this address instance and index with given layout.\n+     * Writes an int to this address instance and index, scaled by given layout size.\n@@ -627,1 +627,1 @@\n-     * Reads a float from this address and index with given layout.\n+     * Reads a float from this address and index, scaled by given layout size.\n@@ -645,1 +645,1 @@\n-     * Writes a float to this address instance and index with given layout.\n+     * Writes a float to this address instance and index, scaled by given layout size.\n@@ -663,1 +663,1 @@\n-     * Reads a long from this address and index with given layout.\n+     * Reads a long from this address and index, scaled by given layout size.\n@@ -681,1 +681,1 @@\n-     * Writes a long to this address instance and index with given layout.\n+     * Writes a long to this address instance and index, scaled by given layout size.\n@@ -699,1 +699,1 @@\n-     * Reads a double from this address and index with given layout.\n+     * Reads a double from this address and index, scaled by given layout size.\n@@ -717,1 +717,1 @@\n-     * Writes a double to this address instance and index with given layout.\n+     * Writes a double to this address instance and index, scaled by given layout size.\n@@ -735,1 +735,1 @@\n-     * Reads an address from this address and index with given layout.\n+     * Reads an address from this address and index, scaled by given layout size.\n@@ -753,1 +753,1 @@\n-     * Writes an address to this address instance and index with given layout.\n+     * Writes an address to this address instance and index, scaled by given layout size.\n","filename":"src\/jdk.incubator.foreign\/share\/classes\/jdk\/incubator\/foreign\/MemoryAddress.java","additions":14,"deletions":14,"binary":false,"changes":28,"status":"modified"},{"patch":"@@ -1293,1 +1293,1 @@\n-     * Reads a char from this segment and index with given layout.\n+     * Reads a char from this segment and index, scaled by given layout size.\n@@ -1310,1 +1310,1 @@\n-     * Writes a char to this segment and index with given layout.\n+     * Writes a char to this segment and index, scaled by given layout size.\n@@ -1326,1 +1326,1 @@\n-     * Reads a short from this segment and index with given layout.\n+     * Reads a short from this segment and index, scaled by given layout size.\n@@ -1343,1 +1343,1 @@\n-     * Writes a short to this segment and index with given layout.\n+     * Writes a short to this segment and index, scaled by given layout size.\n@@ -1359,1 +1359,1 @@\n-     * Reads an int from this segment and index with given layout.\n+     * Reads an int from this segment and index, scaled by given layout size.\n@@ -1376,1 +1376,1 @@\n-     * Writes an int to this segment and index with given layout.\n+     * Writes an int to this segment and index, scaled by given layout size.\n@@ -1392,1 +1392,1 @@\n-     * Reads a float from this segment and index with given layout.\n+     * Reads a float from this segment and index, scaled by given layout size.\n@@ -1409,1 +1409,1 @@\n-     * Writes a float to this segment and index with given layout.\n+     * Writes a float to this segment and index, scaled by given layout size.\n@@ -1425,1 +1425,1 @@\n-     * Reads a long from this segment and index with given layout.\n+     * Reads a long from this segment and index, scaled by given layout size.\n@@ -1442,1 +1442,1 @@\n-     * Writes a long to this segment and index with given layout.\n+     * Writes a long to this segment and index, scaled by given layout size.\n@@ -1458,1 +1458,1 @@\n-     * Reads a double from this segment and index with given layout.\n+     * Reads a double from this segment and index, scaled by given layout size.\n@@ -1475,1 +1475,1 @@\n-     * Writes a double to this segment and index with given layout.\n+     * Writes a double to this segment and index, scaled by given layout size.\n@@ -1491,1 +1491,1 @@\n-     * Reads an address from this segment and index with given layout.\n+     * Reads an address from this segment and index, scaled by given layout size.\n@@ -1508,1 +1508,1 @@\n-     * Writes an address to this segment and index with given layout.\n+     * Writes an address to this segment and index, scaled by given layout size.\n","filename":"src\/jdk.incubator.foreign\/share\/classes\/jdk\/incubator\/foreign\/MemorySegment.java","additions":14,"deletions":14,"binary":false,"changes":28,"status":"modified"}]}