{"files":[{"patch":"@@ -210,7 +210,16 @@\n-<li><p><code>tier1<\/code>: This is the lowest test tier. Multiple\n-developers run these tests every day. Because of the widespread use, the\n-tests in <code>tier1<\/code> are carefully selected and optimized to run\n-fast, and to run in the most stable manner. The test failures in\n-<code>tier1<\/code> are usually followed up on quickly, either with\n-fixes, or adding relevant tests to problem list. GitHub Actions\n-workflows, if enabled, run <code>tier1<\/code> tests.<\/p><\/li>\n+<li><p><code>tier1<\/code>: This is the most fundamental test tier.\n+Roughly speaking, a failure of a test in this tier has the potential to\n+indicate a problem that would affect many Java programs. Tests in\n+<code>tier1<\/code> include tests of HotSpot, core APIs in the\n+<code>java.base<\/code> module, and the <code>javac<\/code> compiler.\n+Multiple developers run these tests every day. Because of the widespread\n+use, the tests in <code>tier1<\/code> are carefully selected and\n+optimized to run fast, and to run in the most stable manner. As a\n+guideline, nearly all individual tests in <code>tier1<\/code> are\n+expected to run to completion in ten seconds or less when run on common\n+configurations used for development. Long-running tests, even of core\n+functionality, should occur in higher tiers or be covered in other kinds\n+of testing. The test failures in <code>tier1<\/code> are usually followed\n+up on quickly, either with fixes, or adding relevant tests to problem\n+list. GitHub Actions workflows, if enabled, run <code>tier1<\/code>\n+tests.<\/p><\/li>\n","filename":"doc\/testing.html","additions":16,"deletions":7,"binary":false,"changes":23,"status":"modified"},{"patch":"@@ -138,6 +138,15 @@\n-- `tier1`: This is the lowest test tier. Multiple developers run these tests\n-  every day. Because of the widespread use, the tests in `tier1` are\n-  carefully selected and optimized to run fast, and to run in the most stable\n-  manner. The test failures in `tier1` are usually followed up on quickly,\n-  either with fixes, or adding relevant tests to problem list. GitHub Actions\n-  workflows, if enabled, run `tier1` tests.\n+- `tier1`: This is the most fundamental test tier.\n+  Roughly speaking, a failure of a test in this tier has the potential\n+  to indicate a problem that would affect many Java programs. Tests in\n+  `tier1` include tests of HotSpot, core APIs in the `java.base`\n+  module, and the `javac` compiler. Multiple developers run these\n+  tests every day. Because of the widespread use, the tests in `tier1`\n+  are carefully selected and optimized to run fast, and to run in the\n+  most stable manner. As a guideline, nearly all individual tests in\n+  `tier1` are expected to run to completion in ten seconds or less\n+  when run on common configurations used for development. Long-running\n+  tests, even of core functionality, should occur in higher tiers or\n+  be covered in other kinds of testing. The test failures in `tier1`\n+  are usually followed up on quickly, either with fixes, or adding\n+  relevant tests to problem list. GitHub Actions workflows, if\n+  enabled, run `tier1` tests.\n","filename":"doc\/testing.md","additions":15,"deletions":6,"binary":false,"changes":21,"status":"modified"}]}