{"files":[{"patch":"@@ -432,65 +432,0 @@\n-File: aclocal.m4 (only for ICU4C)\n-Section: pkg.m4 - Macros to locate and utilise pkg-config.\n-\n-\n-Copyright © 2004 Scott James Remnant <scott@netsplit.com>.\n-Copyright © 2012-2015 Dan Nicholson <dbn.lists@gmail.com>\n-\n-This program is free software; you can redistribute it and\/or modify\n-it under the terms of the GNU General Public License as published by\n-the Free Software Foundation; either version 2 of the License, or\n-(at your option) any later version.\n-\n-This program is distributed in the hope that it will be useful, but\n-WITHOUT ANY WARRANTY; without even the implied warranty of\n-MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU\n-General Public License for more details.\n-\n-You should have received a copy of the GNU General Public License\n-along with this program; if not, write to the Free Software\n-Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA\n-02111-1307, USA.\n-\n-As a special exception to the GNU General Public License, if you\n-distribute this file as part of a program that contains a\n-configuration script generated by Autoconf, you may include it under\n-the same distribution terms that you use for the rest of that\n-program.\n-\n-\n-(The condition for the exception is fulfilled because\n-ICU4C includes a configuration script generated by Autoconf,\n-namely the `configure` script.)\n-\n-----------------------------------------------------------------------\n-\n-File: config.guess (only for ICU4C)\n-\n-\n-This file is free software; you can redistribute it and\/or modify it\n-under the terms of the GNU General Public License as published by\n-the Free Software Foundation; either version 3 of the License, or\n-(at your option) any later version.\n-\n-This program is distributed in the hope that it will be useful, but\n-WITHOUT ANY WARRANTY; without even the implied warranty of\n-MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU\n-General Public License for more details.\n-\n-You should have received a copy of the GNU General Public License\n-along with this program; if not, see <https:\/\/www.gnu.org\/licenses\/>.\n-\n-As a special exception to the GNU General Public License, if you\n-distribute this file as part of a program that contains a\n-configuration script generated by Autoconf, you may include it under\n-the same distribution terms that you use for the rest of that\n-program.  This Exception is an additional permission under section 7\n-of the GNU General Public License, version 3 (\"GPLv3\").\n-\n-\n-(The condition for the exception is fulfilled because\n-ICU4C includes a configuration script generated by Autoconf,\n-namely the `configure` script.)\n-\n-----------------------------------------------------------------------\n-\n@@ -511,0 +446,37 @@\n+----------------------------------------------------------------------\n+File: selfmt.cpp\n+File: selfmt.h\n+File: selfmtimpl.h\n+File: umsg.h\n+Copyright (c) 1995-2016 International Business Machines Corporation and others\n+All rights reserved.\n+Copyright (C) 2010 , Yahoo! Inc.\n+Permission is hereby granted, free of charge, to any person obtaining\n+a copy of this software and associated documentation files (the\n+\"Software\"), to deal in the Software without restriction, including\n+without limitation the rights to use, copy, modify, merge, publish,\n+distribute, and\/or sell copies of the Software, and to permit persons\n+to whom the Software is furnished to do so, provided that the above\n+copyright notice(s) and this permission notice appear in all copies of\n+the Software and that both the above copyright notice(s) and this\n+permission notice appear in supporting documentation.\n+\n+THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\n+EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n+MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT\n+OF THIRD PARTY RIGHTS. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR\n+HOLDERS INCLUDED IN THIS NOTICE BE LIABLE FOR ANY CLAIM, OR ANY\n+SPECIAL INDIRECT OR CONSEQUENTIAL DAMAGES, OR ANY DAMAGES WHATSOEVER\n+RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF\n+CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN\n+CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.\n+\n+Except as contained in this notice, the name of a copyright holder\n+shall not be used in advertising or otherwise to promote the sale, use\n+or other dealings in this Software without prior written authorization\n+of the copyright holder.\n+\n+All trademarks and registered trademarks mentioned herein are the\n+property of their respective owners.\n+\n+```\n","filename":"modules\/javafx.web\/src\/main\/legal\/icu_web.md","additions":37,"deletions":65,"binary":false,"changes":102,"status":"modified"}]}