{"files":[{"patch":"@@ -79,4 +79,10 @@\n-  \/\/ The default of parallel_region_stride is 4094, which is designed for super light workload,\n-  \/\/ Resetting bitmaps is not really light because it needs to reset chunks of memory for marking bitmaps.\n-  \/\/ For a 31G heap resetting bitmaps could take more than 60ms for single thread, we should use a small\n-  \/\/ parallel region stride for ShenandoahResetBitmapClosure.\n+  \/\/ The default of parallel_region_stride is 0, ShenandoahHeap::parallel_heap_region_iterate will determine\n+  \/\/ the value based on number of regions and active worker threads if regions number is more than 4096.\n+  \/\/ The default behavior is designed for super light workload e.g. ShenandoahInitMarkUpdateRegionStateClosure,\n+  \/\/ which is just few instruction to capture TAMS for each region.\n+  \/\/ Resetting bitmaps is not really lightweight workload because it needs to reset chunks of memory for\n+  \/\/ marking bitmaps, it doesn't need to be done for each region, the default logic can't distribute the task\n+  \/\/ evenly to all active workers.\n+  \/\/ Using a smaller value here yields better task distribution for a lumpy workload. The task will be split\n+  \/\/ into smaller batches with 8 regions in batch, the worker processes more regions w\/o needs to reset bitmaps\n+  \/\/ will process more batches, but overall all workers will be saturated throughout the whole concurrent reset phase.\n","filename":"src\/hotspot\/share\/gc\/shenandoah\/shenandoahGeneration.cpp","additions":10,"deletions":4,"binary":false,"changes":14,"status":"modified"},{"patch":"@@ -116,0 +116,4 @@\n+  \/\/ Default to global value ShenandoahParallelRegionStride, When it is set to 0,\n+  \/\/ ShenandoahHeap::parallel_heap_region_iterate will derive a reasonable value based\n+  \/\/ on active worker threads and number of regions.\n+  \/\/ For some lumpy workload, the value can be overridden for better task distribution.\n","filename":"src\/hotspot\/share\/gc\/shenandoah\/shenandoahHeap.hpp","additions":4,"deletions":0,"binary":false,"changes":4,"status":"modified"}]}