{"files":[{"patch":"@@ -37,1 +37,1 @@\n-On  most platforms, core dumps do not contain text (code) pages.\n+On most platforms, core dumps do not contain text (code) pages.\n@@ -50,1 +50,1 @@\n-<h3>Using  transported core dumps on Linux<\/h3>\n+<h3>Using transported core dumps on Linux<\/h3>\n@@ -70,1 +70,1 @@\n-<h3>Using  transported core dumps on Windows<\/h3>\n+<h3>Using transported core dumps on Windows<\/h3>\n@@ -89,1 +89,1 @@\n-<h3>Using  transported core dumps on macOS<\/h3>\n+<h3>Using transported core dumps on macOS<\/h3>\n@@ -91,1 +91,5 @@\n-SA normally uses the path to the specified java executable to locate the JDK libraries. It will look in the following subdirectories for them (relative to the path to the specified java executable): <b>..\/lib<\/b>, <b>..\/lib\/server<\/b>, <b>..\/jre\/lib<\/b>, and <b>..\/jre\/lib\/server<\/b>. If not found in any of those locations, it will look in the same subdirectories relative to the <b>JAVA_HOME<\/b> environment variable, but using <b>JAVA_HOME<\/b> normally should not be necessary.\n+ SA normally uses the path to the specified java executable to locate the JDK libraries. It will look\n+ in the following subdirectories for them (relative to the path to the specified java executable):\n+ <b>..\/lib<\/b>, <b>..\/lib\/server<\/b>, <b>..\/jre\/lib<\/b>, and <b>..\/jre\/lib\/server<\/b>. If not found\n+ in any of those locations, it will look in the same subdirectories relative to the <b>JAVA_HOME<\/b>\n+ environment variable, but using <b>JAVA_HOME<\/b> normally should not be necessary.\n@@ -95,1 +99,4 @@\n-For locating the user JNI libraries, SA uses <b>DYLD_LIBRARY_PATH<\/b>. It can contain more than one directory separated by a colon. <b>DYLD_LIBRARY_PATH<\/b> can also be used for locating the JDK libraries, but it needs to specify the full path to the libraries. SA will not automatically search subdirs such as <b>lib\/server<\/b> as it does for <b>JAVA_HOME<\/b>.\n+ For locating the user JNI libraries, SA uses <b>DYLD_LIBRARY_PATH<\/b>. It can contain\n+ more than one directory separated by a colon. <b>DYLD_LIBRARY_PATH<\/b> can also be\n+ used for locating the JDK libraries, but it needs to specify the full path to the libraries. SA will\n+ not automatically search subdirs such as <b>lib\/server<\/b> as it does for <b>JAVA_HOME<\/b>.\n@@ -99,1 +106,7 @@\n-For locating the macOS libraries, SA uses <b>SA_ALTROOT<\/b> similar to the linux support, except it does not use it to map all the subdirs. It just appends <b>SA_ALTROOT<\/b> to the full path of each macOS library. So if you specify <b>SA_ALTROOT=\/altroot<\/b>, SA will prepend <b>\/altroot<\/b> to the full path of each macOS library. Note however, due to <a href=\"https:\/\/bugs.openjdk.org\/browse\/JDK-8249779\">JDK-8249779<\/a> , SA will not even try to open macOS libraries, so at the moment there is no need to try to match up the macOS libraries by pointing to them with <b>SA_ALTROOT<\/b>.\n+ For locating the macOS libraries, SA uses <b>SA_ALTROOT<\/b> similar to the linux support,\n+ except it does not use it to map all the subdirs. It just appends <b>SA_ALTROOT<\/b> to the\n+ full path of each macOS library. So if you specify <b>SA_ALTROOT=\/altroot<\/b>, SA will\n+ prepend <b>\/altroot<\/b> to the full path of each macOS library. Note however, due to\n+ <a href=\"https:\/\/bugs.openjdk.org\/browse\/JDK-8249779\">JDK-8249779<\/a> , SA will not\n+ even try to open macOS libraries, so at the moment there is no need to try to match up the\n+ macOS libraries by pointing to them with <b>SA_ALTROOT<\/b>.\n@@ -103,1 +116,2 @@\n-Note: Starting with macOS 12, core files are no longer working with macOS on the x64 platform. See <a href=\"https:\/\/bugs.openjdk.org\/browse\/JDK-8294316\">JDK-8294316<\/a>.\n+ Note: Starting with macOS 12, core files are no longer working with macOS on the x64 platform.\n+ See <a href=\"https:\/\/bugs.openjdk.org\/browse\/JDK-8294316\">JDK-8294316<\/a>.\n","filename":"src\/jdk.hotspot.agent\/doc\/transported_core.html","additions":22,"deletions":8,"binary":false,"changes":30,"status":"modified"}]}