{"files":[{"patch":"@@ -403,1 +403,1 @@\n-<p>On Linux, BSD and AIX, it is possible to override where Java by default searches for runtime\/JNI libraries. This can be useful in situations where there is a special shared directory for system JNI libraries. This setting can in turn be overriden at runtime by setting the <code>java.library.path<\/code> property.<\/p>\n+<p>On Linux, BSD and AIX, it is possible to override where Java by default searches for runtime\/JNI libraries. This can be useful in situations where there is a special shared directory for system JNI libraries. This setting can in turn be overridden at runtime by setting the <code>java.library.path<\/code> property.<\/p>\n@@ -442,1 +442,1 @@\n-<p>However, there are a few <code>configure<\/code> variables, known as <em>control variables<\/em> that are supposed to be overriden on the command line. These are variables that describe the location of tools needed by the build, like <code>MAKE<\/code> or <code>GREP<\/code>. If any such variable is specified, <code>configure<\/code> will use that value instead of trying to autodetect the tool. For instance, <code>bash configure MAKE=\/opt\/gnumake4.0\/bin\/make<\/code>.<\/p>\n+<p>However, there are a few <code>configure<\/code> variables, known as <em>control variables<\/em> that are supposed to be overridden on the command line. These are variables that describe the location of tools needed by the build, like <code>MAKE<\/code> or <code>GREP<\/code>. If any such variable is specified, <code>configure<\/code> will use that value instead of trying to autodetect the tool. For instance, <code>bash configure MAKE=\/opt\/gnumake4.0\/bin\/make<\/code>.<\/p>\n@@ -479,1 +479,1 @@\n-<p>However, there are a few <code>make<\/code> variables, known as <em>control variables<\/em> that are supposed to be overriden on the command line. These make up the &quot;make time&quot; configuration, as opposed to the &quot;configure time&quot; configuration.<\/p>\n+<p>However, there are a few <code>make<\/code> variables, known as <em>control variables<\/em> that are supposed to be overridden on the command line. These make up the &quot;make time&quot; configuration, as opposed to the &quot;configure time&quot; configuration.<\/p>\n","filename":"doc\/building.html","additions":3,"deletions":3,"binary":false,"changes":6,"status":"modified"},{"patch":"@@ -644,1 +644,1 @@\n-can in turn be overriden at runtime by setting the `java.library.path` property.\n+can in turn be overridden at runtime by setting the `java.library.path` property.\n@@ -710,1 +710,1 @@\n-that are supposed to be overriden on the command line. These are variables that\n+that are supposed to be overridden on the command line. These are variables that\n@@ -790,1 +790,1 @@\n-are supposed to be overriden on the command line. These make up the \"make time\"\n+are supposed to be overridden on the command line. These make up the \"make time\"\n","filename":"doc\/building.md","additions":3,"deletions":3,"binary":false,"changes":6,"status":"modified"}]}