{"files":[{"patch":"@@ -2,2 +2,2 @@\n- * Copyright (c) 2021, Oracle and\/or its affiliates. All rights reserved. DO NOT ALTER OR REMOVE\n- * COPYRIGHT NOTICES OR THIS FILE HEADER.\n+ * Copyright (c) 2021, Oracle and\/or its affiliates. All rights reserved.\n+ * DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER.\n@@ -5,2 +5,3 @@\n- * This code is free software; you can redistribute it and\/or modify it under the terms of the GNU\n- * General Public License version 2 only, as published by the Free Software Foundation.\n+ * This code is free software; you can redistribute it and\/or modify it\n+ * under the terms of the GNU General Public License version 2 only, as\n+ * published by the Free Software Foundation.\n@@ -8,3 +9,4 @@\n- * This code is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without\n- * even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU\n- * General Public License version 2 for more details (a copy is included in the LICENSE file that\n+ * This code is distributed in the hope that it will be useful, but WITHOUT\n+ * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\n+ * FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License\n+ * version 2 for more details (a copy is included in the LICENSE file that\n@@ -13,3 +15,3 @@\n- * You should have received a copy of the GNU General Public License version 2 along with this work;\n- * if not, write to the Free Software Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA\n- * 02110-1301 USA.\n+ * You should have received a copy of the GNU General Public License version\n+ * 2 along with this work; if not, write to the Free Software Foundation,\n+ * Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA.\n@@ -17,2 +19,3 @@\n- * Please contact Oracle, 500 Oracle Parkway, Redwood Shores, CA 94065 USA or visit www.oracle.com\n- * if you need additional information or have any questions.\n+ * Please contact Oracle, 500 Oracle Parkway, Redwood Shores, CA 94065 USA\n+ * or visit www.oracle.com if you need additional information or have any\n+ * questions.\n","filename":"test\/jdk\/tools\/launcher\/8261785\/Test8261785.java","additions":15,"deletions":12,"binary":false,"changes":27,"status":"modified"}]}