{"files":[{"patch":"@@ -374,1 +374,1 @@\n-    \/\/ Technically there is need for a ThreadsListHandle since the target\n+    \/\/ Technically there is no need for a ThreadsListHandle since the target\n","filename":"src\/hotspot\/share\/runtime\/handshake.cpp","additions":1,"deletions":1,"binary":false,"changes":2,"status":"modified"},{"patch":"@@ -48,0 +48,1 @@\n+    assert(DoJVMTIVirtualThreadTransitions || !JvmtiExport::can_support_virtual_threads(), \"sanity check\");\n@@ -78,0 +79,1 @@\n+    assert(DoJVMTIVirtualThreadTransitions || !JvmtiExport::can_support_virtual_threads(), \"sanity check\");\n@@ -157,6 +159,6 @@\n-  \/\/ Start of the critical section. We need an acquire fence to prevent future memory\n-  \/\/ operations to be ordered before we read the disabled conditions. But if this is\n-  \/\/ a mount, this is already guaranteed by the fences in VirtualThread.mount which will\n-  \/\/ be executed once we go back to Java. If this is an unmount, the handshake that the\n-  \/\/ disabler executed against this carrier thread already provided the needed synchronization.\n-  \/\/ This matches the release fence in xx_enable_for_one()\/xx_enable_for_all().\n+  \/\/ Start of the critical section. If this is a mount, we need an acquire barrier to\n+  \/\/ synchronize with a possible disabler that executed an operation while this thread\n+  \/\/ was unmounted. We make VirtualThread.mount guarantee such ordering and avoid barriers\n+  \/\/ here. If this is an unmount, the handshake that the disabler executed against this\n+  \/\/ thread already provided the needed synchronization.\n+  \/\/ This pairs with the release barrier in xx_enable_for_one()\/xx_enable_for_all().\n@@ -171,8 +173,8 @@\n-  \/\/ End of the critical section. We need a release fence here to prevent previous memory\n-  \/\/ operations to be ordered after we mark the thread as outside transition. But if this\n-  \/\/ is an unmount, this is already guaranteed by the fences previously executed in\n-  \/\/ VirtualThread.unmount. If this is a mount, the only thing that needs to be ordered is\n-  \/\/ the setting of carrierThread, since the handshake that the disabler will execute against\n-  \/\/ the carrier thread will already provide the needed synchronization. This order is already\n-  \/\/ guaranteed by the fences in VirtualThread.mount.\n-  \/\/ This matches the acquire fence in xx_disable_for_one()\/xx_disable_for_all().\n+  \/\/ End of the critical section. If this is an unmount, we need a release barrier before\n+  \/\/ clearing the in_transition flags to make sure any memory operations executed in the\n+  \/\/ transition are visible to a possible disabler that executes while this thread is unmounted.\n+  \/\/ We make VirtualThread.unmount guarantee such ordering and avoid barriers here. If this is\n+  \/\/ a mount, the only thing that needs to be published is the setting of carrierThread, since\n+  \/\/ the handshake that the disabler will execute against it already provides the needed\n+  \/\/ synchronization. This order is already guaranteed by the barriers in VirtualThread.mount.\n+  \/\/ This pairs with the acquire barrier in xx_disable_for_one()\/xx_disable_for_all().\n@@ -276,3 +278,6 @@\n-  \/\/ Start of the critical region. Prevent future memory\n-  \/\/ operations to be ordered before we read the transition flag.\n-  \/\/ This matches the release fence in end_transition().\n+  \/\/ Start of the critical section. If the target is unmounted, we need an acquire\n+  \/\/ barrier to make sure memory operations executed in the last transition are visible.\n+  \/\/ If the target is mounted, although the handshake that will be executed against it\n+  \/\/ already provides the needed synchronization, we still need to prevent the load of\n+  \/\/ carrierThread to float up.\n+  \/\/ This pairs with the release barrier in end_transition().\n@@ -313,3 +318,6 @@\n-  \/\/ Start of the critical region. Prevent future memory\n-  \/\/ operations to be ordered before we read the transition flags.\n-  \/\/ This matches the release fence in end_transition().\n+  \/\/ Start of the critical section. If some target is unmounted, we need an acquire\n+  \/\/ barrier to make sure memory operations executed in the last transition are visible.\n+  \/\/ If a target is mounted, although the handshake that will be executed against it\n+  \/\/ already provides the needed synchronization, we still need to prevent the load of\n+  \/\/ carrierThread to float up.\n+  \/\/ This pairs with the release barrier in end_transition().\n@@ -325,3 +333,6 @@\n-  \/\/ End of the critical section. Prevent previous memory operations to\n-  \/\/ be ordered after we clear the clear the disable transition flag.\n-  \/\/ This matches the equivalent acquire fence in start_transition().\n+  \/\/ End of the critical section. If the target was unmounted, we need a\n+  \/\/ release barrier before decrementing _VTMS_transition_disable_count to\n+  \/\/ make sure any memory operations executed by the disabler are visible to\n+  \/\/ the target once it mounts again. If the target was mounted, the handshake\n+  \/\/ executed against it already provided the needed synchronization.\n+  \/\/ This pairs with the equivalent acquire barrier in start_transition().\n@@ -344,3 +355,6 @@\n-  \/\/ End of the critical section. Prevent previous memory operations to\n-  \/\/ be ordered after we clear the clear the disable transition flag.\n-  \/\/ This matches the equivalent acquire fence in start_transition().\n+  \/\/ End of the critical section. If some target was unmounted, we need a\n+  \/\/ release barrier before decrementing _global_start_transition_disable_count\n+  \/\/ to make sure any memory operations executed by the disabler are visible to\n+  \/\/ the target once it mounts again. If a target was mounted, the handshake\n+  \/\/ executed against it already provided the needed synchronization.\n+  \/\/ This pairs with the equivalent acquire barrier in start_transition().\n","filename":"src\/hotspot\/share\/runtime\/mountUnmountDisabler.cpp","additions":40,"deletions":26,"binary":false,"changes":66,"status":"modified"},{"patch":"@@ -50,1 +50,0 @@\n-  \/\/ parameter is_SR: suspender or resumer\n","filename":"src\/hotspot\/share\/runtime\/mountUnmountDisabler.hpp","additions":0,"deletions":1,"binary":false,"changes":1,"status":"modified"},{"patch":"@@ -483,0 +483,2 @@\n+        \/\/ We assume following volatile accesses provide equivalent\n+        \/\/ of acquire ordering, otherwise we need U.loadFence() here.\n@@ -523,0 +525,2 @@\n+        \/\/ We assume previous volatile accesses provide equivalent\n+        \/\/ of release ordering, otherwise we need U.storeFence() here.\n","filename":"src\/java.base\/share\/classes\/java\/lang\/VirtualThread.java","additions":4,"deletions":0,"binary":false,"changes":4,"status":"modified"}]}