{"files":[{"patch":"@@ -36,1 +36,1 @@\n-\/\/ G1BatchedGangTask running on a single thread (\"serially\") or multiple threads\n+\/\/ G1BatchedGangTask running on a single worker (\"serially\") or multiple workers\n@@ -40,0 +40,9 @@\n+\/\/ A \"serial\" task is some piece of work that either can not be parallelized\n+\/\/ easily, or is typically so short that parallelization is not worth the effort.\n+\/\/ Current examples would be summarizing per worker thread information gathered\n+\/\/ during garbage collection (e.g. Merge PSS work).\n+\/\/\n+\/\/ A \"parallel\" task could be some large amount of work that typically naturally\n+\/\/ splits across the heap in some way. Current examples would be clearing the\n+\/\/ card table \n+\/\/\n@@ -54,1 +63,1 @@\n-  \/\/ How many worker (threads) would this task be able to keep busy for at least\n+  \/\/ How many workers (threads) would this task be able to keep busy for at least\n@@ -63,1 +72,1 @@\n-  \/\/ Perform the actual work.\n+  \/\/ Perform the actual work. Gets the worker id it is run on passed in.\n@@ -68,1 +77,1 @@\n-  \/\/ Human readable name.\n+  \/\/ Human readable name derived from the tag.\n@@ -77,2 +86,4 @@\n-\/\/ tasks are executed by a single thread only exactly once, while \"parallel\"\n-\/\/ tasks may be executed by different workers, at most once per given worker id.\n+\/\/ tasks are executed by a single worker only exactly once, but different \"serial\"\n+\/\/ tasks may be executed in parallel using different workers. \"Parallel\" tasks'\n+\/\/ do_work() method may be called by different workers passing a different\n+\/\/ worker_id at the same time, but at most once per given worker id.\n@@ -85,2 +96,2 @@\n-\/\/ The current framework assumes that constructors and destructors of the\n-\/\/ G1AbstractSubTasks are executed in the constructor\/destructor of an instance\n+\/\/ The current implementation assumes that constructors and destructors of the\n+\/\/ G1AbstractSubTasks can executed in the constructor\/destructor of an instance\n","filename":"src\/hotspot\/share\/gc\/g1\/g1BatchedGangTask.hpp","additions":19,"deletions":8,"binary":false,"changes":27,"status":"modified"}]}