[{"commit":{"message":"8263512: [macos_aarch64] issues with calling va_args functions from invoke_native\n\nmacOS on Apple silicon uses slightly different ABI conventions to the\nstandard AArch64 ABI.  The differences are outlined in [1].  In\nparticular in the standard (AAPCS) ABI, variadic arguments may be passed\nin either registers or on the stack following the normal calling\nconvention.  To handle this, va_list is a struct containing separate\npointers for arguments located in integer registers, floating point\nregisters, and on the stack.  Apple's ABI simplifies this by passing all\nvariadic arguments on the stack and the va_list type becomes a simple\nchar* pointer.\n\nThis patch adds a new MacOsAArch64 CABI type and MacOsAArch64Linker to\nrepresent the new ABI variant on macOS.  StackVaList is based on\nWinVaList lightly modified to handle the different TypeClasses on\nAArch64.  The original AArch64Linker is renamed to AapcsLinker and is\ncurrently used for all non-Mac platforms.  I think we also need to add a\nWinAArch64 CABI but I haven't yet been able to test on a Windows system\nso will do that later.\n\nThe macOS ABI also uses a different method of spilling arguments to the\nstack (the standard ABI pads each argument to a multiple of 8 byte stack\nslots, but the Mac ABI packs arguments according to their natural\nalignment).  None of the existing tests exercise this so I'll open a new\nJBS issue and work on that separately.\n\nTested jdk_foreign on macOS AArch64, Linux AArch64, and Linux X86_64."},"files":[{"filename":"src\/jdk.incubator.foreign\/share\/classes\/jdk\/internal\/foreign\/CABI.java"},{"filename":"src\/jdk.incubator.foreign\/share\/classes\/jdk\/internal\/foreign\/PlatformLayouts.java"},{"filename":"src\/jdk.incubator.foreign\/share\/classes\/jdk\/internal\/foreign\/abi\/SharedUtils.java"},{"filename":"src\/jdk.incubator.foreign\/share\/classes\/jdk\/internal\/foreign\/abi\/aarch64\/AArch64Linker.java"},{"filename":"src\/jdk.incubator.foreign\/share\/classes\/jdk\/internal\/foreign\/abi\/aarch64\/CallArranger.java"},{"filename":"src\/jdk.incubator.foreign\/share\/classes\/jdk\/internal\/foreign\/abi\/aarch64\/TypeClass.java"},{"filename":"src\/jdk.incubator.foreign\/share\/classes\/jdk\/internal\/foreign\/abi\/aarch64\/aapcs\/AapcsLinker.java"},{"filename":"src\/jdk.incubator.foreign\/share\/classes\/jdk\/internal\/foreign\/abi\/aarch64\/aapcs\/AapcsVaList.java"},{"filename":"src\/jdk.incubator.foreign\/share\/classes\/jdk\/internal\/foreign\/abi\/aarch64\/macos\/MacOsAArch64Linker.java"},{"filename":"src\/jdk.incubator.foreign\/share\/classes\/jdk\/internal\/foreign\/abi\/aarch64\/macos\/StackVaList.java"},{"filename":"test\/jdk\/ProblemList.txt"},{"filename":"test\/jdk\/java\/foreign\/valist\/VaListTest.java"}],"sha":"8b94e8f807ee99060cb9dd0182fb91785958b635"}]