{"files":[{"patch":"@@ -11299,1 +11299,1 @@\n-     * Returns the Unicode name of the specified character\n+     * Returns the name of the specified character\n@@ -11302,2 +11302,2 @@\n-     * <p>\n-     * Note: if the specified character is not assigned a name by\n+     *\n+     * @apiNote If the specified character is not assigned a name by\n@@ -11306,1 +11306,1 @@\n-     * name is the same as the result of expression:\n+     * name is the same as the result of the expression:\n@@ -11315,0 +11315,6 @@\n+     * For the {@code codePoint}s in the <i>UnicodeData<\/i> file, the name\n+     * returned by this method follows the naming scheme in the\n+     * \"Unicode Name Property\" section of the Unicode Standard. For other\n+     * code points, such as Hangul\/Ideographs, The name generation rule above\n+     * differs from the one defined in the Unicode Standard.\n+     *\n@@ -11317,1 +11323,1 @@\n-     * @return the Unicode name of the specified character, or null if\n+     * @return the name of the specified character, or null if\n@@ -11346,3 +11352,3 @@\n-     * the given Unicode character name.\n-     * <p>\n-     * Note: if a character is not assigned a name by the <i>UnicodeData<\/i>\n+     * the given character name.\n+     *\n+     * @apiNote If a character is not assigned a name by the <i>UnicodeData<\/i>\n@@ -11350,1 +11356,1 @@\n-     * Consortium), its name is defined as the result of expression:\n+     * Consortium), its name is defined as the result of the expression:\n@@ -11362,1 +11368,7 @@\n-     * @param  name the Unicode character name\n+     * For the code points in the <i>UnicodeData<\/i> file, this method\n+     * recognizes the name which conforms to the name defined in the\n+     * \"Unicode Name Property\" section in the Unicode Standard. For other\n+     * code points, this method recognizes the name generated with\n+     * {@link #getName(int)} method.\n+     *\n+     * @param  name the character name\n@@ -11367,1 +11379,1 @@\n-     *         is not a valid Unicode character name.\n+     *         is not a valid character name.\n","filename":"src\/java.base\/share\/classes\/java\/lang\/Character.java","additions":23,"deletions":11,"binary":false,"changes":34,"status":"modified"}]}