{"files":[{"patch":"@@ -5,1 +5,1 @@\n-To Sponsor a change there are a number of things you should do.\n+There are many different reasons to sponsor a change and depending on the situation the exact steps involved may differ significantly. A developer hired into a larger team of experienced OpenJDK developers is likely to get the required information in new hire training or similar and will likely need less help from a sponsor than the entusiast sitting at home with no prior experience of large scale software development. This text aims to highlight the steps involved in sponsoring a change but can't cover all possible scenarios. As always, common sense takes precedence where the assumptions made here doesn't apply to your use case.\n@@ -15,1 +15,1 @@\n-Opportunities to sponsor contributions occur in the OpenJDK mail lists. Since Contributors are encouraged to discuss their intended changes before they submit a patch, the ideal time to declare your sponsorship is during that initial conversation. As a Sponsor you should offer advice and collaborate with the contributor as necessary to produce a high-quality patch. In addition to sponsoring changes to code you regularly maintain, there may be other areas where you can serve as a Sponsor.\n+Opportunities to sponsor contributions can occur in the OpenJDK mail lists. Since Contributors are encouraged to discuss their intended changes before they submit a patch, the ideal time to declare your sponsorship is during that initial conversation. As a Sponsor you should offer advice and collaborate with the contributor as necessary to produce a high-quality patch. In addition to sponsoring changes to code you regularly maintain, there may be other areas where you can serve as a Sponsor.\n@@ -17,1 +17,1 @@\n-After publicly committing to sponsoring a contribution, you need to \"claim the sponsorship request\" in [JBS](#jbs---jdk-bug-system). To do that you need to perform three steps:\n+After publicly committing to sponsoring a contribution, you need to \"claim the sponsorship request\" in [JBS](#jbs---jdk-bug-system) unless the Contributor already has a JBS account and can assign the bug to themself. To do that you need to perform three steps:\n@@ -21,1 +21,1 @@\n-* and finally set the bug's status to \"In Progress\".\n+* and finally set the bug's [Status]{.jbs-field} to `In Progress`.\n","filename":"src\/guide\/sponsoring-a-change.md","additions":4,"deletions":4,"binary":false,"changes":8,"status":"modified"},{"patch":"@@ -4,0 +4,1 @@\n+sponsoring-a-change.md\n@@ -12,1 +13,0 @@\n-sponsoring-a-change.md\n","filename":"src\/toc.conf","additions":1,"deletions":1,"binary":false,"changes":2,"status":"modified"}]}