{"files":[{"patch":"@@ -236,11 +236,0 @@\n-\/\/ Given a card_index, return the starting address of the first object in the heap\n-\/\/ that intersects with this card. This must be a valid, parsable object, and must\n-\/\/ be the first such object that intersects with this card. The object may start before,\n-\/\/ at, or after the start of the card, and may end in or after the card. If no\n-\/\/ such object exists, a null value is returned.\n-\/\/ Expects to be called for a card in an region affiliated with the old generation in\n-\/\/ generational heap, otherwise behavior is undefined.\n-\/\/ If not null, ctx holds the complete marking context of the old generation. If null,\n-\/\/ we expect that the marking context isn't available and the crossing maps are valid.\n-\/\/ Note that crossing maps may be invalid following class unloading and before dead\n-\/\/ or unloaded objects have been coalesced and filled (updating the crossing maps).\n@@ -262,1 +251,3 @@\n-  \/\/ intersects with this card, and if no such object exists, we return null\n+  \/\/ intersects with this card.  If no such object exists, we return the first marked object that follows the start\n+  \/\/ of this card's memory range if such an object is found at or before last_relevant_card_index.  If there are no\n+  \/\/ marked objects in this range, we return nullptr.\n@@ -285,1 +276,1 @@\n-    \/\/ In eiher case, find the next marked object if any on this card\n+    \/\/ In eiher case, find the next marked object if any on this or a following card\n@@ -287,1 +278,1 @@\n-    HeapWord* right = MIN2(region->top(), ctx->top_at_mark_start(region));\n+    HeapWord* right = MIN2(region->top(), tams);\n@@ -294,0 +285,3 @@\n+      return next;\n+    } else {\n+      return nullptr;\n@@ -296,2 +290,0 @@\n-    \/\/ Note: returned value may point beyond this card's range of memory, and may not point to an allocated object.\n-    return next;\n@@ -320,1 +312,1 @@\n-  assert(cur_index >= 0 && (cur_index <= (ssize_t)card_index), \"Error\");\n+  assert(cur_index >= 0 && (cur_index <= (ssize_t) card_index), \"Error\");\n","filename":"src\/hotspot\/share\/gc\/shenandoah\/shenandoahScanRemembered.cpp","additions":9,"deletions":17,"binary":false,"changes":26,"status":"modified"},{"patch":"@@ -655,2 +655,2 @@\n-  \/\/ Given a card_index, return the starting address of the first object in the heap\n-  \/\/ that intersects with this card. This must be a valid, parsable object, and must\n+  \/\/ Given a card_index, return the starting address of the first live object in the heap\n+  \/\/ that intersects with or follows this card. This must be a valid, parsable object, and must\n@@ -658,3 +658,15 @@\n-  \/\/ at, or after the start of the card, and may end in or after the card. If no\n-  \/\/ such object exists, a null value is returned.\n-  \/\/ Expects to be called for a card in an region affiliated with the old generation in\n+  \/\/ at, or after the start of the card identified by card_index, and may end in or after the card.\n+  \/\/\n+  \/\/ The tams argument represents top for the enclosing region at the start of the most recently\n+  \/\/ initiated concurrent old marking effort.  If ctx is non-null, we use the marking context to identify\n+  \/\/ marked objects below tams.  Above tams, we know that every object is marked and that the memory is\n+  \/\/ parsable (so we can add an object's size to its address to find the next object).  If ctx is null,\n+  \/\/ we use crossing maps to find where object's start, and use object sizes to walk individual objects.\n+  \/\/ The region must be parsable if ctx is null.\n+  \/\/\n+  \/\/ The last_relevant_card_index represents an upper bound on how far we look in the forward direction\n+  \/\/ for the first object in the heap that intersects or follows this card.  If there are no live objects\n+  \/\/ found within the range of cards identified by [card_index, last_relevant_card_index], this function\n+  \/\/ returns nullptr.\n+  \/\/\n+  \/\/ Expects to be called for a card in a region affiliated with the old generation of the\n@@ -662,0 +674,1 @@\n+  \/\/\n@@ -665,1 +678,1 @@\n-  \/\/ or unloaded objects have been coalesced and filled (updating the crossing maps).\n+  \/\/ or unloaded objects have been coalesced and filled.  Coalesce and fill updates the crossing maps.\n","filename":"src\/hotspot\/share\/gc\/shenandoah\/shenandoahScanRemembered.hpp","additions":19,"deletions":6,"binary":false,"changes":25,"status":"modified"},{"patch":"@@ -178,1 +178,2 @@\n-      if ((p == nullptr) || (p >= right)) {\n+      assert((p == nullptr) || (p < right), \"No first object found is denoted by nullptr\");\n+      if (p == nullptr) {\n","filename":"src\/hotspot\/share\/gc\/shenandoah\/shenandoahScanRemembered.inline.hpp","additions":2,"deletions":1,"binary":false,"changes":3,"status":"modified"}]}