{"files":[{"patch":"@@ -2418,1 +2418,1 @@\n-        \/\/ test97(), we speculatively assume that Object[] is exact and emit such a check with an uncommont trap before\n+        \/\/ test97(), we speculatively assume that Object[] is exact and emit such a check with an uncommon trap before\n@@ -2420,1 +2420,1 @@\n-        \/\/ feeding into the array store subtype check.\n+        \/\/ feeding into the array store sub type check.\n@@ -2422,6 +2422,7 @@\n-        \/\/ With the default IR framework warm-up, we will profile the ArrayStoreException already in the interpreter and\n-        \/\/ pass it in the MDO to the C2 compiler (see InterpreterRuntime::create_klass_exception). As a result, C2 is\n-        \/\/ not able to speculatively cast the array of type Object[] to an exact type before the first subtype check\n-        \/\/ because we've seen too many traps being taken at that bci due to the ArrayStoreException that was hit at the\n-        \/\/ very same bci (see Compile::too_many_traps() which checks that zero traps have been taken  so far). Thus,\n-        \/\/ the second subtype check for the value class cannot be removed either.\n+        \/\/ With the default IR framework warm-up, we will profile the ArrayStoreException in the interpreter and\n+        \/\/ pass it in the MDO to the C2 compiler which treat these exceptions as traps being hit (see\n+        \/\/ InterpreterRuntime::create_klass_exception). As a result, C2 is not able to speculatively cast the array of\n+        \/\/ type Object[] to an exact type before the first sub type check because we've seen too many traps being taken\n+        \/\/ at that bci due to the ArrayStoreException that was hit at the very same bci (see Compile::too_many_traps()\n+        \/\/ which checks that zero traps have been taken  so far). Thus, neither the first sub type check for the array\n+        \/\/ check cast nor the second sub type check for the instanceof can be removed.\n","filename":"test\/hotspot\/jtreg\/compiler\/valhalla\/inlinetypes\/TestArrays.java","additions":9,"deletions":8,"binary":false,"changes":17,"status":"modified"}]}