{"files":[{"patch":"@@ -103,1 +103,4 @@\n-    \/\/ when we try to cancel remembered set scanning\n+    \/\/ when we try to cancel remembered set scanning; it should be re-enabled\n+    \/\/ after the issues are fixed, as it would allow more prompt cancellation and\n+    \/\/ transition to degenerated \/ full GCs. Note that work that has been assigned\/\n+    \/\/ claimed above must be completed before we return here upon cancellation.\n","filename":"src\/hotspot\/share\/gc\/shenandoah\/shenandoahScanRemembered.cpp","additions":4,"deletions":1,"binary":false,"changes":5,"status":"modified"},{"patch":"@@ -52,5 +52,3 @@\n-\/\/               TODO CHECK AND CORRECT THIS, IT SEEMS WISHY-WASHY: ysr\n-\/\/               To allow better balancing of work among parallel workers, especially\n-\/\/               in the absence of cluster claiming, it is advisable for the multiple\n-\/\/               worker threads to be flexible in the number of clusters to be\n-\/\/               processed by each thread.\n+\/\/               To better balance work amongst them, parallel worker threads dynamically\n+\/\/               claim clusters and are flexible in the number of clusters they\n+\/\/               process.\n@@ -320,1 +318,0 @@\n-\/\/     (why? Are offsets of a field in an object that expensive to determine?).\n@@ -323,6 +320,4 @@\n-\/\/     which the object's header lies. However, GC workers then precisley dirty the\n-\/\/     cards in the body of this object, thus making the subsequent scans potentially\n-\/\/     less expensive. This is achieved by means of marking the card \"younger-gen-val\",\n-\/\/     indicating the presence of an intergenerational pointer on the card on which the\n-\/\/     intergenerational pointer is found. GC threads always maintain this value\n-\/\/     in preference to \"dirty-card-val\" for cards with intergenerational pointers.\n+\/\/     which the object's header lies. (However, GC workers should precisely dirty the\n+\/\/     cards with inter-regional\/inter-generational pointers in the body of this object,\n+\/\/     thus making subsequent scans potentially less expensive.) Such larger non-array\n+\/\/     objects are relatively rare.\n","filename":"src\/hotspot\/share\/gc\/shenandoah\/shenandoahScanRemembered.hpp","additions":7,"deletions":12,"binary":false,"changes":19,"status":"modified"}]}