{"files":[{"patch":"@@ -69,0 +69,4 @@\n+::: {.box}\n+[To the top](#){.boxheader}\n+:::\n+\n@@ -143,0 +147,4 @@\n+::: {.box}\n+[To the top](#){.boxheader}\n+:::\n+\n@@ -189,0 +197,4 @@\n+::: {.box}\n+[To the top](#){.boxheader}\n+:::\n+\n@@ -198,0 +210,4 @@\n+::: {.box}\n+[To the top](#){.boxheader}\n+:::\n+\n@@ -250,1 +266,1 @@\n-> In this example a fix was pushed to JDK N (a.k.a. the current release) while the JBS bug was targeted to JDK N+1 (a.k.a. a future release). The same procedure can be used in the opposite situation, when a fix has been pushed to JDK N+1 when the JBS bug was targeted to JDK N, by switching N and N+1 below. Remember, to keep the record clean for the future what maters the most is that the bug id used in the commit comment is the main bug, and that the \"backports\" (regardless of if they are to earlier or later releases) are Backport type issues of that main issue.\n+> In this example a fix was pushed to JDK N (a.k.a. the current release) while the JBS bug was targeted to JDK N+1 (a.k.a. a future release). The same procedure can be used in the opposite situation, when a fix has been pushed to JDK N+1 when the JBS bug was targeted to JDK N, by switching N and N+1 below. Remember, to keep the record clean for the future, what maters the most is that the bug id used in the commit comment is the main bug, and that the \"backports\" (regardless of if they are to earlier or later releases) are Backport type issues of that main issue.\n@@ -768,0 +784,4 @@\n+::: {.box}\n+[To the top](#){.boxheader}\n+:::\n+\n@@ -885,0 +905,4 @@\n+::: {.box}\n+[To the top](#){.boxheader}\n+:::\n+\n@@ -982,0 +1006,4 @@\n+::: {.box}\n+[To the top](#){.boxheader}\n+:::\n+\n@@ -1062,0 +1090,4 @@\n+::: {.box}\n+[To the top](#){.boxheader}\n+:::\n+\n@@ -1405,0 +1437,4 @@\n+::: {.box}\n+[To the top](#){.boxheader}\n+:::\n+\n@@ -1430,0 +1466,11 @@\n+::: {style=\"text-align:center;\"}\n+~~~{.mermaid caption=\"Example of backport hierarchy\" format=svg theme=neutral}\n+graph TD\n+  main(JDK-8272373)\n+  backport1(JDK-8277498)\n+  backport2(JDK-8277499)\n+  main --> |backport| backport1\n+  main --> |backport| backport2\n+~~~\n+:::\n+\n@@ -1448,0 +1495,4 @@\n+::: {.box}\n+[To the top](#){.boxheader}\n+:::\n+\n@@ -1482,0 +1533,4 @@\n+::: {.box}\n+[To the top](#){.boxheader}\n+:::\n+\n@@ -1788,0 +1843,4 @@\n+::: {.box}\n+[To the top](#){.boxheader}\n+:::\n+\n@@ -1811,1 +1870,1 @@\n-:    Since development is always ongoing in the mainline repository ([openjdk\/jdk](https:\/\/github.com\/openjdk\/jdk)), the start of a new release can be said to be when the former release is forked from the mainline. After the start of the release follows six months of development to implement and integrate all the cool stuff that will go into the next release. After these six months ramp down begins.\n+:    Since development is always ongoing in the mainline repository ([openjdk\/jdk](https:\/\/github.com\/openjdk\/jdk)), the start of a new release can be said to be when the former release is forked from mainline. After the start of the release follows six months of development to implement and integrate all the cool stuff that will go into the next release. After these six months ramp down begins.\n@@ -1838,1 +1897,1 @@\n-All fixes that are pushed to the stabilization fork are forward ported to mainline. If you have a fix that is only intended for the stabilization fork you will have to manually back it out from mainline once it has been forward ported. In order to remember to do this you should file a backout isue in JBS before pushing your change to the stabilization fork. E.g., To push JDK-xxx to the stabilization fork but not to the mainline, you need to file an issue, JDK-yyy, in JBS to back out the fix after it has been merged into the mainline. Make sure the two JBS issues (JDK-xxx and JDK-yyy) are related so that it's easy to find one from the other.\n+_All_ fixes that are pushed to the stabilization fork are forward ported to mainline. If you have a fix that is only intended for the stabilization fork you will have to **manually** back it out from mainline once it has been forward ported. In order to remember to do this you should file a backout isue in JBS before pushing your change to the stabilization fork. E.g., To push JDK-xxx to the stabilization fork but not to mainline, you need to file an issue, JDK-yyy, in JBS to back out the fix after it has been merged into mainline. Make sure the two JBS issues (JDK-xxx and JDK-yyy) are related so that it's easy to find one from the other.\n@@ -1840,1 +1899,1 @@\n-To clarify, as soon as you know that there is a fix that needs to go into the stabilization fork but not the mainline, you should do the following:\n+To clarify, as soon as you know that there is a fix that needs to go into the stabilization fork but not mainline, you should do the following:\n@@ -1844,1 +1903,1 @@\n-* Set JDK-yyy's Fix Version to the next release\n+* Set JDK-yyy's Fix Version to the release currently being developed in mainline\n@@ -1848,1 +1907,1 @@\n-Then, you have to wait until the JDK-xxx fix is forward ported to the mainline before actually fixing JDK-yyy. Making these settings in JDK-yyy will help ensure that it won't be missed.\n+Then, you have to wait until the JDK-xxx fix is forward ported to mainline before actually fixing JDK-yyy. Making these settings in JDK-yyy will help ensure that it won't be missed.\n@@ -1850,1 +1909,5 @@\n-There are also examples in JBS where JDK-yyy has been created as a sub-task of JDK-xxx. This works but is not recommended since JDK-yyy stands a higher risk of being missed when it's not of type *Bug* but rather a *sub-task* of an already closed issue. Also see [Backing out a change](#backing-out-a-change) for reference.\n+There are also examples in JBS where JDK-yyy has been created as a sub-task of JDK-xxx. This works, but is not recommended since JDK-yyy stands a higher risk of being missed when it's not of type *Bug* but rather a *sub-task* of an already closed issue. Also see [Backing out a change](#backing-out-a-change) for reference.\n+\n+::: {.box}\n+[To the top](#){.boxheader}\n+:::\n@@ -2050,0 +2113,4 @@\n+::: {.box}\n+[To the top](#){.boxheader}\n+:::\n+\n@@ -2090,0 +2157,4 @@\n+\n+::: {.box}\n+[To the top](#){.boxheader}\n+:::\n","filename":"src\/index.md","additions":78,"deletions":7,"binary":false,"changes":85,"status":"modified"}]}