{"files":[{"patch":"@@ -27,1 +27,1 @@\n-version=jfx24\n+version=jfx24.0.1\n","filename":".jcheck\/conf","additions":1,"deletions":1,"binary":false,"changes":2,"status":"modified"},{"patch":"@@ -1,2 +1,2 @@\n-Contributing to OpenJFX\n-=======================\n+Contributing to OpenJFX 24 Updates\n+==================================\n@@ -4,1 +4,1 @@\n-OpenJFX is an open source project and we love to receive contributions from our community &mdash; you! There are many ways to contribute, from improving the documentation, submitting bug reports and feature requests, or writing code which can be incorporated into OpenJFX itself.\n+The OpenJFX 24 Updates repository is _not_ accepting new contributions. If you are looking to contribute to OpenJFX, please visit [openjdk\/jfx](https:\/\/github.com\/openjdk\/jfx) instead.\n@@ -6,2 +6,1 @@\n-Bug reports\n------------\n+Important bug fixes that have already been fixed in the mainline can be backported with prior approval. New fixes should first go into the mainline, and then can be considered for backporting. Approval from one of the project leads is required prior to creating the PR or integrating the fix.\n@@ -9,1 +8,1 @@\n-If you think you have found a bug in OpenJFX, first make sure that you are testing against the latest version - your issue may already have been fixed. If not, search our [issues list](https:\/\/bugs.openjdk.org\/issues\/?filter=39543) in the Java Bug System (JBS) in case a similar issue has already been opened. More information on where and how to report a bug can be found at [bugreport.java.com](https:\/\/bugreport.java.com\/).\n+To backport a fix, import the patch from the jfx mainline into a branch of your personal fork of this repo. Then, create a [Backport Pull Request](https:\/\/wiki.openjdk.org\/display\/SKARA\/Backports#Backports-BackportPullRequests), by creating the PR with the title:\n@@ -11,237 +10,0 @@\n-It is very helpful if you can prepare a reproduction of the bug. In other words, provide a small test case which we can run to confirm your bug. It makes it easier to find the problem and to fix it.\n-\n-Provide as much information as you can. The easier it is for us to recreate your problem, the faster it is likely to be fixed.\n-\n-Feature requests\n-----------------\n-\n-If you find yourself wishing for a feature that doesn't exist in OpenJFX, you are probably not alone. There are bound to be others out there with similar needs. Many of the features that OpenJFX has today have been added because our users saw the need. Please be aware that\n-all new feature requests, including any API changes, need prior discussion on the [openjfx-dev](https:\/\/mail.openjdk.org\/mailman\/listinfo\/openjfx-dev) mailing list, even if there is already an open\n-[JBS issue](https:\/\/bugs.openjdk.org). See the [New features \/ API additions](#new-features--api-additions) section below for more information.\n-\n-Contributing code and documentation changes\n--------------------------------------------\n-\n-If you have a bug fix or new feature that you would like to contribute to OpenJFX, please talk about what you would like to do on the [openjfx-dev](https:\/\/mail.openjdk.org\/mailman\/listinfo\/openjfx-dev) mailing list. It may be that somebody is already working on it, or that there are particular issues that you should know about before implementing the change.\n-\n-We enjoy working with contributors to get their code accepted. There are many approaches to fixing a problem and it is important to find the best approach before writing too much code.\n-\n-Note that it is unlikely the project will merge refactors for the sake of refactoring. These\n-types of pull requests have a high cost to maintainers in reviewing and testing with little\n-to no tangible benefit. This especially includes changes generated by tools. For example,\n-converting all generic interface instances to use the diamond operator.\n-\n-### Fork and clone the repository\n-\n-Once you have created a bug report or confirmed its existence on JBS, you will need to fork the [repository](https:\/\/github.com\/openjdk\/jfx) and clone it to your local machine. See\n-the [GitHub help page](https:\/\/help.github.com\/articles\/fork-a-repo) for help.\n-\n-### Before submitting a pull request\n-\n-If you are a first time contributor to OpenJFX, welcome! Please do the following before you submit your first pull request:\n-\n-* Sign the Contributor Agreement\n-\n-    In order for us to evaluate your contribution, you need to sign the [Oracle Contributor Agreement](https:\/\/oca.opensource.oracle.com\/) (OCA). We are not asking you to give up your copyright, but to give us the right to distribute your code without restriction. By doing this you assert that the code you contribute is *yours* to contribute, and not third-party code that you do not own. We ask this of all contributors in order to assure our users of the origin and continuing existence of the code. You only need to sign the OCA once.\n-\n-* Read the code review policies\n-\n-    Please read the entire section below on how to submit a pull request, as well as the [Code Review Policies](README-code-reviews.md) page. If this is a feature request, please note the additional requirements and expectations in the [New features \/ API additions](#new-features--api-additions) section at the end of this guide.\n-\n-* File a bug in JBS for every pull request\n-\n-    A unique [JBS](https:\/\/bugs.openjdk.org) bug ID is needed for every\n-    pull request. If there isn't already a bug filed in JBS, then please\n-    file one at [bugreport.java.com](https:\/\/bugreport.java.com\/).\n-    A developer with an active OpenJDK ID can file a bug directly in JBS.\n-\n-TIP: A GitHub pull request (PR) should not be the first time we hear about your proposed change to OpenJFX. Unless clearly identified as a `Draft` or work-in-progress (WIP), as described in the following section, we will usually close a pull request that isn't associated with an existing bug report. Reading the policies below will help you in getting your change approved.\n-\n-### Submitting your changes via a pull request\n-\n-Once your changes and tests are ready to submit for review:\n-\n-1. Test your changes\n-\n-    Run the test suite to make sure that nothing is broken. For most code changes, you need to provide new tests covering those changes. At least one of the new tests should fail before your proposed fix and pass after your proposed fix.\n-\n-2. Rebase your changes\n-\n-    Update your local repository with the most recent code from the main [repository]((https:\/\/github.com\/openjdk\/jfx)), and rebase your branch on top of the latest `master` branch. We prefer your initial changes to be squashed into a single commit. See the [GitHub help page](https:\/\/help.github.com\/articles\/about-git-rebase\/) for help. Later, if we ask you to make changes, add them as separate commits. This makes them easier to review.\n-\n-3. Submit a pull request\n-\n-    Push your local changes to your forked copy of the repository and\n-    [submit a pull request](https:\/\/help.github.com\/articles\/using-pull-requests).\n-    The title of the pull request must start with the 7-digit JBS bug id,\n-    followed by a colon (`:`), then a space,\n-    and finally the bug title as taken from JBS. This title must _exactly_ match\n-    the JBS bug, else the Skara bot will warn about the mismatch and block integration.\n-    You should include\n-    additional details about your change in the Description of the pull\n-    request. For example, the following is a valid pull request title:\n-\n-    ```\n-    8231326: Update README and CONTRIBUTING docs for Skara\n-    ```\n-\n-    The Skara bot will then run `jcheck` on the server to verify the format\n-    of the PR title and check for whitespace errors. Once that passes,\n-    it will automatically send a Request For Review (RFR) email to the\n-    [openjfx-dev](https:\/\/mail.openjdk.org\/mailman\/listinfo\/openjfx-dev) mailing list.\n-    The Skara bot will also cross-link the JBS Issue and the pull request.\n-    See the\n-    [Skara project page](https:\/\/github.com\/openjdk\/skara#openjdk-project-skara)\n-    for information on `jcheck` and other Skara tools.\n-\n-    TIP: Create a `Draft` pull request or prefix the pull request title with `WIP:` if you aren't yet\n-    ready for it to be reviewed. The Skara bot will not send an RFR\n-    email unless the PR is out of the `Draft` state and the title starts with a 7-digit bug ID.\n-\n-    Please adhere to the general guideline that you should never force push\n-    to a publicly shared branch. Once you have opened your pull request, you\n-    should consider your branch publicly shared. Instead of force pushing\n-    you can just add incremental commits; this is generally easier on your\n-    reviewers. If you need to pick up changes from `master`, you can merge\n-    `master` into your branch. A reviewer might ask you to rebase a\n-    long-running pull request in which case force pushing is okay for that\n-    request. Note that squashing at the end of the review process should\n-    also not be done. The Skara bot will squash your commits into a\n-    single commit, and rebase it onto the target branch when the pull\n-    request is integrated.\n-    See the [GitHub Help Documentation](https:\/\/docs.github.com\/en\/github)\n-    for additional help on using Git and GitHub.\n-\n-4. Code review\n-\n-    All pull requests _must_ be reviewed according to the\n-    [Code Review Policies](README-code-reviews.md) page.\n-    It is the responsibility of the Reviewer(s) and the Committer who\n-    will integrate or sponsor the change to ensure that the code review policies\n-    are followed, and that all concerns have been addressed.\n-\n-    Discussion and review of the pull request can happen either by adding\n-    a comment to the PR itself, or by replying to the mailing list \"RFR\"\n-    thread. The Skara bot will cross-forward between them.\n-    To approve a pull request, a reviewer must do that in the PR itself.\n-    See the following\n-    [GitHub help page](https:\/\/help.github.com\/en\/articles\/reviewing-proposed-changes-in-a-pull-request)\n-    for help on reviewing a pull request.\n-\n-    If any changes\n-    are needed, you would push additional commits to the branch\n-    from which you made the pull request.\n-\n-    The code review continues until there are no unaddressed concerns, and\n-    at least the minimum number of reviewers have approved the PR -- which\n-    is one for low-impact bug fixes and two for enhancements or high-impact\n-    bug fixes.\n-\n-    NOTE: A Reviewer in the project can set the minimum number of reviewers\n-    for a PR using the Skara `\/reviewers` command. For example,\n-    `\/reviewers 2` is used for high-impact fixes and enhancements to indicate\n-    that two reviewers are needed, at least one of whom needs to have the\n-    Reviewer role in the project.\n-\n-    NOTE: A reviewer can indicate that a PR needs a\n-    [CSR](https:\/\/wiki.openjdk.org\/display\/csr\/Main) by\n-    entering the `\/csr` command. The Skara bot will then require an approved\n-    CSR before the PR can be integrated.\n-\n-5. Integrate the pull request\n-\n-    Once the review has completed as described above, you can integrate\n-    the PR.\n-\n-    A. Verify the following: all substantive feedback has been addressed; all Reviewers\n-    who have requested the chance to review have done so; the PR has been \"rfr\"\n-    for at least 1 business day (excluding weekends and holidays);\n-    the commit message is correct.\n-    See the [Code Review Gudelines](README-code-reviews.md#before-you-integrate-or-sponsor-a-pr)\n-    for more details.\n-\n-    B. Issue the `\/integrate` command. If you have the \"Committer\" role\n-    (or higher) in the Project, then the Skara bot will merge the change\n-    with no further action on your part. If you are not a Committer,\n-    then you must get a Committer to sponsor your change. This is often\n-    one of the reviewers who reviewed your PR, but it need not be. The\n-    sponsor will issue the `\/sponsor` command after you issue `\/integrate`\n-    once they are satisfied that the review criteria have been met.\n-    The Skara bot will automatically resolve the JBS issue as \"Fixed\"\n-    so there is no need to manually resolve it.\n-\n-\n-New features \/ API additions\n-----------------------------\n-\n-Adding a new feature to OpenJFX requires us to consider what it means to support that API forever; we take compatibility seriously.\n-The main idea is to think in terms of \"stewardship\" when evolving the JavaFX API. This will require significant effort on your part.\n-It begins before you submit a pull request for review, and continues after the new feature is integrated.\n-With that in mind, here are the needed steps to get a new feature into JavaFX.\n-\n-1. Discuss the proposed feature on the [openjfx-dev](https:\/\/mail.openjdk.org\/mailman\/listinfo\/openjfx-dev) mailing list.\n-You should start with _why_ you think\n-adding the API to the core of JavaFX is a good and useful addition for multiple applications (not just your own)\n-and for the evolution of the JavaFX UI Toolkit. Part of this is to see whether the Project Leads and Reviewers\n-are generally supportive of the idea, as well as to see whether other developers have any ideas as to whether\n-and how it would be useful in their applications. We want to make sure that the new feature fits in with the\n-existing API and will move the API forward in a direction we want to go. We need to ensure that the value\n-proposition of the new feature justifies the investment, which goes well beyond the initial cost of developing it.\n-Presuming that the feature meets the cost \/ benefit assessment (including opportunity cost), then discussion can\n-proceed to the API.\n-\n-2. Discuss the API needed to provide the feature. While this can't always be completely separated from its\n-implementation, it is the public API itself that is important to nail down and get right. While we don't currently\n-use the formal JEP process as is done for larger JDK features, the [JEP template](https:\/\/openjdk.org\/jeps\/2)\n-provides some ideas to consider when proposing an API, such as a summary of the changes, goals, motivation, testing,\n-dependencies, etc. A Draft (or WIP) pull request can be useful for illustrative purposes as long as the focus is on the public API.\n-If there are trade-offs to be made in the implementation, or different implementation approaches that you might take,\n-this is a good time to discuss it. Once this step is far enough along that there is general agreement as to the API,\n-then it's time to focus on the implementation.\n-\n-3. Submit a review of your proposed implementation. As noted in the\n-[New features \/ API additions](README-code-reviews.md#c-new-features--api-additions)\n-section of the Code Review Policies page, we also need a [CSR](https:\/\/wiki.openjdk.org\/display\/csr\/Main), which documents the API change and its approval.\n-The CSR can be reviewed in parallel. Changes in the API that arise during the review need to be reflected in the CSR, meaning\n-that the final review \/ approval of the CSR usually happens late in the review cycle.\n-You can avoid extra work by waiting to submit the CSR until the API is agreed upon and the code review for the documentation is reasonably far along.\n-\n-TIP: a pull request is _not_ the starting point, since that skips the first two important steps and jumps right into\n-\"given this new feature, and an API definition that specifies it, please review my proposed implementation\".\n-\n-Coding style and testing guidelines\n-------------------------------------------\n-\n-The following formatting rules are enforced for source code files by\n-`git jcheck`, which is run by the Skara bot:\n-\n-* Use Unix-style (LF) line endings, not DOS-style (CRLF)\n-* Do not use TAB characters (exception: Makefiles can have TABS)\n-* No trailing spaces\n-* No files with execute permission\n-\n-Please also follow these formatting guidelines:\n-\n-* Java indent is 4 spaces\n-* Line width is no more than 120 characters\n-* The rest is left to Java coding standards\n-* Avoid making changes that are unrelated to the bug you are fixing. This includes fixing minor errors such as warnings, spacing \/ indentation, spelling errors, etc, in code that you aren't otherwise modifying as part of your fix.\n-* Disable &ldquo;auto-format on save&rdquo; to prevent your IDE from making unnecessary formatting changes. This makes reviews much harder as it generates unnecessary diffs. If your IDE supports formatting only modified chunks, that is fine to do.\n-* Wildcard imports &ndash; for example, `import java.util.*;` &ndash; are forbidden and may cause the build to fail. Please attempt to configure your IDE so it doesn't generate wildcard imports. An exception to this rule is that wildcard static imports in test classes are allowed, for example, `import static org.junit.Assert.*;`.\n-* Don't worry too much about import order. Try not to change it but don't worry about fighting your IDE to stop it from doing so.\n-\n-New code should be formatted consistently in accordance with the above guidelines. However, please do not reformat existing code as part of a bug fix. This makes more changes for code reviewers to track and review, and can lead to merge conflicts.\n-\n-### Building and testing\n-\n-JDK 22 (at a minimum) is required to build OpenJFX. You must have the JDK\n-installed on your system\n-with the environment variable `JAVA_HOME` referencing the path to Java home for\n-your JDK installation. By default, tests use the same runtime as `JAVA_HOME`.\n-\n-It is possible to develop in any major Java IDE (Eclipse, IntelliJ, NetBeans). IDEs can automatically configure projects based on Gradle setup.\n-\n-OpenJFX uses Gradle for its build. Before submitting your changes, run the test suite to make sure that nothing is broken, with:\n-\n-```sh\n-bash .\/gradlew all test\n@@ -249,5 +11,1 @@\n-\n-If you are changing anything that might possibly affect rendering, you should run a full test with robot enabled:\n-\n-```sh\n-bash .\/gradlew -PFULL_TEST=true -PUSE_ROBOT=true all test\n+Backport LONG-COMMIT-HASH\n@@ -256,1 +14,1 @@\n-If you don't build WebKit (using the `-PCOMPILE_WEBKIT=true` option), you are likely to get test failures when running the web tests. See the [Web Testing](WEBKIT-MEDIA-STUBS.md) page for information on how to address this.\n+where `LONG-COMMIT-HASH` is the long (40 char) commit hash of the fix as found in the main jfx repo. The Skara tooling will then note that it is a backport, and replace the title with the correct issue title.\n@@ -258,2 +16,3 @@\n-Even more documentation on OpenJFX projects and its build system can be found on the\n-[OpenJFX Wiki](https:\/\/wiki.openjdk.org\/display\/OpenJFX\/).\n+If Skara detemines that the backport is clean, the bot will add the `clean` label and mark it as `ready` for integration. _If_ a project lead has approved\n+this bug for inclusion in the current update release, a review of a clean backport is optional; such a backport may be integrated without further review. If\n+there is any concern over the risk of the backport, please ask for a review.\n","filename":"CONTRIBUTING.md","additions":10,"deletions":251,"binary":false,"changes":261,"status":"modified"},{"patch":"@@ -1,1 +1,1 @@\n-# OpenJFX\n+# OpenJFX 24 Updates\n@@ -3,15 +3,1 @@\n-OpenJFX is an open source, next generation client application platform for desktop, mobile and embedded systems based on JavaSE. It is a collaborative effort by many individuals and companies with the goal of producing a modern, efficient, and fully featured toolkit for developing rich client applications. This is the open source project where we develop JavaFX.\n-\n-OpenJFX is free software, licensed under [GPL v2 with the Classpath exception](LICENSE), just like the JDK. Anybody is welcome to contribute to this project, port it to other platforms or devices, or do anything else that a free software license allows you to do!\n-\n-OpenJFX is a project under the charter of the OpenJDK. The [OpenJDK Bylaws](https:\/\/openjdk.org\/bylaws) and [License](LICENSE) govern our work. The OpenJFX project membership can be found on the [OpenJDK Census](https:\/\/openjdk.org\/census#openjfx). We welcome patches and involvement from individual contributors or companies. If this is your first time contributing to an OpenJDK project, you will need to review the rules on [becoming a Contributor](https:\/\/openjdk.org\/bylaws#contributor), and sign the [Oracle Contributor Agreement](https:\/\/oca.opensource.oracle.com\/) (OCA).\n-\n-## Issue tracking\n-\n-If you think you have found a bug in OpenJFX, first make sure that you are testing against the latest version - your issue may already have been fixed. If not, search our [issues list](https:\/\/bugs.openjdk.org\/issues\/?filter=39543) in the Java Bug System (JBS) in case a similar issue has already been opened. More information on where and how to report a bug can be found at [bugreport.java.com](https:\/\/bugreport.java.com\/).\n-\n-## Getting Started\n-\n-For instructions on building JavaFX, see the [Building OpenJFX](https:\/\/wiki.openjdk.org\/display\/OpenJFX\/Building+OpenJFX) Wiki page.\n-\n-For information about downloading and using JavaFX, see the [JavaFX community site](https:\/\/openjfx.io\/).\n+This repository has the source code for OpenJFX 24 Update Releases. The main repository for OpenJFX development is [https:\/\/github.com\/openjdk\/jfx](https:\/\/github.com\/openjdk\/jfx).\n@@ -22,1 +8,1 @@\n-Please read [CONTRIBUTING.md](CONTRIBUTING.md) for details on our code of conduct, and the process for submitting pull requests to us.\n+Please read [CONTRIBUTING.md](CONTRIBUTING.md) for details on submitting backport pull requests to OpenJFX 24 Updates. If you are looking to contribute to OpenJFX, please visit [openjdk\/jfx](https:\/\/github.com\/openjdk\/jfx) instead.\n","filename":"README.md","additions":3,"deletions":17,"binary":false,"changes":20,"status":"modified"},{"patch":"@@ -49,1 +49,1 @@\n-jfx.release.security.version=0\n+jfx.release.security.version=1\n","filename":"build.properties","additions":1,"deletions":1,"binary":false,"changes":2,"status":"modified"}]}