{"files":[{"patch":"@@ -2,1 +2,1 @@\n- * Copyright (c) 2012, 2022, Oracle and\/or its affiliates. All rights reserved.\n+ * Copyright (c) 2012, 2025, Oracle and\/or its affiliates. All rights reserved.\n@@ -45,1 +45,1 @@\n-    \/\/ Last updated:  - 4\/06\/2022\n+    \/\/ Last updated:  - 11\/03\/2025\n@@ -47,35 +47,43 @@\n-        \"\/*\\n\" +\n-        \" * COPYRIGHT AND PERMISSION NOTICE\\n\" +\n-        \" *\\n\" +\n-        \" * Copyright (c) 1991-2022 Unicode, Inc. All rights reserved.\\n\" +\n-        \" * Distributed under the Terms of Use in https:\/\/www.unicode.org\/copyright.html.\\n\" +\n-        \" *\\n\" +\n-        \" * Permission is hereby granted, free of charge, to any person obtaining\\n\" +\n-        \" * a copy of the Unicode data files and any associated documentation\\n\" +\n-        \" * (the \\\"Data Files\\\") or Unicode software and any associated documentation\\n\" +\n-        \" * (the \\\"Software\\\") to deal in the Data Files or Software\\n\" +\n-        \" * without restriction, including without limitation the rights to use,\\n\" +\n-        \" * copy, modify, merge, publish, distribute, and\/or sell copies of\\n\" +\n-        \" * the Data Files or Software, and to permit persons to whom the Data Files\\n\" +\n-        \" * or Software are furnished to do so, provided that either\\n\" +\n-        \" * (a) this copyright and permission notice appear with all copies\\n\" +\n-        \" * of the Data Files or Software, or\\n\" +\n-        \" * (b) this copyright and permission notice appear in associated\\n\" +\n-        \" * Documentation.\\n\" +\n-        \" *\\n\" +\n-        \" * THE DATA FILES AND SOFTWARE ARE PROVIDED \\\"AS IS\\\", WITHOUT WARRANTY OF\\n\" +\n-        \" * ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE\\n\" +\n-        \" * WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND\\n\" +\n-        \" * NONINFRINGEMENT OF THIRD PARTY RIGHTS.\\n\" +\n-        \" * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS INCLUDED IN THIS\\n\" +\n-        \" * NOTICE BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT OR CONSEQUENTIAL\\n\" +\n-        \" * DAMAGES, OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE,\\n\" +\n-        \" * DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER\\n\" +\n-        \" * TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR\\n\" +\n-        \" * PERFORMANCE OF THE DATA FILES OR SOFTWARE.\\n\" +\n-        \" *\\n\" +\n-        \" * Except as contained in this notice, the name of a copyright holder\\n\" +\n-        \" * shall not be used in advertising or otherwise to promote the sale,\\n\" +\n-        \" * use or other dealings in these Data Files or Software without prior\\n\" +\n-        \" * written authorization of the copyright holder.\\n\" +\n-        \" *\/\\n\";\n+        \"\"\"\n+        \/*\n+         * COPYRIGHT AND PERMISSION NOTICE\n+         *\n+         * Copyright © 1991-2025 Unicode, Inc.\n+         *\n+         * NOTICE TO USER: Carefully read the following legal agreement. BY\n+         * DOWNLOADING, INSTALLING, COPYING OR OTHERWISE USING DATA FILES, AND\/OR\n+         * SOFTWARE, YOU UNEQUIVOCALLY ACCEPT, AND AGREE TO BE BOUND BY, ALL OF THE\n+         * TERMS AND CONDITIONS OF THIS AGREEMENT. IF YOU DO NOT AGREE, DO NOT\n+         * DOWNLOAD, INSTALL, COPY, DISTRIBUTE OR USE THE DATA FILES OR SOFTWARE.\n+         *\n+         * Permission is hereby granted, free of charge, to any person obtaining a\n+         * copy of data files and any associated documentation (the \"Data Files\") or\n+         * software and any associated documentation (the \"Software\") to deal in the\n+         * Data Files or Software without restriction, including without limitation\n+         * the rights to use, copy, modify, merge, publish, distribute, and\/or sell\n+         * copies of the Data Files or Software, and to permit persons to whom the\n+         * Data Files or Software are furnished to do so, provided that either (a)\n+         * this copyright and permission notice appear with all copies of the Data\n+         * Files or Software, or (b) this copyright and permission notice appear in\n+         * associated Documentation.\n+         *\n+         * THE DATA FILES AND SOFTWARE ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY\n+         * KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n+         * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF\n+         * THIRD PARTY RIGHTS.\n+         *\n+         * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS INCLUDED IN THIS NOTICE\n+         * BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT OR CONSEQUENTIAL DAMAGES,\n+         * OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,\n+         * WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION,\n+         * ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THE DATA\n+         * FILES OR SOFTWARE.\n+         *\n+         * Except as contained in this notice, the name of a copyright holder shall\n+         * not be used in advertising or otherwise to promote the sale, use or other\n+         * dealings in these Data Files or Software without prior written\n+         * authorization of the copyright holder.\n+         *\n+         * SPDX-License-Identifier: Unicode-3.0\n+         *\/\n+        \"\"\";\n","filename":"make\/jdk\/src\/classes\/build\/tools\/cldrconverter\/CopyrightHeaders.java","additions":45,"deletions":37,"binary":false,"changes":82,"status":"modified"}]}