{"files":[{"patch":"@@ -5,1 +5,1 @@\n-  DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER\n+  DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER.\n@@ -7,3 +7,5 @@\n-  This program is free software; you can redistribute it and\/or\n-  modify it under the terms of the GNU General Public License version\n-  2 only, as published by the Free Software Foundation.\n+  This code is free software; you can redistribute it and\/or modify it\n+  under the terms of the GNU General Public License version 2 only, as\n+  published by the Free Software Foundation.  Oracle designates this\n+  particular file as subject to the \"Classpath\" exception as provided\n+  by Oracle in the LICENSE file that accompanied this code.\n@@ -11,5 +13,5 @@\n-  This program is distributed in the hope that it will be useful, but\n-  WITHOUT ANY WARRANTY; without even the implied warranty of\n-  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU\n-  General Public License version 2 for more details (a copy is\n-  included at \/legal\/license.txt).\n+  This code is distributed in the hope that it will be useful, but WITHOUT\n+  ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\n+  FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License\n+  version 2 for more details (a copy is included in the LICENSE file that\n+  accompanied this code).\n@@ -17,4 +19,3 @@\n-  You should have received a copy of the GNU General Public License\n-  version 2 along with this work; if not, write to the Free Software\n-  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA\n-  02110-1301 USA\n+  You should have received a copy of the GNU General Public License version\n+  2 along with this work; if not, write to the Free Software Foundation,\n+  Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA.\n@@ -22,3 +23,3 @@\n-  Please contact Sun Microsystems, Inc., 4150 Network Circle, Santa\n-  Clara, CA 95054 or visit www.sun.com if you need additional\n-  information or questions.\n+  Please contact Oracle, 500 Oracle Parkway, Redwood Shores, CA 94065 USA\n+  or visit www.oracle.com if you need additional information or have any\n+  questions.\n","filename":"src\/com\/sun\/javatest\/stylesheet.css","additions":17,"deletions":16,"binary":false,"changes":33,"status":"modified"}]}