{"files":[{"patch":"@@ -23,1 +23,1 @@\n-The most common [Issue]{.jbs-field} types are:\n+The most common **Issue** types are:\n@@ -29,1 +29,1 @@\n-    <td class=\"dictionary\">Used when reporting a problem: crashes; hangs; failures of functionality etc.<\/td>\n+    <td class=\"dictionary\">A \"bug\" should relate to functional correctness - a deviation from behavior that can be tied back to a specification. Anything else, including performance concerns, is generally not a bug, but an enhancement. Though it is not clear cut as a significant performance regression may be classified as a \"bug\", for example<\/td>\n@@ -33,1 +33,1 @@\n-    <td class=\"dictionary\">For a small improvement to existing functionality<br \/>\n+    <td class=\"dictionary\">For a small to medium improvement to existing functionality<br \/>\n@@ -49,1 +49,1 @@\n-    <td class=\"dictionary\">Where something needs to happen other than a code change - for example a request for a new JBS version, or other work associated with a release<\/td>\n+    <td class=\"dictionary\"> Tasks are used to track work that is not expected to result in a change in any code repository. They are used to track non-repo changes or related activities such as a new JBS version number, a build request, an update to a document etc.<\/td>\n@@ -52,1 +52,4 @@\n-Note: If you suspect that the issue is a vulnerability, **don't file a JBS issue**, instead send your report to [vuln-report@openjdk.org](mailto:vuln-report@openjdk.org), also use this alias if you find an existing report which may be a vulnerability. Please do *not* report or discuss potential vulnerabilities on any open lists or other public channels - see [OpenJDK Vulnerabilities](https:\/\/openjdk.org\/groups\/vulnerability\/report) for more information.\n+Notes:\n+\n+* If you suspect that the issue is a vulnerability, **don't file a JBS issue**, instead send your report to [vuln-report@openjdk.org](mailto:vuln-report@openjdk.org), also use this alias if you find an existing report which may be a vulnerability. Please do *not* report or discuss potential vulnerabilities on any open lists or other public channels - see [OpenJDK Vulnerabilities](https:\/\/openjdk.org\/groups\/vulnerability\/report) for more information.\n+* a [Bug]{.jbs} or [Enhancement]{.jbs-field} should only be used if the work is expected to result in a change in a code repository. A [Bug]{.jbs-field} or [Enhancement]{.jbs-field} with resolution Fixed is required to have a corresponding changeset in one of the OpenJDK repositories.\n@@ -173,1 +176,3 @@\n-First give the issue a general review\n+For the most OpenJDK groups Triage is performed on a regular basis (at least weekly) by triage teams. Each triage team consists of contributors who are area experts for that group of issues. If you haven't been selected to be part of a triage team for a specific area you shouldn't be triaging bugs in that area, unless you are the assignee.\n+\n+When triaging an issue, first give it a general review\n@@ -191,2 +196,2 @@\n-        * There are two options for creating backport issue(s) to track the backport: one is to create it manually once it is agreed that the bug should be backported; the second, is to let the bots create the backport issue once you push the fix to the repo.\n-    1. Only one fixversion should ever be set, if the issue is to be fixed in additional releases then a separate backport must be created (See Working with backports in JBS).  There are exceptions to this rule for: CSRs; and, Release Notes.\n+        * There are two options for creating backport issue(s) to track the backport: one is to create it manually once it is agreed that the bug should be backported; the second, is to let the bots create the backport issue once you push the fix to the repo (see [Working with backports in JBS](#working-with-backports-in-jbs).\n+    1. Only one fixversion should ever be set, if the issue is to be fixed in additional releases then a separate backport must be created (see [Working with backports in JBS](#working-with-backports-in-jbs)).  There are exceptions to this rule for: CSRs; and, Release Notes.\n@@ -200,1 +205,1 @@\n-At this point move the issue into the [Open]{.jbs-field} state, bring high priority (P1, P2) bugs to the attention of the team.\n+At this point move the issue into the [Open]{.jbs-field} state.\n","filename":"src\/guide\/jbs-jdk-bug-system.md","additions":14,"deletions":9,"binary":false,"changes":23,"status":"modified"}]}