{"files":[{"patch":"@@ -156,12 +156,20 @@\n-  \/\/ The ClassLoaderDataGraph maintains two lists of CLDs, one list which\n-  \/\/ contains the created CLDs, and another which contains the unloading\n-  \/\/ CLDs. To enable the lock free concurrent iteration of the created\n-  \/\/ CLDs list used by the GC for root scanning, it is important that unlinking\n-  \/\/ CLDs from the created list upholds the invariant that all unlinked CLDs are\n-  \/\/ is_unloading().\n-  \/\/ Any insertions to the created CLDs list is done at the head and keeps\n-  \/\/ the list tail invariant.\n-  \/\/ CLDs are unlinked in ClassLoaderDataGraph::do_unloading() and released in\n-  \/\/ ClassLoaderDataGraph::purge(), so some syncronization is required between\n-  \/\/ the two to ensure that no unlinked CLD remains in the system leading\n-  \/\/ to a use after free.\n+  \/\/\n+  \/\/ The ClassLoaderDataGraph maintains two lists to keep track of CLDs.\n+  \/\/\n+  \/\/ The first list [_head, _next] is where new CLDs are registered. The CLDs\n+  \/\/ are only inserted at the _head, and the _next pointers are never rewritten.\n+  \/\/ This allows GCs to concurrently walk the list while the CLDs are being\n+  \/\/ concurrently unlinked.\n+  \/\/\n+  \/\/ The second list [_unloading_head, _unloading_next] is where dead CLDs get\n+  \/\/ moved to during class unloading. See: ClassLoaderDataGraph::do_unloading().\n+  \/\/ This list is never modified while other threads are iterating over it. \n+  \/\/\n+  \/\/ After all dead CLDs have been moved to the unloading list, there's a\n+  \/\/ synchronziation point (handshake) to ensure that all threads reading these\n+  \/\/ CLDs finish their work. This ensures that we don't have a user-after-free\n+  \/\/ when we later delete the CLDs. \n+  \/\/\n+  \/\/ And finally, when no threads are using the unloading CLDs anymore, we\n+  \/\/ remove them from the class unloading list and delete them. See:\n+  \/\/ ClassLoaderDataGraph::purge();\n","filename":"src\/hotspot\/share\/classfile\/classLoaderData.hpp","additions":20,"deletions":12,"binary":false,"changes":32,"status":"modified"}]}