{"files":[{"patch":"@@ -1101,3 +1101,4 @@\n-\/\/ Does not clone Loop Limit Check parse predicates iff a counted loop is unswitched, because a loop limit check before\n-\/\/ the unswitched loop selector covers both unswitched counted loops. Otherwise, we would need to hoist the loop limit\n-\/\/ checks from both loops back up to the loop selector.\n+\/\/ Does not clone a Loop Limit Check Parse Predicate if a counted loop is unswitched, because it most likely will not be\n+\/\/ used anymore (it could only be used when both unswitched loop versions die and the Loop Limit Check Parse Predicate\n+\/\/ ends up at a LoopNode without Loop Limit Check Parse Predicate directly following the unswitched loop that can then\n+\/\/ be speculatively converted to a counted loop - this is rather rare).\n","filename":"src\/hotspot\/share\/opto\/predicates.cpp","additions":4,"deletions":3,"binary":false,"changes":7,"status":"modified"},{"patch":"@@ -1179,1 +1179,1 @@\n-  bool const _is_counted_loop;\n+  const bool _is_counted_loop;\n","filename":"src\/hotspot\/share\/opto\/predicates.hpp","additions":1,"deletions":1,"binary":false,"changes":2,"status":"modified"},{"patch":"@@ -68,1 +68,0 @@\n-\n@@ -81,2 +80,1 @@\n-    \/\/ Since we know that predication happens after unswitching, we can test the\n-    \/\/ predicate cloning before predication, such that the useless, killed predicates\n+    \/\/ Since we know that Loop Predication happens after Loop Unswitching, we can test the\n@@ -88,3 +86,3 @@\n-        phase = CompilePhase.BEFORE_LOOP_PREDICATION_IC)\n-    \/\/ Check that opaque template assertion predicated are added in loop predication\n-    \/\/ even if loop predication only happens after loop unswitching.\n+        phase = CompilePhase.BEFORE_LOOP_PREDICATION_RC)\n+    \/\/ Check that Opaque Template Assertion Predicates are added in Loop Predication\n+    \/\/ even if Loop Predication only happens after Loop Unswitching.\n@@ -122,2 +120,2 @@\n-    \/\/ Check that Loop Unswitching doubled the number of parse and tempalte\n-    \/\/ assertion predicates. Again, the Loop Limit Check Parse Predicate\n+    \/\/ Check that Loop Unswitching doubled the number of Parse and Template\n+    \/\/ Assertion Predicates. Again, the Loop Limit Check Parse Predicate\n@@ -133,1 +131,1 @@\n-    \/\/ After loop unswitching and after removing the killed predicates.\n+    \/\/ After Loop Unswitching and after removing the killed predicates.\n@@ -153,2 +151,2 @@\n-    \/\/ Check that Loop Unswitching doubled the number of all parse predicates.\n-    \/\/ Since this is not counted loop, the Loop Limit Check parse predicate\n+    \/\/ Check that Loop Unswitching doubled the number of all Parse Predicates.\n+    \/\/ Since this is not counted loop, the Loop Limit Check Parse Predicate\n@@ -161,2 +159,2 @@\n-    \/\/ After loop unswitching and after removing the killed predicates all\n-    \/\/ parse predicates are doubled..\n+    \/\/ After Loop Unswitching and after removing the killed predicates all\n+    \/\/ Parse Predicates are doubled.\n","filename":"test\/hotspot\/jtreg\/compiler\/loopopts\/TestUnswitchPredicateCloning.java","additions":11,"deletions":13,"binary":false,"changes":24,"status":"modified"}]}