{"files":[{"patch":"@@ -8534,0 +8534,39 @@\n+    \/**\n+     * Tries to move the focus from this {@code Node} in the specified direction.\n+     * The {@code Node} serves as a reference point and does not have to be focused or focusable.\n+     * A successful traversal results in a new {@code Node} being focused.\n+     * <p>\n+     * This method is expected to be called in response to a {@code KeyEvent}, since the {@code Node}\n+     * receiving focus will have the {@link #focusVisibleProperty() focusVisible} property set.\n+     *\n+     * @param direction the direction of focus traversal\n+     * @return {@code true} if traversal was successful\n+     * @since 24\n+     *\/\n+    public final boolean requestFocusTraversal(TraversalDirection direction) {\n+        Direction d;\n+        switch (direction) {\n+        case DOWN:\n+            d = Direction.DOWN;\n+            break;\n+        case LEFT:\n+            d = Direction.LEFT;\n+            break;\n+        case NEXT:\n+            d = Direction.NEXT;\n+            break;\n+        case PREVIOUS:\n+            d = Direction.PREVIOUS;\n+            break;\n+        case RIGHT:\n+            d = Direction.RIGHT;\n+            break;\n+        case UP:\n+            d = Direction.UP;\n+            break;\n+        default:\n+            return false;\n+        }\n+        return traverse(d, TraversalMethod.KEY);\n+    }\n+\n","filename":"modules\/javafx.graphics\/src\/main\/java\/javafx\/scene\/Node.java","additions":39,"deletions":0,"binary":false,"changes":39,"status":"modified"},{"patch":"@@ -0,0 +1,46 @@\n+\/*\n+ * Copyright (c) 2024, Oracle and\/or its affiliates. All rights reserved.\n+ * DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER.\n+ *\n+ * This code is free software; you can redistribute it and\/or modify it\n+ * under the terms of the GNU General Public License version 2 only, as\n+ * published by the Free Software Foundation.  Oracle designates this\n+ * particular file as subject to the \"Classpath\" exception as provided\n+ * by Oracle in the LICENSE file that accompanied this code.\n+ *\n+ * This code is distributed in the hope that it will be useful, but WITHOUT\n+ * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\n+ * FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License\n+ * version 2 for more details (a copy is included in the LICENSE file that\n+ * accompanied this code).\n+ *\n+ * You should have received a copy of the GNU General Public License version\n+ * 2 along with this work; if not, write to the Free Software Foundation,\n+ * Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA.\n+ *\n+ * Please contact Oracle, 500 Oracle Parkway, Redwood Shores, CA 94065 USA\n+ * or visit www.oracle.com if you need additional information or have any\n+ * questions.\n+ *\/\n+package javafx.scene;\n+\n+\/**\n+ * Specifies the direction of focus traversal.\n+ *\n+ * @since 24\n+ * @see Node#requestFocusTraversal(TraversalDirection)\n+ *\/\n+public enum TraversalDirection {\n+    \/** Indicates a focus change to the node below the currently focused node. *\/\n+    DOWN,\n+    \/** Indicates a focus change to the node to the left of the currently focused node. *\/\n+    LEFT,\n+    \/** Indicates a focus change to the next focusable node. *\/\n+    NEXT,\n+    \/** Indicates a focus change to the previous focusable node. *\/\n+    PREVIOUS,\n+    \/** Indicates a focus change to the node to the right of the currently focused node. *\/\n+    RIGHT,\n+    \/** Indicates a focus change to the node above the currently focused node. *\/\n+    UP;\n+}\n\\ No newline at end of file\n","filename":"modules\/javafx.graphics\/src\/main\/java\/javafx\/scene\/TraversalDirection.java","additions":46,"deletions":0,"binary":false,"changes":46,"status":"added"}]}