{"files":[{"patch":"@@ -130,1 +130,2 @@\n-    \/\/ having its own constant VarHandle. See VarHandle$AccessDescriptor for the mechanism.\n+    \/\/ having its own constant VarHandle. In that case, the AccessMode::adaptedMethodHandle adaption mechanism\n+    \/\/ does not work due to multiple VarHandles, but this bypass still enables constant folding.\n","filename":"make\/jdk\/src\/classes\/build\/tools\/methodhandle\/VarHandleGuardMethodGenerator.java","additions":2,"deletions":1,"binary":false,"changes":3,"status":"modified"},{"patch":"@@ -2042,10 +2042,7 @@\n-        \/\/ Condition 1 and 2 indicates this access descriptor may see a VarHandle\n-        \/\/ different from the captured VarHandle.  Condition 3 requires the\n-        \/\/ capture to be made only for loader-safe VarHandles.\n-        \/\/ Due to condition 1, we have to retain the GUARD_METHOD_TEMPLATE_V\n-        \/\/ in VarHandleGuards. One (name, return-dropping type) combination\n-        \/\/ such as compareAndSet can appear at two sites, where each site\n-        \/\/ has its own constant VarHandle. Such a usage pattern hurts adaption,\n-        \/\/ but is perfectly dealt by the getMethodType_V constant folding branch.\n-\n-        \/\/ In the long run, we wish to put a specific-type invoker that converts\n+        \/\/ If either condition 1 or 2 doesn't hold, we may see different var\n+        \/\/ handle instances using the same shared AccessDescriptor. In those\n+        \/\/ cases we only cache the adaptation for one of the var handle instances\n+        \/\/ (usually the first one, arbitrary under race).\n+        \/\/ Other instances will always use the slow path.\n+\n+        \/\/ In the long run, we wish to cache each specific-type invoker that converts\n@@ -2054,2 +2051,2 @@\n-        \/\/ perform a foldable lookup with a hash table, and hope C2 inline it\n-        \/\/ all. Such an optimization applies for general MethodHandle.asType.\n+        \/\/ using a foldable lookup with a hash table, and hope C2 inline it\n+        \/\/ all. Such an optimization applies to general MethodHandle.asType.\n@@ -2092,2 +2089,2 @@\n-                    \/\/ Adaption of the witness will constant-fold to `cache.mh`.\n-                    \/\/ Adaption of the others will fold to a `vh.getMethodHandle(mode).asType(...)`.\n+                    \/\/ Adaption of the witness will constant-fold to fast path `cache.mh`.\n+                    \/\/ Adaption of the others will fold to slow path `vh.getMethodHandle(mode).asType(...)`.\n","filename":"src\/java.base\/share\/classes\/java\/lang\/invoke\/VarHandle.java","additions":11,"deletions":14,"binary":false,"changes":25,"status":"modified"}]}