{"files":[{"patch":"@@ -0,0 +1,43 @@\n+% Explanation of start of release changes\n+\n+## Overview\n+\n+The start of release changes, the changes the turn JDK N into JDK\n+(N+1), are primarily small updates to various files along new files to\n+store symbol information to allow `javac --release N ...` to run on\n+JDK (N+1).\n+\n+As a matter of policy, there are a number of semantically distinct\n+concepts which separately get incremented at the start of a new release:\n+\n+* Feature value of `Runtime.version()`\n+* Highest class file format major version recognized by the platform\n+* Highest `-source`\/`-target'\/`--release` argument recognized by `javac`\n+\n+In more detail, updated files include:\n+\n+* `jcheck\/conf`: update meta-data used by jcheck and the Skara tooling\n+* `make\/conf\/version-numbers.conf`: update to meta-data used in the build\n+* `src\/hotspot\/share\/classfile\/classFileParser.cpp`: add a `#define`\n+  for the new version\n+* `src\/java.base\/share\/classes\/java\/lang\/classfile\/ClassFile.java`:\n+  add a constant for the new class file format version\n+* `src\/java.base\/share\/classes\/java\/lang\/reflect\/ClassFileFormatVersion.java`:\n+   add an `enum` constant for the new class file format version\n+* `src\/java.compiler\/share\/classes\/javax\/lang\/model\/SourceVersion.java`:\n+  add an `enum` constant for the new source version\n+* `src\/java.compiler\/share\/classes\/javax\/lang\/model\/util\/*` visitors: Update\n+  `@SupportedSourceVersion` annotations to latest value. Note this update\n+  is done in lieu of introducing another set of visitors for each Java\n+  SE release.\n+* `src\/jdk.compiler\/share\/classes\/com\/sun\/tools\/javac\/code\/Source.java`:\n+   add an `enum` constant for the new source version internal to `javac`\n+* `src\/jdk.compiler\/share\/classes\/com\/sun\/tools\/javac\/jvm\/ClassFile.java`:\n+   add an `enum` constant for the new class file format version internal to `javac`\n+* `src\/jdk.compiler\/share\/classes\/com\/sun\/tools\/javac\/jvm\/Target.java`:\n+   add an `enum` constant for the new target version internal to `javac`\n+* `src\/jdk.compiler\/share\/classes\/com\/sun\/tools\/javac\/processing\/PrintingProcessor.java`\n+   update printing processor to support the new source version\n+\n+The symbol information is stored as new text files in the\n+`src\/jdk.compiler\/share\/data\/symbols` directory, one file per module.\n","filename":"doc\/ref\/start-of-release.md","additions":43,"deletions":0,"binary":false,"changes":43,"status":"added"}]}