{"files":[{"patch":"@@ -1716,1 +1716,1 @@\n-Throughout the release there are a number of milestones and phases that defines where in the release cycle we are.\n+Throughout the release there are a number of milestones and phases that define where in the release cycle we are.\n@@ -1728,1 +1728,1 @@\n-:    Feature Complete is declared when all features that is supposed to be in the release has been integrated into the release. With the six-month release cadence, FC is defined as a date rather than a set of features, so the features that are integrated by FC are the features that should be in the release. FC is normally the same day as RDS.\n+:    Feature Complete is declared when all features that are supposed to be in the release have been integrated into the release. With the six-month release cadence, FC is defined as a date rather than a set of features, so the features that are integrated by FC are the features that should be in the release. FC is normally the same day as RDS.\n@@ -1737,1 +1737,1 @@\n-:    Towards the end of a release, when there are no more open product bugs targeted to the release, a stable build is selected to be the release candidate. This build will go through additional testing and if no more issues are found it will be the build released. If new bugs are found these are investigated and hopefully fixed, and a new build becomes the release candidate. The RC phase has a few milestones with a deadline for finding a candidate build, and another for making sure the build is ready to go live. During the RC phase only P1 bugs are fixed, and to fix one an approval is needed. See the [Fix-Request Process](https:\/\/openjdk.java.net\/jeps\/3#Fix-Request-Process) for details on how to obtain one. All other bugs should be deferred. To defer a P1 bug during RC you will need an approval. See the [Bug-Deferral Process](https:\/\/openjdk.java.net\/jeps\/3#Bug-Deferral-Process) for more details. No enhancements are allowed to be integrated during RC.\n+:    Towards the end of the release cycle, when there are no more open product bugs targeted to the release, a stable build is selected to be the release candidate. This build will go through additional testing and if no more issues are found it will be the build released. If new bugs are found these are investigated and hopefully fixed, and a new build becomes the release candidate. The RC phase has a few milestones with a deadline for finding a candidate build, and another for making sure the build is ready to go live. During the RC phase only P1 bugs are fixed, and to fix one an approval is needed. See the [Fix-Request Process](https:\/\/openjdk.java.net\/jeps\/3#Fix-Request-Process) for details on how to obtain one. All other bugs should be deferred. To defer a P1 bug during RC you will need an approval. See the [Bug-Deferral Process](https:\/\/openjdk.java.net\/jeps\/3#Bug-Deferral-Process) for more details. No enhancements are allowed to be integrated during RC.\n@@ -1757,1 +1757,1 @@\n-During the rampdown of a release there are two repositories in play, the stabilization fork for the outgoing release, and the mainline repository where the next release is being developed. Any bugfix going into the stabilization fork is likely to be desired in mainline as well. As a developer you should **only** push your fix to the stabilization fork if you intend for it to go to both repositories. Your fix will be forward ported to mainline.\n+During the rampdown of a release there are two repositories in play, the stabilization fork for the outgoing release, and the mainline repository where the next release is being developed. Any bugfix going into the stabilization fork is likely to be desired in mainline as well. As a developer you should push your fix to the stabilization fork **only**, even if you intend for it to go to both repositories. Your fix will be forward ported to mainline.\n","filename":"src\/index.md","additions":4,"deletions":4,"binary":false,"changes":8,"status":"modified"}]}