{"files":[{"patch":"@@ -50,1 +50,1 @@\n-  \/\/ This cast node carries a type depedency. We can remove it if:\n+  \/\/ This cast node carries a type dependency. We can remove it if:\n","filename":"src\/hotspot\/share\/opto\/castnode.cpp","additions":1,"deletions":1,"binary":false,"changes":2,"status":"modified"},{"patch":"@@ -104,2 +104,5 @@\n-    \/\/ used for range checks: the range check CastII is dependent on the range check and if its input's type is narrower\n-    \/\/ than the type of the range check, it's safe to be removed.\n+\n+    \/\/ Use case example: Range Check CastII\n+    \/\/ Floating: The Cast is only dependent on the single range check.\n+    \/\/ Narrowing: The Cast narrows the type to a positive index. If the input to the Cast is narrower, we can safely\n+    \/\/            remove the cast because the array access will be safe.\n@@ -107,4 +110,6 @@\n-    \/\/ used after loop opts when Cast nodes' types are widened so Casts that only differ by slightly different types can\n-    \/\/ common. Given the type carried by the Cast is no longer accurate, removing a Cast because its input has a\n-    \/\/ narrower type causes the dependency carried by the Cast to be lost. In some corner cases, that could let an array\n-    \/\/ access float above a check it is dependent on.\n+    \/\/ Use case example: Widening Cast nodes' types after loop opts: We want to common Casts with slightly different types.\n+    \/\/ Floating: These Casts only depend on the single control.\n+    \/\/ NonNarrowing: Even when the input type is narrower, we are not removing the Cast. Otherwise, the dependency\n+    \/\/               to the single control is lost, and an array access could float above its range check because we\n+    \/\/               just removed the dependency to the range check by removing the Cast. This could lead to an\n+    \/\/               out-of-bounds access.\n@@ -112,4 +117,7 @@\n-    \/\/ used when an array access is no longer dependent on a single range check (range check smearing for instance). The\n-    \/\/ array access must remain below all the checks it depends on. If the one it directly depends on (its control input)\n-    \/\/ is hoisted and the cast floats with it, the risk is that it ends up above other checks it depends on, allowing an\n-    \/\/ out of bound array access to proceed.\n+    \/\/ Use case example: An array accesses that is no longer dependent on a single range check (e.g. range check smearing).\n+    \/\/ NonFloating: The array access must be pinned below all the checks it depends on. If the check it directly depends\n+    \/\/              on with a control input is hoisted, we do not hoist the Cast as well. If we allowed the Cast to float,\n+    \/\/              we risk that the array access ends up above another check it depends on (we cannot model two control\n+    \/\/              dependencies for a node in the IR). This could lead to an out-of-bounds access.\n+    \/\/ Narrowing: If the Cast does not narrow the input type, then it's safe to remove the cast because the array access\n+    \/\/            will be safe.\n@@ -117,2 +125,4 @@\n-    \/\/ used when a floating node is sunk out of loop: we don't want the cast that forces the node to be out of loop to\n-    \/\/ be removed in any case otherwise the sunk node floats back into the loop.\n+    \/\/ Use case example: Sinking nodes out of a loop\n+    \/\/ Non-Floating & Non-Narrowing: We don't want the Cast that forces the node to be out of loop to be removed in any\n+    \/\/                               case. Otherwise, the sunk node could float back into the loop, undoing the sinking.\n+    \/\/                               This Cast is only used for pinning without caring about narrowing types.\n","filename":"src\/hotspot\/share\/opto\/castnode.hpp","additions":22,"deletions":12,"binary":false,"changes":34,"status":"modified"}]}