{"files":[{"patch":"@@ -30,0 +30,1 @@\n+<li><a href=\"#common-test-groups\">Common Test Groups<\/a><\/li>\n@@ -70,0 +71,9 @@\n+<h3 id=\"common-test-groups\">Common Test Groups<\/h3>\n+<p>The source tree currently defines a few common test groups in the relevant <code>TEST.groups<\/code> files. The test groups are either covering a specific component, for example <code>hotspot_gc<\/code>, or represent one of the <em>tiered<\/em> test groups, for example <code>tier1<\/code>. It is a good idea to look into <code>TEST.groups<\/code> files to get a sense what tests to run for the changes in the particular JDK component.<\/p>\n+<p>A brief description of the common test groups:<\/p>\n+<ul>\n+<li><p><code>tier1<\/code>: This test group is the first line of defense against bugs. Multiple developers run these tests every day. Normally, at least this tier is ran before integration. Because of the widespread, the tests in <code>tier1<\/code> are carefully selected and optimized to run fast, and to run in the most stable manner. The test failures in <code>tier1<\/code> are usually followed up on quickly, either with fixes, or adding relevant tests to problem list. <a href=\"..\/.github\/workflows\/\">GitHub Actions workflows<\/a>, if enabled, run <code>tier1<\/code> tests.<\/p><\/li>\n+<li><p><code>tier2<\/code>: This test group covers even more ground. These contain, among other things, tests that either run for too long to be at <code>tier1<\/code>, test unstable and\/or experimental features, test less essential JDK components.<\/p><\/li>\n+<li><p><code>tier3<\/code>: This test group covers more stressful tests, the tests for corner cases not covered by previous tiers, plus the tests that require GUIs. As such, this suite should either be run with low concurrency (<code>TEST_JOBS=1<\/code>), or without headful tests (<code>JTREG_KEYWORDS=\\!headful<\/code>), or both.<\/p><\/li>\n+<li><p><code>tier4<\/code>: This test group every other test not covered by previous tiers. It includes, for example, <code>vmTestbase<\/code> suites for Hotspot, which run for many hours even on large machines. It also runs GUI tests, so the same <code>TEST_JOBS<\/code> and <code>JTREG_KEYWORDS<\/code> caveats apply.<\/p><\/li>\n+<\/ul>\n","filename":"doc\/testing.html","additions":10,"deletions":0,"binary":false,"changes":10,"status":"modified"},{"patch":"@@ -67,0 +67,31 @@\n+### Common Test Groups\n+\n+The source tree currently defines a few common test groups in the relevant `TEST.groups`\n+files. The test groups are either covering a specific component, for example `hotspot_gc`,\n+or represent one of the _tiered_ test groups, for example `tier1`. It is a good idea\n+to look into `TEST.groups` files to get a sense what tests to run for the changes in\n+the particular JDK component.\n+\n+A brief description of the common test groups:\n+\n+- `tier1`: This test group is the first line of defense against bugs. Multiple developers\n+run these tests every day. Normally, at least this tier is passed before integration.\n+Because of the widespread use, the tests in `tier1` are carefully selected and optimized\n+to run fast, and to run in the most stable manner. The test failures in `tier1` are\n+usually followed up on quickly, either with fixes, or adding relevant tests to problem\n+list. [GitHub Actions workflows](..\/.github\/workflows\/), if enabled, run `tier1` tests.\n+\n+- `tier2`: This test group covers even more ground. These contain, among other things,\n+tests that either run for too long to be at `tier1`, tests for unstable and\/or experimental\n+features, tests for less essential JDK components (for example, jaxp).\n+\n+- `tier3`: This test group includes more stressful tests, the tests for corner cases\n+not covered by previous tiers, plus the tests that require GUIs. As such, this suite\n+should either be run with low concurrency (`TEST_JOBS=1`), or without headful tests\n+(`JTREG_KEYWORDS=\\!headful`), or both.\n+\n+- `tier4`: This test group includes every other test not covered by previous tiers. It includes,\n+for example, `vmTestbase` suites for Hotspot, which run for many hours even on large\n+machines. It also runs GUI tests, so the same `TEST_JOBS` and `JTREG_KEYWORDS` caveats\n+apply.\n+\n","filename":"doc\/testing.md","additions":31,"deletions":0,"binary":false,"changes":31,"status":"modified"}]}