{"files":[{"patch":"@@ -690,1 +690,1 @@\n-      Used to indicate wether a change requires a release note or not. The labels are always placed on the main JBS issue, never on the actual release note issue. See [Release Notes](#release-notes).\n+      Used to indicate whether a change requires a release note or not. The labels are always placed on the main JBS issue, never on the actual release note issue. See [Release Notes](#release-notes).\n@@ -1540,1 +1540,1 @@\n-Release notes for a product (e.g. the JDK) are published together with a release of the given product. Release notes describe changes that are important for a user of the product to know about. This is usually things that may affect the user's choice to upgrade to the specific version.\n+Release notes for a product (e.g. the JDK) are part of the release deliverables. They describe changes that are important for a user of the product to know about. This is usually things that may affect the user's decision to upgrade to the specific version.\n@@ -1542,1 +1542,1 @@\n-When you write a release note for your feature, be prepared for rather picky review comments about grammar, typos, and wording. This is for the sake of the Java community as a whole, as the language of the release note sets the tone for many blogs and news articles. For a widely used product like the JDK, the release notes are often copied (word by word, including typos) and published to highlight news in the release. This means that we need to take extra care to make sure the text in the release note is correct and has a professional language.\n+When writing a release note for your feature, be prepared for rather picky review comments about grammar, typos, and wording. This is for the sake of the Java community as a whole, as the language of the release note sets the tone for many blogs and news articles. For a widely used product like the JDK, the release notes are often copied (word by word, including typos) and published to highlight news in the release. This means that we need to take extra care to make sure the text in the release note is correct and has a professional language.\n@@ -1546,9 +1546,11 @@\n-#. Add the label `release-note=yes` on the main JBS issue you want a release note for. That is, the JBS issue that is used to push the change, **not** the CSR (if there is one).\n-#. Create a sub-task of the same JBS issue that you want a release note for (not of the CSR).\n-   * Prefix the name of the sub-task with \"Release Note:\".\n-   * The title of the release note sub-task should be a one sentence synopsis that is informative (and concise) enough to attract the attention of users, developers, and maintainers who might be impacted by the change.\n-   * Add the `release-note` label to the sub-task.\n-   * Add the proper `RN-`label (see below) to the release note sub-task.\n-   * Assign the sub-task to the person who should write the release note.\n-   * Set the Fix Version of the sub-task to the same value that the main issue has.\n-   * Enter the text of the release note in the **Description** field. Some markdown formatting is available (even though it's not rendered in JBS).\n+#. Do these steps for the main issue, that is, the JBS issue that is used to push the original change, **not** on backports or the CSR (if there is one).\n+   * Add the label `release-note=yes`.\n+   * Create a sub-task.\n+#. For the newly created sub-task do these steps:\n+   * The **Summary** should be a one sentence synopsis that is informative (and concise) enough to attract the attention of users, developers, and maintainers who might be impacted by the change. The **Summary** should succinctly describe what has actually changed, not be the original bug title, nor describe the problem that was being solved. It should read well as a sub-section heading in a document.\n+   * Prefix the **Summary** with \"Release Note:\".\n+   * Add the `release-note` label.\n+   * Add the proper `RN-`label (see below).\n+   * Add an **Assignee**.\n+   * Set the **Fix Version** to the same value that the main issue has.\n+   * Enter the text of the release note in the **Description** field using markdown formatting (even though it won't be rendered in JBS).\n","filename":"src\/index.md","additions":14,"deletions":12,"binary":false,"changes":26,"status":"modified"}]}