{"files":[{"patch":"@@ -0,0 +1,53 @@\n+\/*\n+ * Copyright (c) 2025, Oracle and\/or its affiliates. All rights reserved.\n+ * DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER.\n+ *\n+ * This code is free software; you can redistribute it and\/or modify it\n+ * under the terms of the GNU General Public License version 2 only, as\n+ * published by the Free Software Foundation.\n+ *\n+ * This code is distributed in the hope that it will be useful, but WITHOUT\n+ * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\n+ * FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License\n+ * version 2 for more details (a copy is included in the LICENSE file that\n+ * accompanied this code).\n+ *\n+ * You should have received a copy of the GNU General Public License version\n+ * 2 along with this work; if not, write to the Free Software Foundation,\n+ * Inc., 51 Franklin St, Fifth Floor, Boston, MA 02110-1301 USA.\n+ *\n+ * Please contact Oracle, 500 Oracle Parkway, Redwood Shores, CA 94065 USA\n+ * or visit www.oracle.com if you need additional information or have any\n+ * questions.\n+ *\/\n+\n+import java.nio.file.Files;\n+import java.nio.file.Path;\n+\n+import jdk.test.lib.process.OutputAnalyzer;\n+\n+\/**\n+ * @test\n+ * @summary Tests that if a class is listed as unregistered it will be archived\n+ * as such even if it is on classpath (i.e. it will not be loaded by the app\n+ * loader).\n+ *\n+ * @requires vm.cds\n+ * @requires vm.cds.custom.loaders\n+ * @library \/test\/lib \/test\/hotspot\/jtreg\/runtime\/cds\/appcds\n+ * @compile test-classes\/CustomLoadee.java\n+ * @run main ClassFromClasspath\n+ *\/\n+public class ClassFromClasspath {\n+    public static void main(String[] args) throws Exception {\n+        Files.copy(Path.of(System.getProperty(\"test.classes\"), \"CustomLoadee.class\"), Path.of(\"CustomLoadee.class\"));\n+        final String classlist[] = new String[] {\n+            \"java\/lang\/Object id: 0\",\n+            \"CustomLoadee id: 1 super: 0 source: .\",\n+        };\n+        \/\/ Note: if you get a HotSpot crash here in a debug build it is probably because of an\n+        \/\/ assertion in HotSpot CDS code that performs the same check as this test\n+        final OutputAnalyzer out = TestCommon.testDump(null, classlist, \"-Xlog:cds+class=debug\");\n+        out.shouldContain(\"unreg CustomLoadee\");\n+    }\n+}\n","filename":"test\/hotspot\/jtreg\/runtime\/cds\/appcds\/customLoader\/ClassFromClasspath.java","additions":53,"deletions":0,"binary":false,"changes":53,"status":"added"}]}