{"files":[{"patch":"@@ -48,3 +48,13 @@\n- * conformant, and failure to do so will result in undefined behavior. When a\n- * program exhibits undefined behavior, there is no restrictions on its\n- * behaviors. Such behaviors may include but not be limited to:\n+ * conformant, and failure to do so will result in undefined behavior. The\n+ * runtime and the JIT compiler may assume that undefined behavior never\n+ * happens, and operate accordingly. For example, the runtime assumes that each\n+ * object has a header with a particular layout, and if the users use\n+ * {@code Unsafe} to overwrite this header with invalid data, the behavior of\n+ * the runtime becomes unpredictable. Another example is that the JIT compiler\n+ * may assume that accesses on separate objects are unrelated, and schedule\n+ * each of them without taking into consideration the others. If there is an\n+ * {@code Unsafe} access that is out of bounds and points to object different\n+ * from the declared base, the program may execute in a way that a variable\n+ * seems to have multiple values at the same time. As a result, when a program\n+ * exhibits undefined behavior, there is no restrictions on its behaviors. Such\n+ * behaviors may include but not be limited to:\n@@ -62,0 +72,3 @@\n+ * Undefined behavior, as described in this class, is analogous to the\n+ * terminology with the same name in the C++ language.\n+ * <p>\n@@ -68,0 +81,1 @@\n+ * The analogous terminology in C++ is that such programs are ill-formed.\n@@ -73,1 +87,5 @@\n- * even before the invocation of the {@code Unsafe} method.\n+ * even before the invocation of the {@code Unsafe} method. This is because the\n+ * JIT compiler may have certain assumptions about the inputs of an\n+ * {@code Unsafe} invocation, these assumptions may propagate backward to\n+ * previous statements, leading to wrong executions if the assumptions are\n+ * invalid.\n","filename":"src\/java.base\/share\/classes\/jdk\/internal\/misc\/Unsafe.java","additions":22,"deletions":4,"binary":false,"changes":26,"status":"modified"}]}