{"files":[{"patch":"@@ -1564,1 +1564,1 @@\n-   * Enter the text of the release note in the [Description]{.jbs} field using markdown formatting, following the [CommonMark specification](https:\/\/spec.commonmark.org\/current\/). Markdown won't be rendered in JBS. You can use [dingus](https:\/\/spec.commonmark.org\/dingus\/) to see what the release note will look like. Note that ascii table formatting is supported but will not display correctly in the dingus page. For more information see [General Conventions for Release Notes](#general-conventions-for-release-notes) below.\n+   * Enter the text of the release note in the [Description]{.jbs} field using markdown formatting, following the [CommonMark specification](https:\/\/spec.commonmark.org\/current\/). While the markdown won't be rendered in JBS, you can use [dingus](https:\/\/spec.commonmark.org\/dingus\/) to see what the release note will look like. Note that [Github stlye ascii table formatting](https:\/\/docs.github.com\/en\/get-started\/writing-on-github\/working-with-advanced-formatting\/organizing-information-with-tables) is supported but will not display correctly in the dingus page. For more information see [General Conventions for Release Notes](#general-conventions-for-release-notes) below.\n@@ -1566,1 +1566,1 @@\n-#. Ask your Reviewers to have a look at the release note. Ideally you should have the release note reviewed at the same time as the code is reviewed. If it's later determined that a release note is necessary, then go back to the same engineers who reviewed the fix to review the release note.  Special care should be taken when writing a release note that will cover changes related to a vulnerability fix in order to avoid describing the vulnerability in a way that someone can better understand how to exploit it.\n+#. Have the release note ready to be reviewed at the same time as the code is reviewed. If it's later determined that a release note is necessary, then go back to the same engineers who reviewed the fix to review the release note.  Special care should be taken when writing a release note that will cover changes related to a vulnerability fix in order to avoid describing technical details of how it could have been exploited.\n","filename":"src\/index.md","additions":2,"deletions":2,"binary":false,"changes":4,"status":"modified"}]}