{"files":[{"patch":"@@ -24,3 +24,5 @@\n- * acknowledged once it has been processed by the caller. Failing to\n- * acknowledge makes the next call include everything from the last call\n- * again. This helps to avoid missing any updates due to errors.\n+ * acknowledged once it has been processed by the caller using the\n+ * lastBatchHandled method. Failing to acknowledge makes the next call include\n+ * everything from the last call again. This helps to avoid missing any updates\n+ * due to errors. Calling the retry\/quarantine methods before lastBatchHandled\n+ * for any particular PR will cause that PR to be lost.\n@@ -140,0 +142,7 @@\n+     * <p>\n+     * This method must be called before any retry\/quarantine method is called for a pr\n+     * returned by the last updatedPullRequest call, otherwise retries may be lost.\n+     * <p>\n+     * The typical pattern is to call this last in the getPeriodicItems\/run method of a\n+     * bot or WorkItem, before any generated WorkItems are published (by being returned\n+     * to the bot runner).\n@@ -161,2 +170,2 @@\n-     * Schedules a pull request to be re-evaluated after a certain time, unless it is\n-     * updated before that.\n+     * Schedules a pull request to be included in the next update that happens after a\n+     * certain time, unless it is updated before that. Can be used to throttle retries.\n@@ -171,3 +180,4 @@\n-     * Schedules a pull request to be retried after a quarantine period has passed.\n-     * If a quarantined pull request is returned by a query, it will be removed from\n-     * the result set until the quarantine time has passed.\n+     * Schedules a pull request to be included in the next update that happens after a\n+     * quarantine period has passed. If a quarantined pull request is returned by a\n+     * query, it will be removed from the result set until the quarantine time has\n+     * passed.\n","filename":"forge\/src\/main\/java\/org\/openjdk\/skara\/forge\/PullRequestPoller.java","additions":18,"deletions":8,"binary":false,"changes":26,"status":"modified"}]}