{"files":[{"patch":"@@ -1232,1 +1232,18 @@\n-            \/\/ fields can't be varargs, lets remove the flag\n+            \/** Some notes regarding the code below. Annotations applied to elements of a record header are propagated\n+             *  to other elements which, when applicable, not explicitly declared by the user: the canonical constructor,\n+             *  accessors, fields and record components. Of all these the only ones that can't be explicitly declared are\n+             *  the fields and the record components.\n+             *\n+             *  Now given that annotations are propagated to all possible targets  regardless of applicability,\n+             *  annotations not applicable to a given element should be removed. See Check::validateAnnotation. Once\n+             *  annotations are removed we could lose the whole picture, that's why original annotations are stored in\n+             *  the record component, see RecordComponent::originalAnnos, but there is no real AST representing a record\n+             *  component so if there is an annotation processing round it could be that we need to reenter a record for\n+             *  which we need to re-attribute its annotations. This is why one of the things the code below is doing is\n+             *  copying the original annotations from the record component to the corresponding field, again this applies\n+             *  only if APs are present.\n+             *\n+             *  We need to copy the annotations to the field so that annotations applicable only to the record component\n+             *  can be attributed as if declared in the field and then stored in the metadata associated to the record\n+             *  component.\n+             *\/\n@@ -1236,1 +1253,1 @@\n-                TreeCopier<JCTree> tc = new TreeCopier<JCTree>(make.at(field.pos));\n+                TreeCopier<JCTree> tc = new TreeCopier<>(make.at(field.pos));\n@@ -1240,0 +1257,1 @@\n+\n@@ -1241,0 +1259,2 @@\n+                    \/\/ if the field have less annotations than the record component, overwrite any annotation in the\n+                    \/\/ field with the original annotations declared by the user\n@@ -1244,0 +1264,1 @@\n+                    \/\/ fields can't be varargs, lets remove the flag if present\n@@ -1246,0 +1267,1 @@\n+                \/\/ also here\n","filename":"src\/jdk.compiler\/share\/classes\/com\/sun\/tools\/javac\/comp\/TypeEnter.java","additions":24,"deletions":2,"binary":false,"changes":26,"status":"modified"}]}