{"files":[{"patch":"@@ -70,1 +70,3 @@\n-<p>Proposed changes should be discussed on the <a href=\"mailto:hotspot-dev@openjdk.java.net\">HotSpot Developers<\/a> mailing list, and approved by <a href=\"https:\/\/en.wikipedia.org\/wiki\/Rough_consensus\">rough consensus<\/a> of the <a href=\"https:\/\/openjdk.java.net\/census#hotspot\">HotSpot Group<\/a> Members. The Group Lead determines whether consensus has been reached. Changes are likely to be cautious and incremental, since HotSpot coders have been using these guidelines for years.<\/p>\n+<p>Proposed changes should be discussed on the <a href=\"mailto:hotspot-dev@openjdk.java.net\">HotSpot Developers<\/a> mailing list. Changes are likely to be cautious and incremental, since HotSpot coders have been using these guidelines for years.<\/p>\n+<p>Substantive changes are approved by <a href=\"https:\/\/en.wikipedia.org\/wiki\/Rough_consensus\">rough consensus<\/a> of the <a href=\"https:\/\/openjdk.java.net\/census#hotspot\">HotSpot Group<\/a> Members. The Group Lead determines whether consensus has been reached.<\/p>\n+<p>Editorial changes (changes that only affect the description of HotSpot style, not its substance) do not require the full consensus gathering process. The normal HotSpot pull request process may be used for editorial changes, with the additional requirement that the requisite reviewers are also HotSpot Group Members.<\/p>\n","filename":"doc\/hotspot-style.html","additions":3,"deletions":1,"binary":false,"changes":4,"status":"modified"},{"patch":"@@ -59,1 +59,4 @@\n-list, and approved by\n+list.  Changes are likely to be cautious and incremental, since HotSpot\n+coders have been using these guidelines for years.\n+\n+Substantive changes are approved by\n@@ -63,2 +66,6 @@\n-Changes are likely to be cautious and incremental, since HotSpot\n-coders have been using these guidelines for years.\n+\n+Editorial changes (changes that only affect the description of HotSpot\n+style, not its substance) do not require the full consensus gathering\n+process.  The normal HotSpot pull request process may be used for\n+editorial changes, with the additional requirement that the requisite\n+reviewers are also HotSpot Group Members.\n","filename":"doc\/hotspot-style.md","additions":10,"deletions":3,"binary":false,"changes":13,"status":"modified"}]}