{"files":[{"patch":"@@ -129,6 +129,28 @@\n-\/\/       Integer o = new Integer(v);\n-\/\/       *p = o;\n-\/\/       int x = o.value;\n-\/\/   In this case, even if the load x = o.value is declared after the store of o to p that allows o\n-\/\/   to escape, it is valid for the load to actually happen before the store. As a result, we can\n-\/\/   consider x = o.value to be a load from an object that has not escaped, and fold it to v.\n+\/\/     1.  Integer o = new Integer(v);\n+\/\/         *p = o;\n+\/\/         int x = o.value;\n+\/\/     In this case, even if the load x = o.value is declared after the store of o to p that allows o\n+\/\/     to escape, it is valid for the load to actually happen before the store. If the developer\n+\/\/     wants to ensure that the order in which the memory accesses appear in the program is the same\n+\/\/     as the order they are executed, memory barriers (e.g. a store-load barrier) must be placed\n+\/\/     between them. As a result, we can consider x = o.value to be a load from an object that has\n+\/\/     not escaped, and fold it to v.\n+\/\/     2.  boolean b1, b2;\n+\/\/         Point o = new Point(v1, v2);\n+\/\/         int r;\n+\/\/         if (b1) {\n+\/\/           *p = o;\n+\/\/         } else {\n+\/\/           *q = o;\n+\/\/         }\n+\/\/         if (b2) {\n+\/\/           r = o.x;\n+\/\/         } else {\n+\/\/           r = o.y;\n+\/\/         }\n+\/\/     In this case, even if the control flow forces the loads to be scheduled after the stores\n+\/\/     that allow o to escape, without actual memory barriers, the JMM does not require the CPU to\n+\/\/     execute the loads after the stores (e.g. the loads are in cache so it can be executed sooner\n+\/\/     while the stores need to wait for the acquisition of the corresponding cache lines). As a\n+\/\/     result, we can consider those loads to be loads from an object that has not escaped, and\n+\/\/     fold o.x to v1 and o.y to v2.\n","filename":"src\/hotspot\/share\/opto\/phaseloadfolding.cpp","additions":28,"deletions":6,"binary":false,"changes":34,"status":"modified"}]}