{"files":[{"patch":"@@ -377,1 +377,2 @@\n-     * to locate implementations of the RandomGenerator interface.\n+     * to locate implementations of the RandomGenerator interface. RandomGenerators that are marked\n+     * as deprecated or are not properly configured are not included in the result.\n@@ -380,0 +381,2 @@\n+     *\n+     * @hidden\n@@ -392,1 +395,1 @@\n-     * Returns a a non-empty stream of all available {@link RandomGeneratorFactory RandomGeneratorFactory(s)}.\n+     * Returns a non-empty stream of available {@link RandomGeneratorFactory RandomGeneratorFactory(s)}.\n@@ -396,1 +399,1 @@\n-     * as deprecated are not included in the result.\n+     * as deprecated or are not properly configured are not included in the result.\n","filename":"src\/java.base\/share\/classes\/java\/util\/random\/RandomGeneratorFactory.java","additions":6,"deletions":3,"binary":false,"changes":9,"status":"modified"},{"patch":"@@ -30,7 +30,7 @@\n- * <p>These classes and interfaces that support the definition and use of \"random\n- * generators\", a term that is meant to cover what have traditionally been\n- * called \"random number generators\" as well as generators of other sorts of\n- * randomly chosen values, and also to cover not only deterministic\n- * (pseudorandom) algorithms but also generators of values that use some \"truly\n- * random\" physical source (perhaps making use of thermal noise, for example, or\n- * quantum-mechanical effects).\n+ * <p>These classes and interfaces support the definition and use of \"random\n+ * generators\", a term covering what have traditionally been called \"random\n+ * number generators\" as well as generators of other sorts of randomly chosen\n+ * values (eg. booleans). These classes and interfaces cover not only\n+ * deterministic (pseudorandom) algorithms but also generators of values that\n+ * use some \"truly random\" physical source (stochastic algorithms perhaps making\n+ * use of thermal noise, for example, or quantum-mechanical effects).\n@@ -104,1 +104,1 @@\n- * values from nonuniform distributions. The method\n+ * values from nonuniform distributions.\n@@ -197,1 +197,1 @@\n- * cards, the number of possible permutations is 52! (52 factorial), \\ which is\n+ * cards, the number of possible permutations is 52! (52 factorial), which is\n@@ -208,1 +208,1 @@\n- * <h2><a id=\"algorithms\">Random Number Generator Algorithms Available.<\/a><\/h2>\n+ * <h2><a id=\"algorithms\">Random Number Generator Algorithms Available<\/a><\/h2>\n","filename":"src\/java.base\/share\/classes\/java\/util\/random\/package-info.java","additions":10,"deletions":10,"binary":false,"changes":20,"status":"modified"}]}