{"files":[{"patch":"@@ -19,1 +19,1 @@\n-When filing an Issue, try to make the report as complete as possible in order to make it easier to triage, investigate and resolve the issue.\n+When filing an issue, try to make the report as complete as possible in order to make it easier to triage, investigate and resolve the issue.\n@@ -21,1 +21,1 @@\n-#### Types of Issues\n+#### Types of issues\n@@ -23,1 +23,1 @@\n-The most common **Issue** types are:\n+The most common **issue** types are:\n@@ -41,1 +41,1 @@\n-    <td class=\"dictionary\">For a proposal of a significant change or new feature which will take 4 weeks or more of work - see [JEP-1](https:\/\/openjdk.org\/jeps\/1).<\/td>\n+    <td class=\"dictionary\">For a proposal of a significant change or new feature which will take 4 or more weeks of work - see [JEP-1](https:\/\/openjdk.org\/jeps\/1).<\/td>\n@@ -49,1 +49,1 @@\n-    <td class=\"dictionary\"> Tasks are used to track work that is not expected to result in a change in any code repository. They are used to track non-repo changes or related activities such as a new JBS version number, a build request, an update to a document etc.<\/td>\n+    <td class=\"dictionary\"> Tasks are used to track work that is not expected to result in a change in any code repository. They are used related activities such as a new JBS version number, a build request, an update to a document etc.<\/td>\n@@ -54,2 +54,2 @@\n-* If you suspect that the issue is a vulnerability, **don't file a JBS issue**, instead send your report to [vuln-report@openjdk.org](mailto:vuln-report@openjdk.org), also use this alias if you find an existing report which may be a vulnerability. Please do *not* report or discuss potential vulnerabilities on any open lists or other public channels - see [OpenJDK Vulnerabilities](https:\/\/openjdk.org\/groups\/vulnerability\/report) for more information.\n-* a [Bug]{.jbs} or [Enhancement]{.jbs-field} should only be used if the work is expected to result in a change in a code repository. A [Bug]{.jbs-field} or [Enhancement]{.jbs-field} with resolution Fixed is required to have a corresponding changeset in one of the OpenJDK repositories.\n+* If you suspect that the issue is a vulnerability, **don't file a JBS issue**, instead send your report to [vuln-report@openjdk.org](mailto:vuln-report@openjdk.org). Also use this alias if you find an existing report which may be a vulnerability - please do *not* report or discuss potential vulnerabilities on any open lists or other public channels - see [OpenJDK Vulnerabilities](https:\/\/openjdk.org\/groups\/vulnerability\/report) for more information.\n+* A [Bug]{.jbs} or [Enhancement]{.jbs-field} should only be used if the work is expected to result in a change in a code repository. A [Bug]{.jbs-field} or [Enhancement]{.jbs-field} with resolution Fixed is required to have a corresponding changeset in one of the OpenJDK repositories.\n@@ -79,1 +79,1 @@\n-* If the information provided is long it should be added as attachments\n+    * If the information provided is long it should be added as attachments\n@@ -92,1 +92,1 @@\n-* Unlike reporting a problem, when it comes to improvements what constitutes a reasonable request can take discussion, and in general it is encouraged that the mailing list for the area is used to suggest an improvement before filing.\n+* Unlike reporting a problem, when it comes to improvements, what constitutes a reasonable request can take discussion, and in general it is encouraged that the mailing list for the area is used to suggest an improvement before filing.\n@@ -101,1 +101,1 @@\n-It recommended that for [JEP]{.jbs-field}s that the implementation is spread across one or more [Enhancement]{.jbs-field}s as above.\n+It is recommended that for [JEP]{.jbs-field}s that the implementation is spread across one or more [Enhancement]{.jbs-field}s as above.\n@@ -190,1 +190,1 @@\n-1. Ensure the 'Affects Version\/s' field is correct (within reason)\n+1. Ensure the [Affects Version]{jbs-field}\/s field is correct (within reason)\n@@ -195,1 +195,1 @@\n-1. Set the 'Fix Version'\n+1. Set the [Fix Version]{.jbs-field}\n@@ -205,1 +205,1 @@\n-    1. RFEs that are pure cleanups: 'noreg-cleanup'\n+    1. Enhancements that are pure cleanups: 'noreg-cleanup'\n@@ -218,1 +218,1 @@\n-Once you are made, or you make yourself, the assignee of an Issue you take on the responsibility of moving the issue through to resolution and providing the current status, and ultimately leaving a record for others in the future to understand what happened.  There are no set rules for how you manage the bug while you are assigned to it, as it depends on the type and importance of an issue.  A simple update to the doc needs little to be done, fix the problem and close the issue; an intricate timing issue or crash should be handled differently - documenting your progress in identifying the problem (for example\n+Once you are made, or you make yourself, the assignee of an issue you take on the responsibility of moving the issue through to resolution - providing the current status, and ultimately leaving a record for others in the future to understand what happened.  There are no set rules for how you manage the bug while you are assigned to it, as it depends on the type and importance of an issue.  A simple update to the doc needs little to be done, fix the problem and close the issue; an intricate timing issue or crash should be handled differently - documenting your progress in identifying the problem (for example\n@@ -222,1 +222,1 @@\n-), this is especially helpful if you ultimately move the Issue to a different area as you have found that the problem lies elsewhere, or is closed as [Will Not Fix]{.jbs-field}.  Your updates then provide a resource to others to better understand what has been done or the code. See [The Importance of Writing Stuff Down](https:\/\/stuartmarks.wordpress.com\/2023\/02\/22\/the-importance-of-writing-stuff-down) for a good explanation as to why it is important.\n+), this is especially helpful if you ultimately move the issue to a different area as you have found that the problem lies elsewhere, or is closed as [Will Not Fix]{.jbs-field}.  Your updates then provide a resource to others to better understand what has been done or the code itself. See [The Importance of Writing Stuff Down](https:\/\/stuartmarks.wordpress.com\/2023\/02\/22\/the-importance-of-writing-stuff-down) for a good explanation as to why it is important.\n@@ -225,1 +225,1 @@\n-- for a regression, if you identify the fix that caused it add a link to that issue (and add a [regression_]{.jbs-field}*(ID)* label) and set the _Introduced in Release_ field.\n+- for a regression, if you identify the fix that caused it, add a link to that issue (and add a [regression_]{.jbs-field}*(ID)* label) and set the _Introduced in Release_ field.\n@@ -238,1 +238,1 @@\n-        <li>Once a bug is marked as fixed there is now the option of someone, other than the person that fixed it, marking it as [Verified]{.jbs-field} to confirm that the issue is fix after testing; marking it as [Fix Failed]{.jbs-field} if it did not solve the issue; or, [Not Verified]{.jbs-field} to indicate that it wasn't explicitly tested.  Note that the UI does not highlight when [Fix Failed]{.jbs-field} has been set, you need to look for the [Verification]{.jbs-label} Field at the bottom of the left-hand colum in the Details section.<\/li>\n+        <li>Once a bug is marked as fixed there is now the option of someone, other than the person that fixed it, of marking it as [Verified]{.jbs-field} to confirm that the issue is fixed after testing; marking it as [Fix Failed]{.jbs-field} if it did not solve the issue; or, [Not Verified]{.jbs-field} to indicate that it wasn't explicitly tested.  Note that the UI does not highlight when [Fix Failed]{.jbs-field} has been set, you need to look for the [Verification]{.jbs-label} field at the bottom of the left-hand colum in the Details section.<\/li>\n@@ -250,2 +250,2 @@\n-    <td class=\"dictionary\">Where the same issue is described in another issue then close one against the other as a [Duplicate]{.jbs-field}. In general the new issue is closed as a duplicate of the older one, but where the newer issue has a clearer description then doing it the other way round is ok. <br \/>\n-     Note: if you use \"Close\" button then you get the UI that allows you to set the Resolution as \"Duplicate\" and link to the issue which is duplicated. However, if you use \"Resolve\" then the ability to add the link in the UI is not there, and you need to make sure you remember to manually link in the duplicate issue.<\/td>\n+    <td class=\"dictionary\">Where the same issue is described in another issue then close one against the other as a [Duplicate]{.jbs-field}. In general the newer issue is closed as a duplicate of the older one, but where the newer issue has a clearer description then doing it the other way round is ok. <br \/>\n+     Note: if you use \"Close\" button when closing the issue, then you get the UI that allows you to set the Resolution as [Duplicate]{.jbs-field} and link to the issue which is duplicated; however, if you use \"Resolve\" then the ability to add the link in the UI is not there, and you need to make sure you remember to manually link in the duplicate issue.<\/td>\n@@ -668,1 +668,1 @@\n-      Used to identify regressions. A regression is where behavior has _incorrectly_ changed from a previous build or release. Ideally all regressions must be fixed in the following release. All regressions must have the [Affects Version\/s]{.jbs-field} set.\n+      Used to identify regressions. A regression is where behavior has _incorrectly_ changed from a previous build or release. Ideally all regressions are identified and fixed before they are released, if not they must be fixed at latest in the following release after they are identified. All regressions must have the [Affects Version\/s]{.jbs-field} set.\n","filename":"src\/guide\/jbs-jdk-bug-system.md","additions":20,"deletions":20,"binary":false,"changes":40,"status":"modified"}]}