{"files":[{"patch":"@@ -46,1 +46,1 @@\n-- Never work on an issue that is assigned to someone else. Duplicating work is pointless. If you think that an issue should be fixed and it has been assinged to someone for a long time without progress, reach out to that person and ask what the current status is. Many issues requires a lot of thought, and there may be half-baked solutions that you can build on to avoid the traps the initial developer has already fallen into.\n+- Never work on an issue that is assigned to someone else. Duplicating work is pointless. If you think that an issue should be fixed and it has been assigned to someone for a long time without progress, reach out to that person and ask what the current status is. Many issues require a lot of thought, and there may be half-baked solutions that you can build on to avoid the traps the initial developer has already fallen into.\n","filename":"src\/guide\/contributing-to-an-open-jdk-project.md","additions":1,"deletions":1,"binary":false,"changes":2,"status":"modified"},{"patch":"@@ -652,1 +652,1 @@\n-      The [noreg-]{.jbs-label}`.*` and [nounit-]{.jbs-label}`.*` labels are used to explain why a change doesn't need\/have a regression test or a unit test. The suffix of the label is described below. Every change that is integrated into the JDK source code must either have a regression\/unit test, or have at least one of these labels on its JBS issue. It's quite possible to have more than one of these labels on the same issue. For instance, an integration could contain both changes to documentation and test code. In that case it would be logical to label the issue with both [noreg-doc]{.jbs-label} and [noreg-self]{.jbs-label}.\n+      The [noreg-]{.jbs-label}`.*` and [nounit-]{.jbs-label}`.*` labels are used to explain why a change doesn't need\/have a regression test or a unit test. The suffix of the label is described below. Every change that is integrated into the JDK source code must either have a regression\/unit test, or have at least one of these labels on its JBS issue. It's possible to have more than one of these labels on the same issue. For instance, a changeset could modify both documentation and test code. In that case it would be logical to label the issue with both [noreg-doc]{.jbs-label} and [noreg-self]{.jbs-label}.\n","filename":"src\/guide\/jbs-jdk-bug-system.md","additions":1,"deletions":1,"binary":false,"changes":2,"status":"modified"}]}