{"files":[{"patch":"@@ -52,1 +52,9 @@\n-  __ membar(__ AnyAny);\n+\n+  if (is_c1_or_interpreter_only()) {\n+    \/\/ The membar here is necessary to prevent reordering between the\n+    \/\/ release store in the CAS above and a subsequent volatile load.\n+    \/\/ However for tiered compilation C1 inserts a full barrier before\n+    \/\/ volatile loads which means we don't need an additional barrier\n+    \/\/ here (see LIRGenerator::volatile_field_load()).\n+    __ membar(__ AnyAny);\n+  }\n","filename":"src\/hotspot\/cpu\/aarch64\/gc\/shenandoah\/c1\/shenandoahBarrierSetC1_aarch64.cpp","additions":9,"deletions":1,"binary":false,"changes":10,"status":"modified"},{"patch":"@@ -462,16 +462,4 @@\n-\/\/ By default, this operation has relaxed memory ordering and the value\n-\/\/ held in the result register following execution of the generated code\n-\/\/ sequence is 0 to indicate failure of CAS, non-zero to indicate\n-\/\/ success.  Arguments support variations on this theme:\n-\/\/\n-\/\/  acquire: Load from addr has acquire semantics.\n-\/\/\n-\/\/  release: Store to addr has release semantics.\n-\/\/\n-\/\/  is_cae:  This turns CAS (compare and swap) into CAE (compare and\n-\/\/           exchange).  This HotSpot convention is that CAE makes\n-\/\/           available to the caller the \"failure witness\", which is\n-\/\/           the value that was stored in memory which did not match\n-\/\/           the expected value.  If is_cae, the result is the value\n-\/\/           most recently fetched from addr rather than a boolean\n-\/\/           success indicator.\n+\/\/ By default the value held in the result register following execution\n+\/\/ of the generated code sequence is 0 to indicate failure of CAS,\n+\/\/ non-zero to indicate success. If is_cae, the result is the value most\n+\/\/ recently fetched from addr rather than a boolean success indicator.\n","filename":"src\/hotspot\/cpu\/aarch64\/gc\/shenandoah\/shenandoahBarrierSetAssembler_aarch64.cpp","additions":4,"deletions":16,"binary":false,"changes":20,"status":"modified"}]}