{"files":[{"patch":"@@ -58,1 +58,1 @@\n-A few things to keep in mind when filing an issue to report a problem:\n+A few things to keep in mind when filing an issue:\n@@ -60,1 +60,1 @@\n-* Before filing, verify that there isn't an issue already filed.\n+* Before filing, verify that there isn't an open issue already filed,\n@@ -62,0 +62,1 @@\n+    * if you find a similar issue that was closed as \"not reproducible\" then it may be appropriate to re-open that one - if you don't have direct access to JBS you can file a bug at [bugs.java.com](https:\/\/java.bugs.com) requesting that it be reopened.\n@@ -68,2 +69,3 @@\n-    * It's not the reporter's responsibility to set a correct priority, but a qualified guess is always better than the default.\n-    * To help with setting the right priority, consider things like how the bug impacts the product and our testing, how likely is it that the bug is triggered, how difficult is it to work around, and whether it's a regression, since that may break existing applications. Regressions are often higher priority than long-standing bugs and may block a release if not fixed. An example of a P1 would be an issue that is blocking a build or a release, whereas a P5 would be a minor typo in a code comment - most bugs will be P3 or P4.\n+    * It's not the reporter's responsibility to set a correct priority, but a qualified guess is always better than the default - in JBS the range of priorities go from P1 (High\/Important) to P5 (Very Low\/Not Important), with the default being P4.\n+    *  If you have a sense that the issue is critical, or not critical at all, then adjusting the priority higher or lower makes sense, otherwise leave it as the default.\n+    * When setting the priority, consider things like how the bug impacts the product and our testing, how likely is it that the bug is triggered, how difficult is it to work around, and whether it's a regression, since that may break existing applications. Regressions are often higher priority than long-standing bugs and may block a release if not fixed. An example of a P1 would be an issue that is blocking a build or a release, whereas a P5 would be a minor typo in a code comment.\n@@ -77,0 +79,1 @@\n+* If the information provided is long it should be added as attachments\n@@ -82,1 +85,1 @@\n-* Only set [CPU]{.jbs-field} and\/or [OS]{.jbs-field} fields if the bug **ONLY** happens on that particular platform or set of platforms.\n+* In general the [CPU]{.jbs-field} and\/or [OS]{.jbs-field} fields should not be set. **ONLY** use them if you know that the issue is only relevant to a particular platform or set of platforms.\n@@ -112,1 +115,1 @@\n-    <td class=\"dictionary\">Most straightforward issues stay in this state until they are closed.  If the issue has some attention then use [In Progress]{.jbs-field} to show more clearly that the issue is being worked<\/td>\n+    <td class=\"dictionary\">Once the issue has been triaged it will be in the [Open]{.jbs-field} state and will stay here until the assignee decides to work on it, at which point it is encouraged that the \"Start Work\" option be selected to move it to [In Progress]{.jbs-field}<\/td>\n","filename":"src\/guide\/jbs-jdk-bug-system.md","additions":9,"deletions":6,"binary":false,"changes":15,"status":"modified"}]}