{"files":[{"patch":"@@ -29,1 +29,1 @@\n-    <td class=\"dictionary\">A \"bug\" should relate to functional correctness - a deviation from behavior that can be tied back to a specification. Anything else, including performance concerns, is generally not a bug, but an enhancement. Though it is not clear cut as a significant performance regression may be classified as a \"bug\", for example.<\/td>\n+    <td class=\"dictionary\">A \"bug\" should relate to functional correctness - a deviation from behavior that can be tied back to a specification. Anything else, including performance concerns, is generally not a bug, but an enhancement. Though it is not clear-cut as a significant performance regression may be classified as a \"bug\", for example.<\/td>\n@@ -212,1 +212,1 @@\n-It may sound obvious, but avoid placing sensitive information in bug reports. Things like user names, IP addresses, host names, and exact version information of third party libraries etc may be crucial to be able to debug in some cases, but could also help an attacker gain information about your system. JBS is a public database that anyone can search, so be mindful of what you place there. In particular when attaching log files like the hs_err.log you should make sure that you are comfortable with sharing the details exposed in it. Sometimes it may be better to leave a comment saying that these details can be obtained on request.\n+It may sound obvious, but avoid placing sensitive information in bug reports. Things like usernames, IP addresses, host names, and exact version information of third party libraries etc. may be crucial to be able to debug in some cases, but could also help an attacker gain information about your system. JBS is a public database that anyone can search, so be mindful of what you place there. In particular when attaching log files like the hs_err.log you should make sure that you are comfortable sharing the details exposed in it. Sometimes it may be better to leave a comment saying that these details can be obtained on request.\n@@ -243,1 +243,1 @@\n-    If you know that an issue was fixed, try searching for the issue that resolved it and close it as a duplicate of that issue. If that would entail a significant effort, and\/or it isn't a critical issue, close it out as Not Reproducible.<br \/>\n+    If you know that an issue was fixed, try searching for the issue that resolved it and close it as a duplicate of that issue. If that entails a significant effort, and\/or it isn't a critical issue, close it out as Not Reproducible.<br \/>\n@@ -408,1 +408,1 @@\n-      Used to indicate that *(Team)* has triaged this issue for release *(Rel)*. It's encouraged that all open bugs are triaged on a regular basis so that old bugs aren't forgotten. It's therefore common to see several triage labels on the same issue which helps keeping track of which bugs has been triaged for each release. E.g., [oracle-triage-13]{.jbs-label}\n+      Used to indicate that *(Team)* has triaged this issue for release *(Rel)*. It's encouraged that all open bugs are triaged on a regular basis so that old bugs aren't forgotten. It's therefore common to see several triage labels on the same issue which helps keeping track of which bugs have been triaged for each release. E.g., [oracle-triage-13]{.jbs-label}\n","filename":"src\/guide\/jbs-jdk-bug-system.md","additions":4,"deletions":4,"binary":false,"changes":8,"status":"modified"}]}