{"files":[{"patch":"@@ -4,29 +4,69 @@\n-```\n-\n-Copyright (c) OASIS Open 2019. All Rights Reserved.\n-\n-All capitalized terms in the following text have the meanings assigned to them in the OASIS\n-Intellectual Property Rights Policy (the \"OASIS IPR Policy\"). The full Policy may be found at the\n-OASIS website: [http:\/\/www.oasis-open.org\/policies-guidelines\/ipr]\n-\n-This document and translations of it may be copied and furnished to others, and derivative works\n-that comment on or otherwise explain it or assist in its implementation may be prepared, copied,\n-published, and distributed, in whole or in part, without restriction of any kind, provided that\n-the above copyright notice and this section are included on all such copies and derivative works.\n-However, this document itself may not be modified in any way, including by removing the copyright\n-notice or references to OASIS, except as needed for the purpose of developing any document or\n-deliverable produced by an OASIS Technical Committee (in which case the rules applicable to\n-copyrights, as set forth in the OASIS IPR Policy, must be followed) or as required to translate it\n-into languages other than English.\n-\n-The limited permissions granted above are perpetual and will not be revoked by OASIS or its\n-successors or assigns.\n-\n-This document and the information contained herein is provided on an \"AS IS\" basis and OASIS\n-DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE\n-USE OF THE INFORMATION HEREIN WILL NOT INFRINGE ANY OWNERSHIP RIGHTS OR ANY IMPLIED WARRANTIES OF\n-MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. OASIS AND ITS MEMBERS WILL NOT BE LIABLE FOR\n-ANY DIRECT, INDIRECT, SPECIAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF ANY USE OF THIS DOCUMENT OR\n-ANY PART THEREOF.\n-\n-```\n+<pre>\n+\n+Copyright © OASIS Open 2020. All Rights Reserved.\n+\n+    All capitalized terms in the following text have the meanings\n+assigned to them in the OASIS Intellectual Property Rights Policy (the\n+\"OASIS IPR Policy\"). The full Policy may be found at the OASIS website:\n+[http:\/\/www.oasis-open.org\/policies-guidelines\/ipr]\n+\n+    This document and translations of it may be copied and furnished to\n+others, and derivative works that comment on or otherwise explain it or\n+assist in its implementation may be prepared, copied, published, and\n+distributed, in whole or in part, without restriction of any kind,\n+provided that the above copyright notice and this section are included\n+on all such copies and derivative works. However, this document itself\n+may not be modified in any way, including by removing the copyright\n+notice or references to OASIS, except as needed for the purpose of\n+developing any document or deliverable produced by an OASIS Technical\n+Committee (in which case the rules applicable to copyrights, as set\n+forth in the OASIS IPR Policy, must be followed) or as required to\n+translate it into languages other than English.\n+\n+    The limited permissions granted above are perpetual and will not be\n+revoked by OASIS or its successors or assigns.\n+\n+    This document and the information contained herein is provided on an\n+\"AS IS\" basis and OASIS DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED,\n+INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE\n+INFORMATION HEREIN WILL NOT INFRINGE ANY OWNERSHIP RIGHTS OR ANY IMPLIED\n+WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. OASIS\n+AND ITS MEMBERS WILL NOT BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL OR\n+CONSEQUENTIAL DAMAGES ARISING OUT OF ANY USE OF THIS DOCUMENT OR ANY\n+PART THEREOF.\n+\n+    [OASIS requests that any OASIS Party or any other party that\n+believes it has patent claims that would necessarily be infringed by\n+implementations of this OASIS Standards Final Deliverable, to notify\n+OASIS TC Administrator and provide an indication of its willingness to\n+grant patent licenses to such patent claims in a manner consistent with\n+the IPR Mode of the OASIS Technical Committee that produced this\n+deliverable.]\n+\n+    [OASIS invites any party to contact the OASIS TC Administrator if it\n+is aware of a claim of ownership of any patent claims that would\n+necessarily be infringed by implementations of this OASIS Standards\n+Final Deliverable by a patent holder that is not willing to provide a\n+license to such patent claims in a manner consistent with the IPR Mode\n+of the OASIS Technical Committee that produced this OASIS Standards\n+Final Deliverable. OASIS may include such claims on its website, but\n+disclaims any obligation to do so.]\n+\n+    [OASIS takes no position regarding the validity or scope of any\n+intellectual property or other rights that might be claimed to pertain\n+to the implementation or use of the technology described in this OASIS\n+Standards Final Deliverable or the extent to which any license under\n+such rights might or might not be available; neither does it represent\n+that it has made any effort to identify any such rights. Information on\n+OASIS' procedures with respect to rights in any document or deliverable\n+produced by an OASIS Technical Committee can be found on the OASIS\n+website. Copies of claims of rights made available for publication and\n+any assurances of licenses to be made available, or the result of an\n+attempt made to obtain a general license or permission for the use of\n+such proprietary rights by implementers or users of this OASIS Standards\n+Final Deliverable, can be obtained from the OASIS TC Administrator.\n+OASIS makes no representation that any information or list of\n+intellectual property rights will at any time be complete, or that any\n+claims in such list are, in fact, Essential Claims.]\n+\n+<\/pre>\n","filename":"src\/jdk.crypto.cryptoki\/share\/legal\/pkcs11cryptotoken.md","additions":69,"deletions":29,"binary":false,"changes":98,"status":"modified"}]}