{"files":[{"patch":"@@ -73,1 +73,1 @@\n-<p>The source tree currently defines a few common test groups in the relevant <code>TEST.groups<\/code> files. The test groups are either covering a specific component, for example <code>hotspot_gc<\/code>. It is a good idea to look into <code>TEST.groups<\/code> files to get a sense what tests are relevant to a particular JDK component.<\/p>\n+<p>The source tree currently defines a few common test groups in the relevant <code>TEST.groups<\/code> files. There are test groups that cover a specific component, for example <code>hotspot_gc<\/code>. It is a good idea to look into <code>TEST.groups<\/code> files to get a sense what tests are relevant to a particular JDK component.<\/p>\n@@ -75,1 +75,1 @@\n-<p>Multiple tiers allow balancing test coverage and test costs. Lower test tiers are supposed to contain the simpler, quicker and more stable tests. Higher tiers are supposed to contain progressively more thorough, slower, and sometimes less stable\/reliable tests. When choosing which tiers to run, contributors are advised to run the first N tiers they can afford to run.<\/p>\n+<p>Multiple tiers allow balancing test coverage and test costs. Lower test tiers are supposed to contain the simpler, quicker and more stable tests. Higher tiers are supposed to contain progressively more thorough, slower, and sometimes less stable tests, or the tests that require special configuration. When choosing which tiers to run, contributors are advised to run the first N tiers they can afford to run.<\/p>\n","filename":"doc\/testing.html","additions":2,"deletions":2,"binary":false,"changes":4,"status":"modified"},{"patch":"@@ -74,1 +74,1 @@\n-files. The test groups are either covering a specific component, for example `hotspot_gc`.\n+files. There are test groups that cover a specific component, for example `hotspot_gc`.\n@@ -84,3 +84,4 @@\n-contain the simpler, quicker and more stable tests. Higher tiers are supposed to contain progressively\n-more thorough, slower, and sometimes less stable\/reliable tests. When choosing which tiers to run,\n-contributors are advised to run the first N tiers they can afford to run.\n+contain the simpler, quicker and more stable tests. Higher tiers are supposed to contain\n+progressively more thorough, slower, and sometimes less stable tests, or the tests that require\n+special configuration. When choosing which tiers to run, contributors are advised to run the\n+first N tiers they can afford to run.\n","filename":"doc\/testing.md","additions":5,"deletions":4,"binary":false,"changes":9,"status":"modified"}]}