{"files":[{"patch":"@@ -10,1 +10,1 @@\n-[JBS](https:\/\/bugs.openjdk.org\/) is a public issue tracker used by many OpenJDK projects and is open for anyone to read and search. In order to get write access you need to be registered in the [OpenJDK Census](https:\/\/openjdk.org\/census) by becoming, for instance, an [Author](https:\/\/openjdk.org\/bylaws#author) in an OpenJDK [Project](https:\/\/openjdk.org\/bylaws#project).\n+[JBS](https:\/\/bugs.openjdk.org\/) is a public issue tracker used by many OpenJDK projects and is open for anyone to read and search. To get write access you need to be registered in the [OpenJDK Census](https:\/\/openjdk.org\/census) by becoming, for instance, an [Author](https:\/\/openjdk.org\/bylaws#author) in an OpenJDK [Project](https:\/\/openjdk.org\/bylaws#project).\n@@ -37,1 +37,1 @@\n-    <td class=\"dictionary\">Not recommended to use<br \/><\/td>\n+    <td class=\"dictionary\">Not recommended for use<br \/><\/td>\n@@ -41,1 +41,1 @@\n-    <td class=\"dictionary\">For a proposal for a significant change or new feature which will take 4 weeks or more of work - see [JEP-1](https:\/\/openjdk.org\/jeps\/1)<\/td>\n+    <td class=\"dictionary\">For a proposal of a significant change or new feature which will take 4 weeks or more of work - see [JEP-1](https:\/\/openjdk.org\/jeps\/1)<\/td>\n@@ -83,1 +83,1 @@\n-* Including the java -fullversion is encouraged for bugs in the JVM, hangs, network issues where the exact version can be critical to determine what fixes may be missing from an older version.\n+* Provide the output of `java -version`  whenever possible - this version information is particularly critical for hangs, JVM bugs, and network issues.\n@@ -85,1 +85,1 @@\n-    * If two crashes looks related, but not similar enough to be sure they are the same, it's easier to later close a bug as a duplicate than it is to separate out one bug into two.\n+    * If two crashes look related, but not similar enough to be sure they are the same, it's easier to later close a bug as a duplicate than it is to separate out one bug into two.\n@@ -176,1 +176,1 @@\n-For the most OpenJDK groups Triage is performed on a regular basis (at least weekly) by triage teams. Each triage team consists of contributors who are area experts for that group of issues. If you haven't been selected to be part of a triage team for a specific area you shouldn't be triaging bugs in that area, unless you are the assignee.\n+For the most OpenJDK groups Triage is performed on a regular basis (at least weekly) by triage teams. Each triage team consists of contributors who are area experts for that group of issues. If you haven't been selected to be part of a triage team for a specific area you shouldn't be triaging bugs in that area.\n@@ -227,1 +227,1 @@\n-Once the work on an issue has been completed this should be indicated in JBS by moving the issue to a \"closed\" state.  There are two \"closed\" states: [Resolved]{.jbs-field} and [Closed]{.jbs-field} which can be used interchangeably except in the case of [Fixed]{.jbs-field}, or when flagged as  [Incomplete]{.jbs-field} (See Triaging).\n+Once the work on an issue has been completed the issue should be in a \"closed\" state.  There are two \"closed\" states: [Resolved]{.jbs-field} and [Closed]{.jbs-field} which can be used interchangeably except in the case of [Fixed]{.jbs-field}, or when flagged as  [Incomplete]{.jbs-field} (See Triaging).\n@@ -267,1 +267,1 @@\n-    <td class=\"dictionary\">Use where the issue is due to a problem in a Java library (not shipped with the JDK) or an IDE or other external tool<\/td>\n+    <td class=\"dictionary\">Use where the issue is due to a problem in a Java library (not shipped with the JDK), an IDE or other external tool etc. where known it is good to provide a link to the site where the issue should be reported.<\/td>\n","filename":"src\/guide\/jbs-jdk-bug-system.md","additions":8,"deletions":8,"binary":false,"changes":16,"status":"modified"}]}