{"files":[{"patch":"@@ -90,6 +90,7 @@\n-By default symbols are also located using <b>PATH<\/b>. However, there are also Java properties that can be used to\n-specify both the location of the binaries, and also separately the location of symbols. Use\n-<b>sun.jvm.hotspot.debugger.windbg.imagePath<\/b> for the location of binaries, and use\n-<b>sun.jvm.hotspot.debugger.windbg.symbolPath<\/b> for the location of symbols. <b>imagePath<\/b> defaults to <b>PATH<\/b>\n-if not set, and <b>symbolPath<\/b> defaults to <b>imagePath<\/b>. The advantage of using these propeties is that you\n-don't need to change your <b>PATH<\/b> setting, and they allow for binaries to be located separately from symbols.\n+By default symbols are also located using <b>PATH<\/b>. However, there are also Java properties that\n+can be used to specify both the location of the binaries, and also separately the location of\n+symbols. Use <b>sun.jvm.hotspot.debugger.windbg.imagePath<\/b> for the location of binaries, and use\n+<b>sun.jvm.hotspot.debugger.windbg.symbolPath<\/b> for the location of symbols. <b>imagePath<\/b>\n+defaults to <b>PATH<\/b> if not set, and <b>symbolPath<\/b> defaults to <b>imagePath<\/b>. The\n+advantage of using these propeties is that you don't need to change your <b>PATH<\/b> setting, and\n+they allow for binaries to be located separately from symbols.\n@@ -99,2 +100,2 @@\n-How you set these properties will depend on the SA tool being used. The following example demonstrates how to set one\n-of the properties when launching the clhsdb tool:\n+How you set these properties will depend on the SA tool being used. The following example\n+demonstrates how to set one of the properties when launching the clhsdb tool:\n@@ -107,3 +108,4 @@\n-<p>If you are not seeing symbols for Windows libraries, try setting <b>sun.jvm.hotspot.debugger.windbg.symbolPath<\/b>\n-to include \"<b>srv*https:\/\/msdl.microsoft.com\/download\/symbols<\/b>\". Also include <b>PATH<\/b> so SA will still find\n-your JVM and JNI symbols. For example:\n+<p>If you are not seeing symbols for Windows libraries, try setting\n+<b>sun.jvm.hotspot.debugger.windbg.symbolPath<\/b> to include\n+\"<b>srv*https:\/\/msdl.microsoft.com\/download\/symbols<\/b>\". Also include <b>PATH<\/b> so SA will still\n+find your JVM and JNI symbols. For example:\n@@ -128,2 +130,2 @@\n- used for locating the JDK libraries, but it needs to specify the full path to the libraries. SA will\n- not automatically search subdirs such as <b>lib\/server<\/b> as it does for <b>JAVA_HOME<\/b>.\n+ used for locating the JDK libraries, but it needs to specify the full path to the libraries. SA\n+ will not automatically search subdirs such as <b>lib\/server<\/b> as it does for <b>JAVA_HOME<\/b>.\n@@ -134,1 +136,1 @@\n- except it does not use it to map all the subdirs. It just appends <b>SA_ALTROOT<\/b> to the\n+ except it does not use it to map all the subdirs. It just prepends <b>SA_ALTROOT<\/b> to the\n","filename":"src\/jdk.hotspot.agent\/doc\/transported_core.html","additions":16,"deletions":14,"binary":false,"changes":30,"status":"modified"}]}