{"files":[{"patch":"@@ -0,0 +1,268 @@\n+## The Unicode Standard, Unicode Character Database, Version 16.0.0\n+\n+### Unicode Character Database\n+```\n+\n+UNICODE LICENSE V3\n+\n+COPYRIGHT AND PERMISSION NOTICE\n+\n+Copyright © 1991-2024 Unicode, Inc.\n+\n+NOTICE TO USER: Carefully read the following legal agreement. BY\n+DOWNLOADING, INSTALLING, COPYING OR OTHERWISE USING DATA FILES, AND\/OR\n+SOFTWARE, YOU UNEQUIVOCALLY ACCEPT, AND AGREE TO BE BOUND BY, ALL OF THE\n+TERMS AND CONDITIONS OF THIS AGREEMENT. IF YOU DO NOT AGREE, DO NOT\n+DOWNLOAD, INSTALL, COPY, DISTRIBUTE OR USE THE DATA FILES OR SOFTWARE.\n+\n+Permission is hereby granted, free of charge, to any person obtaining a\n+copy of data files and any associated documentation (the \"Data Files\") or\n+software and any associated documentation (the \"Software\") to deal in the\n+Data Files or Software without restriction, including without limitation\n+the rights to use, copy, modify, merge, publish, distribute, and\/or sell\n+copies of the Data Files or Software, and to permit persons to whom the\n+Data Files or Software are furnished to do so, provided that either (a)\n+this copyright and permission notice appear with all copies of the Data\n+Files or Software, or (b) this copyright and permission notice appear in\n+associated Documentation.\n+\n+THE DATA FILES AND SOFTWARE ARE PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY\n+KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\n+MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT OF\n+THIRD PARTY RIGHTS.\n+\n+IN NO EVENT SHALL THE COPYRIGHT HOLDER OR HOLDERS INCLUDED IN THIS NOTICE\n+BE LIABLE FOR ANY CLAIM, OR ANY SPECIAL INDIRECT OR CONSEQUENTIAL DAMAGES,\n+OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS,\n+WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION,\n+ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THE DATA\n+FILES OR SOFTWARE.\n+\n+Except as contained in this notice, the name of a copyright holder shall\n+not be used in advertising or otherwise to promote the sale, use or other\n+dealings in these Data Files or Software without prior written\n+authorization of the copyright holder.\n+\n+\n+------------------\n+\n+Unicode® Consortium Copyright, Terms of Use, and Licenses\n+\n+Welcome to the website of Unicode, Inc. (dba The Unicode Consortium)\n+(“Unicode”). Except as otherwise noted herein, these terms and conditions\n+(“Terms of Use”) govern your use of the Unicode website and Unicode Products.\n+Your use of this website and\/or Unicode Products constitutes your agreement\n+to follow and be bound by these Terms of Use. Unicode provides you with\n+access to and use of this website and Unicode Products subject to your\n+compliance with these Terms of Use. If you do not agree to these Terms\n+of Use, you should not access or use this website or Unicode Products.\n+Unicode reserves the right to make changes to the website, to Unicode\n+Products, and to these Terms of Use at any time in its sole d iscretion.\n+\n+    1. Unicode Copyright: Copyright © 1991-Present Unicode, Inc.\n+\n+    2. Definitions\n+\n+        a. “Unicode Products” includes the Unicode website and its content,\n+           Data Files, Software, the Unicode Standard, all other Unicode\n+           standards, specifications, technical reports, technical notes,\n+           annexes, code charts, data files, software, publications,\n+           webinars, videos, course materials, online and in-person events,\n+           and all other Unicode products and services made available via\n+           this website or any other channel of distribution, including but\n+           not limited to Github, Maven, YouTube, and other third-party\n+           sites where Unicode maintains and provides products, materials,\n+           and services.\n+\n+        b. “Unicode Data Files” or \"Data Files\" include all computer data\n+           files under the following directories:\n+\n+            i. https:\/\/www.unicode.org\/Public\/\n+           ii. https:\/\/www.unicode.org\/reports\/\n+          iii. https:\/\/www.unicode.org\/ivd\/data\/\n+           iv. https:\/\/github.com\/unicode-org\/\n+\n+           but exclude any materials present in the above directories that\n+           are not computer data files, such as PDF code charts and\n+           Technical Reports.\n+\n+        c. “Unicode Software” or \"Software\" includes any source code or\n+           compiled code in any Unicode Product including but not limited to\n+           the code included in the following directories:\n+\n+            i. https:\/\/www.unicode.org\/Public\/PROGRAMS\/\n+           ii. https:\/\/www.unicode.org\/Public\/cldr\/\n+          iii. https:\/\/github.com\/unicode-org\/\n+\n+    3. Permissions, Licenses, and Restrictions on Use\n+\n+        a. You are authorized to freely access and use this website and its\n+           content and all Unicode Products subject to these Terms of Use and\n+           subject to any restriction, permission, or license specifically\n+           associated with any specific material or content. No license is\n+           granted to copy or \"mirror\" this website. Linking to this website\n+           is permitted.\n+\n+        b. Except where otherwise more broadly permitted or licensed:\n+\n+            1. you may not make copies of or modifications to Unicode\n+               Products for public distribution, or incorporate Unicode\n+               Products in whole or in part into any product or publication,\n+               or otherwise publicly distribute them, without the express\n+               written permission of Unicode, and\n+\n+            2. you may not copy or extract fonts or font data from any\n+               Unicode Products, including but not limited to Unicode Code\n+               Charts.\n+\n+        c. All Unicode Data Files and Unicode Software are subject to the\n+           terms and conditions of the free and open-source Unicode License\n+           v3, unless otherwise indicated by specific restriction,\n+           permission, or license identified at the point of release or in\n+           such software, data file, or other documentation.\n+\n+        d. You may freely download and make copies of the Unicode® Standard\n+           Core Specification, Unicode Technical Reports, Unicode Technical\n+           Notes, Unicode Code Charts, and other portions of this website\n+           and may annotate and translate such permitted downloads and\n+           copies, provided that such downloads, copies, annotations, and\n+           translations are solely for personal or internal business\n+           purposes and not for public distribution, and further provided\n+           that any permitted copies and modifications fully reproduce all\n+           copyright and other legal notices contained in the original.\n+           Notwithstanding the foregoing, specific versions of the Unicode®\n+           Standard Core Specification, Unicode Technical Reports, Unicode\n+           Technical Notes, and Unicode Code Charts, as well as other Unicode\n+           publications, materials, and portions of this website may be\n+           subject to broader permissions and\/or further reservations of\n+           rights and restrictions on use found in the title pages, cover\n+           sheets, front matter, and\/or footnotes for each such version,\n+           report, chart, or other publication or material. Consult each\n+           version, report, chart, or other publication or material for any\n+           such permissions and further reservations of rights and\n+           restrictions on use.\n+\n+    4. Restricted Rights Legend. Any Unicode Data Files or Software that are\n+       licensed to the United States of America, its agencies and\/or\n+       instrumentalities under these Terms of Use is commercial technical\n+       data or commercial computer software developed exclusively at private\n+       expense as defined in FAR 2.101, or DFARS 252.227-7014, as applicable.\n+       For Unicode Data Files, use, duplication, or disclosure by the\n+       Government is subject to restrictions as set forth in DFARS\n+       202.227-7015 Technical Data, Commercial and Items and these Terms of\n+       Use. For Unicode Software, in accordance with FAR 12-212 or DFARS\n+       227-7202, as applicable, use, duplication or disclosure by the\n+       Government is subject to the restrictions set forth in these Terms\n+       of Use.\n+\n+    5. Disclaimer of Warranties & Limitation of Liability\n+\n+        a. This website and the Unicode Products are provided “AS-IS” without\n+           charge as a convenience to visitors and users. While Unicode\n+           attempts to provide accurate, error-free, and timely information,\n+           there may be technical or factual inaccuracies and typographical\n+           or other errors in this website and in the Unicode Products.\n+           Unicode reserves the right to make corrections and changes to the\n+           website and the Unicode Products at any time without notice.\n+\n+        b. YOU ASSUME ALL RESPONSIBILITY AND RISK WITH RESPECT TO YOUR USE\n+           OF THIS WEBSITE AND THE UNICODE PRODUCTS, WHICH ARE PROVIDED \"AS\n+           IS\" WITHOUT WARRANTY OF ANY KIND EITHER EXPRESS, IMPLIED, OR\n+           STATUTORY, INCLUDING BUT NOT LIMITED TO ANY WARRANTIES OF\n+           ACCURACY, COMPLETENESS, TITLE, MERCHANTABILITY, FITNESS FOR A\n+           PARTICULAR PURPOSE, OR NON-INFRINGEMENT OF THIRD PARTY RIGHTS.\n+           UNICODE AND ITS LICENSORS AND CONTRIBUTORS ASSUME NO\n+           RESPONSIBILITY FOR ERRORS OR OMISSIONS IN THIS WEBSITE AND\/OR THE\n+           UNICODE PRODUCTS. IF YOU ARE DISSATISFIED WITH THIS WEBSITE OR THE\n+           UNICODE PRODUCTS, YOUR SOLE REMEDY IS TO DISCONTINUE USE OF THE\n+           WEBSITE AND THE UNICODE PRODUCTS.\n+\n+        c. IN NO EVENT SHALL UNICODE, ITS MEMBERS, OR ITS LICENSORS OR\n+           CONTRIBUTORS BE LIABLE FOR ANY CLAIM OR DAMAGES WHATSOEVER OF ANY\n+           KIND, WHETHER DIRECT, INDIRECT, SPECIAL, INCIDENTAL,\n+           CONSEQUENTIAL, EXEMPLARY, OR PUNITIVE DAMAGES, WHETHER OR NOT\n+           UNICODE WAS ADVISED OF THE POSSIBILITY OF SUCH DAMAGE, INCLUDING\n+           BUT NOT LIMITED TO DAMAGE RESULTING FROM LOSS OF USE, DATA, OR\n+           PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE, OR OTHER\n+           TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE,\n+           INABILITY TO USE, PERFORMANCE, FUNCTIONALITY, MODIFICATION, OR\n+           DISTRIBUTION OF THIS WEBSITE, THE UNICODE PRODUCTS, OR ANY\n+           DERIVATIVES THEREOF.\n+\n+        d. Unicode makes no warranties or representations of any kind\n+           regarding any non-Unicode sites to which you may be directed or\n+           hyperlinked from this website. Hyperlinks are included solely for\n+           your convenience and Unicode makes no warranties or\n+           representations with regard to the accuracy, availability,\n+           suitability, or safety of information, products, or services\n+           provided on such non-Unicode sites.\n+\n+    6. Intellectual Property Contributions to Unicode. All contributions or\n+       submissions to Unicode are governed by The Unicode Consortium\n+       Intellectual Property, Licensing & Technical Contribution Policies.\n+       If you wish to make any contribution or submission to Unicode, refer\n+       to the foregoing Policies for further information on how to do so.\n+       In the absence of a signed contributor license or other agreement with\n+       Unicode that expressly governs a particular contribution or\n+       submission, the act of making a contribution or submission of any kind\n+       to Unicode by any communication channel constitutes a binding legal\n+       agreement by the contributor or submitter that they:\n+\n+            a. represent and agree that the contributed matter is not\n+               proprietary or confidential to the contributor or any third\n+               party, and\n+\n+            b. grant to Unicode and to recipients of products distributed by\n+               Unicode a perpetual, irrevocable, unrestricted, worldwide,\n+               nonexclusive, no-charge, royalty-free license, without\n+               obligation for accounting, to reproduce, prepare derivative\n+               works of, publicly display, publicly perform, distribute,\n+               make, use, sell, offer to sell, or import that matter for any\n+               purpose, with the unrestricted right to sublicense those\n+               rights.\n+\n+    7. Compliance with Unicode Policies. These Terms of Use hereby\n+       incorporate by reference the following Unicode Policies. Your use of\n+       this website and\/or Unicode Products and\/or your participation in\n+       Unicode activities constitutes your agreement to these Policies\n+       which may be modified at any time in Unicode’s sole discretion:\n+\n+        a. The Unicode Consortium Code of Conduct\n+        b. The Unicode Consortium Antitrust Policy & Guidelines\n+        c. The Unicode Consortium Intellectual Property, Licensing &\n+           Technical Contribution Policies\n+        d. The Unicode Consortium Name and Trademark Usage Policy\n+        e. The Unicode Consortium Policy on Handling of Confidential\n+           Business Data\n+        f. The Unicode Consortium General Privacy Policy\n+        g. The Unicode Technical Group Procedures\n+\n+    8. Trademarks & Logos. The Unicode Word Mark and the Unicode Logo are\n+       trademarks of Unicode, Inc. “The Unicode Consortium'' and “Unicode,\n+       Inc.” are trade names of Unicode, Inc. You hereby acknowledge and\n+       agree to respect Unicode’s exclusive worldwide rights in the Unicode\n+       Word Mark, the Unicode Logo, and the Unicode trade names. The Unicode\n+       Consortium Name and Trademark Usage Policy is incorporated herein by\n+       reference and you agree to abide by its provisions, which may be\n+       changed from time to time in Unicode’s sole discretion.\n+\n+    9. Jurisdiction and Venue. This website is operated from, and the\n+       Unicode Products are made available from, locations in the United\n+       States of America. Unicode makes no representation that this website\n+       or Unicode Products are appropriate for use in other locations. If\n+       you access this website or the Unicode Products from other locations,\n+       you are responsible for compliance with local laws. These Terms of\n+       Use, all use of this website and Unicode Products, and any claims and\n+       damages resulting from use of this website or Unicode Products, are\n+       governed by the applicable laws of the United States of America and\n+       the State of California without regard to any principles which would\n+       apply the laws of different jurisdictions. You agree that any disputes\n+       regarding this website and the Unicode Products shall be resolved\n+       solely in the appropriate state and federal courts located in the\n+       counties of San Francisco, San Mateo, or Santa Clara, California.\n+       You agree that these courts have personal jurisdiction over you and\n+       agree to waive any right to transfer the dispute to any other forum.\n+\n+    10. Severability. If any provision of these Terms of Use is declared\n+        invalid or unenforceable, the remaining provisions of these Terms of\n+        Use shall remain in effect.\n","filename":"modules\/jfx.incubator.input\/src\/main\/legal\/unicode-fx.md","additions":268,"deletions":0,"binary":false,"changes":268,"status":"added"}]}