{"files":[{"patch":"@@ -203,2 +203,2 @@\n-     * {@return an unmodifiable, shallowly immutable, thread-safe, stable,\n-     * {@linkplain List} containing {@code size} {@linkplain StableValue } elements}\n+     * {@return an unmodifiable, shallowly immutable, thread-safe, stable, lazily\n+     * populated {@linkplain List} containing {@code size} {@linkplain StableValue } elements}\n@@ -215,2 +215,1 @@\n-     * Except it requires less storage, does not return stable value instances with the\n-     * same identity, and is likely to exhibit better performance.\n+     * Except the elements are lazily created upon being first accessed.\n@@ -220,1 +219,1 @@\n-     * immutable and thread-safe. Programmers should not use list and element instances\n+     * shallowly immutable and thread-safe. Programmers should not use list and element instances\n@@ -244,1 +243,1 @@\n-     * {@linkplain Map} where the {@linkplain java.util.Map#keySet() keys}\n+     * value-lazy populated {@linkplain Map} where the {@linkplain java.util.Map#keySet() keys}\n@@ -246,1 +245,1 @@\n-     * stable values are, in turn, lazily computed upon being accessed\n+     * stable values are, in turn, lazily computed upon being first accessed\n@@ -259,2 +258,1 @@\n-     * Except it requires less storage, does not return stable value instances with the\n-     * same identity, and is likely to exhibit better performance.\n+     * Except the map's values are lazily created upon being first accessed.\n@@ -264,3 +262,3 @@\n-     * immutable and thread-safe. Programmers should not use map and value instances for\n-     * synchronization, or unpredictable behavior may occur. For example, in a\n-     * future release, synchronization may fail. Consequently,\n+     * shallowly immutable and thread-safe. Programmers should not use map and value\n+     * instances for synchronization, or unpredictable behavior may occur. For example,\n+     * in a future release, synchronization may fail. Consequently,\n","filename":"src\/java.base\/share\/classes\/jdk\/internal\/lang\/StableValue.java","additions":10,"deletions":12,"binary":false,"changes":22,"status":"modified"}]}