{"files":[{"patch":"@@ -26,1 +26,1 @@\n- * @summary Verify that ZipFile rejects files with CEN sizes exceeding the limit\n+ * @summary Verify that ZipFile rejects files with CEN sizes exceeding the implementation limit\n@@ -57,2 +57,2 @@\n- * invalid, the CEN is never actually read by ZipFile since it does END\n- * record validation before reading the CEN.\n+ * invalid, the CEN is never actually read by ZipFile since it does\n+ * 'End of central directory record' (END header) validation before reading the CEN.\n@@ -66,1 +66,1 @@\n-    \/\/ Some ZipFile constants for manipulating the END header\n+    \/\/ Some ZipFile constants for manipulating the 'End of central directory record' (END header)\n@@ -104,2 +104,2 @@\n-     * Validates that an END header with a CEN length\n-     * exceeding {@link #MAX_CEN_SIZE} limit is rejected\n+     * Validates that an 'End of central directory record' (END header) with a CEN\n+     * length exceeding {@link #MAX_CEN_SIZE} limit is rejected\n@@ -122,2 +122,3 @@\n-     * Validate that an END header where the value of the CEN size\n-     * field exceeds the position of the END header is rejected.\n+     * Validate that an 'End of central directory record' (END header)\n+     * where the value of the CEN size field exceeds the position of\n+     * the END header is rejected.\n@@ -141,2 +142,3 @@\n-     * Validate that an END header where the value of the CEN offset field is\n-     * larger than the position of the END header minus the CEN size is rejected\n+     * Validate that an 'End of central directory record' (the END header)\n+     * where the value of the CEN offset field is larger than the position\n+     * of the END header minus the CEN size is rejected\n@@ -161,1 +163,1 @@\n-     * in the END header to the given size.\n+     * in the 'End of central directory record' (END header)  to the given size.\n","filename":"test\/jdk\/java\/util\/zip\/ZipFile\/EndOfCenValidation.java","additions":13,"deletions":11,"binary":false,"changes":24,"status":"modified"}]}