{"files":[{"patch":"@@ -51,0 +51,13 @@\n+\/* JBS field names *\/\n+.jbs {\n+    font-weight: bold;\n+    color: #333;\n+}\n+\n+\/* JBS labels *\/\n+.label {\n+    font-family: monospace;\n+    font-weight: bold;\n+    color: #060\n+}\n+\n","filename":"src\/guidestyle.css","additions":13,"deletions":0,"binary":false,"changes":13,"status":"modified"},{"patch":"@@ -680,27 +680,1 @@\n-      Used to indicate that the issue is a release note. The release-note issue is a sub-task to the main JBS issue containing the text to be used in the release note. The release note must also have one of the following labels:\n-\n-[**`RN-NewFeature`**]{#RN-NewFeature}\n-:   New Feature or enhancement.\n-\n-[**`RN-IssueFixed`**]{#RN-IssueFixed}\n-:   A significant issue which has been fixed, would normally be a regression or an issue which unknowingly released in a new feature.\n-\n-[**`RN-KnownIssue`**]{#RN-KnownIssue}\n-:   An issue that wasn't possible to fix by the time the release was GA'd.\n-\n-[**`RN-Removed`**]{#RN-Removed}\n-:   Covers an API, feature, tool etc. which has been removed from the JDK.\n-\n-[**`RN-Deprecated`**]{#RN-Deprecated}\n-:   Covers an API that has been marked as deprecated in the release.\n-\n-[**`RN-Important`**]{#RN-Important}\n-:   Used to indicate that the release note should be highlighted in some fashion, such as listing it at the beginning of the release notes.\n-\n-[**`RN-`(distro)**]{#RN-distro}\n-:   Used to indicate that the release note is only relevant for a specific JDK distribution. E.g. RN-Oracle\n-\n-[~~**`RN-Change`**~~]{#RN-Change}\n-:   Deprecated.\n-\n-<!-- Comment needed due to bug in Pandoc. -->\n+      Used to indicate that the issue is a release note. See [Release Notes](#release-notes).\n@@ -716,1 +690,1 @@\n-      Used to indicate wether a change requires a release note or not. The labels are always placed on the main JBS issue, never on the actual release note issue.\n+      Used to indicate whether a change requires a release note or not. The labels are always placed on the main JBS issue, never on the actual release note issue. See [Release Notes](#release-notes).\n@@ -721,0 +695,8 @@\n+  <tr>\n+    <td class=\"dictionary\">\n+      [**`RN-`**`.*`]{#rn}\n+    <\/td>\n+    <td class=\"dictionary\">\n+      Used to indicate what kind of change the release note is for. See [Release Notes](#release-notes).\n+    <\/td>\n+  <\/tr>\n@@ -1486,1 +1468,1 @@\n-Disadvantages of this model are that the list of backports in JBS will still list the old (failed) backport as the 15.0.2 backport, and the new backport will not be linked to using a _backported by_ link. It is assumed that the advantages above outweigths the disadvantages and that the capital letter prefixes for the backout and the redo will be visible enough in JBS to alert that something fishy is going on.\n+Disadvantages of this model are that the list of backports in JBS will still list the old (failed) backport as the 15.0.2 backport, and the new backport will not be linked to using a _backported by_ link. It is assumed that the advantages above outweighs the disadvantages and that the capital letter prefixes for the backout and the redo will be visible enough in JBS to alert that something fishy is going on.\n@@ -1538,1 +1520,1 @@\n-In order to be allowed to push a change to one of the OpenJDK update development repositories (e.g. [`jdk17u-dev`](https:\/\/github.com\/openjdk\/jdk17u-dev)), an approval is required. The [official process for how to request push approval for a backport](https:\/\/openjdk.java.net\/projects\/jdk-updates\/approval.html) describes in detail how to work with JBS when requesting approvals. In short, there's a label `jdk<release>u-fix-request` that should be added to the main JBS issue. Also put a motivation as to why the issue needs to be backported as a comment in the main issue. Once the label and motivation has been added, wait for the maintainers of the release to approve your request. The approval will be indicated with a label, `jdk<release>u-fix-yes`, added to the main issue.\n+In order to be allowed to push a change to one of the OpenJDK update development repositories (e.g. [`jdk17u-dev`](https:\/\/github.com\/openjdk\/jdk17u-dev)), an approval is required. The [official process for how to request push approval for a backport](https:\/\/openjdk.java.net\/projects\/jdk-updates\/approval.html) describes in detail how to work with JBS when requesting approvals. In short, there's a label [jdk<release>u-fix-request]{.label} that should be added to the main JBS issue. Also put a motivation as to why the issue needs to be backported as a comment in the main issue. Once the label and motivation has been added, wait for the maintainers of the release to approve your request. The approval will be indicated with a label, [jdk<release>u-fix-yes]{.label}, added to the main issue.\n@@ -1540,1 +1522,1 @@\n-If the update release is in rampdown, changes are pushed to the release repository (e.g. [`jdk17u`](https:\/\/github.com\/openjdk\/jdk17u)). During rampdown the bar to get changes in are significantly higher and fixes need to be approved with `jdk<release>u-critical-request` \/ `jdk<release>u-critical-yes`.\n+If the update release is in rampdown, changes are pushed to the release repository (e.g. [`jdk17u`](https:\/\/github.com\/openjdk\/jdk17u)). During rampdown the bar to get changes in are significantly higher and fixes need to be approved with [jdk<release>u-critical-request]{.label} \/ [jdk<release>u-critical-yes]{.label}.\n@@ -1544,1 +1526,1 @@\n-The Skara tooling includes support for backports. [The official Skara documentation](https:\/\/wiki.openjdk.java.net\/display\/SKARA\/Backports) describes in detail how to work with the tooling to create backport PRs on GitHub or using the CLI tools. As described in the documentation, the [`\/backport`](https:\/\/wiki.openjdk.java.net\/display\/SKARA\/Commit+Commands#CommitCommands-\/backport) command can be used on a commit (not a PR!) to create the backport PR. If a backport PR is manually created, set the PR title to `Backport <original commit hash>`. This ensures that the bots will recognize it as a backport as opposed to a main fix specifically targeting an older release. One can tell whether or not the bots recognized a PR as a backport by the `backport` label being added if it's recognized.\n+The Skara tooling includes support for backports. [The official Skara documentation](https:\/\/wiki.openjdk.java.net\/display\/SKARA\/Backports) describes in detail how to work with the tooling to create backport PRs on GitHub or using the CLI tools. As described in the documentation, the [`\/backport`](https:\/\/wiki.openjdk.java.net\/display\/SKARA\/Commit+Commands#CommitCommands-\/backport) command can be used on a commit (not a PR!) to create the backport PR. If a backport PR is manually created, set the PR title to `Backport <original commit hash>`. This ensures that the bots will recognize it as a backport as opposed to a main fix specifically targeting an older release. One can tell whether or not the bots recognized a PR as a backport by the [backport]{.label} label being added if it's recognized.\n@@ -1550,1 +1532,124 @@\n-# HotSpot development\n+# Release Notes\n+\n+::: {.box}\n+[Quick Links]{.boxheader}\n+\n+* [JDK Release Notes](https:\/\/www.oracle.com\/java\/technologies\/javase\/jdk-relnotes-index.html)\n+* [release-note label description](#release-note)\n+* [CommonMark Spec](https:\/\/spec.commonmark.org\/current\/)\n+* [dingus](https:\/\/spec.commonmark.org\/dingus\/)\n+:::\n+\n+Release notes for a product such as the JDK are part of the release deliverables providing a way to highlight information about a fix, such as when it may have changed behavior, or when it's decided not to fix something. While what should go into a release note isn't something that can be precisely defined, it should describe changes that are important for a user to take into account when they are upgrading to the specific version. While release notes should not duplicate information in other documents, they can serve to highlight that a change has been made.\n+\n+Release notes are associated with a JBS issue that has been fixed (or in some cases not been fixed) in a release and are generated with each build of a release. Any note should be considered as an integral part of the fix process, rather than waiting until the end of the release to determine what to write. In OpenJDK, release notes are currently being generated for the JDK and JDK Updates projects.\n+\n+## Writing a release note\n+\n+Writing the release note is the responsibility of the engineer who owns the issue. The note should be generated before the fix is reviewed, or in the case of known issues, when it's determined that a fix won't be possible in the release the issue was found in.\n+\n+When writing a release note, be prepared for rather picky review comments about grammar, typos, and wording. This is for the sake of the Java community as a whole, as the language of the release note sets the tone for many blogs and news articles. For a widely used product like the JDK, the release notes are often copied verbatim (including typos) and published to highlight news in the release. This means that we need to take extra care to make sure the text in the release note is correct and follows a similar style.\n+\n+The release note itself is written in a [JBS](#jbs---jdk-bug-system) sub-task of the issue that is used to push the change. There are a few steps to follow for the release note to find its way from JBS to the actual release note document.\n+\n+#. Create a sub-task (More &rightarrow; Create Sub-Task) for the issue that requires a release note - the main issue, that is, the JBS issue that is used to push the original change, **not** for backports or the CSR (if there is one).\n+#. For the newly created sub-task, follow these steps:\n+   * The [Summary]{.jbs} should be a one sentence synopsis that is informative (and concise) enough to attract the attention of users, developers, and maintainers who might be impacted by the change. It should succinctly describe what has actually changed, not be the original bug title, nor describe the problem that was being solved. It should read well as a sub-section heading in a document.\n+   * Prefix the [Summary]{.jbs} with \"Release Note:\".\n+   * Add the [release-note]{.label} label. This is required for the release note to be included in the release notes.\n+   * Add the proper [RN-]{.label}label if applicable to indicate what section of the release notes it should be included in (see [RN-labels](#rn-labels) below).\n+   * Set the [Assignee]{.jbs} to the same person who owns the main issue.\n+   * Set [Affects Version]{.jbs} to the release versions for which the release note should be published.\n+   * Set the [Fix Version]{.jbs} to the same value that the main issue - in almost all cases this will be the version of mainline.\n+   * Enter the text of the release note in the [Description]{.jbs} field using markdown formatting, following the [CommonMark specification](https:\/\/spec.commonmark.org\/current\/). While the markdown won't be rendered in JBS, you can use [dingus](https:\/\/spec.commonmark.org\/dingus\/) to see what the release note will look like. Note that [Github stlye ascii table formatting](https:\/\/docs.github.com\/en\/get-started\/writing-on-github\/working-with-advanced-formatting\/organizing-information-with-tables) is supported but will not display correctly in the dingus page. For more information see [General Conventions for Release Notes](#general-conventions-for-release-notes) below.\n+   * While the [Priority]{.jbs} of the sub-task is set by default to be the same as the priority of the issue itself, it can be changed to adjust in what order the release note is listed compared to other release notes in the same build or release note section.\n+#. Have the release note ready to be reviewed at the same time as the code is reviewed. If it's later determined that a release note is necessary, then go back to the same engineers who reviewed the fix to review the release note.  Special care should be taken when writing a release note that will cover changes related to a vulnerability fix in order to avoid describing technical details of how it could have been exploited.\n+#. When you are done, _Resolve_ the release note sub-task as `Delivered`. Only release notes where the sub-task has been resolved as `Delivered` is considered to be part of the EA\/GA release notes. To avoid mixing up the release notes with the code fixes that have gone into a particular release or build, we don't use `Resolved\/Fixed`.\n+\n+If you see an issue you feel should have a release note but you are not the assignee of the bug, then add the label [release-note=yes]{.label} to the main bug (not on a backport nor a sub-task). This acts as a flag to make sure that the release note is considered. This can be done even with fixes that have been shipped already if it's noticed that there is confusion around the change. If, after discussion, it's decided that a release note isn't required either remove the label, or change it to [release-note=no]{.label} if it makes sense to have a clear indication that a release note isn't required for the fix. The label [release-note=yes]{.label} can be removed once the release note sub-task has been created.\n+\n+For examples of well written release note issues in JBS, see [JDK-8276929](https:\/\/bugs.openjdk.java.net\/browse\/JDK-8276929) or [JDK-8278458](https:\/\/bugs.openjdk.java.net\/browse\/JDK-8278458).\n+\n+## General Conventions for Release Notes\n+\n+The following are general practices that should be followed when creating release notes.\n+\n+* Release notes should be no longer than 2-3 paragraphs.\n+* Don't repeat information that will be included in updates to the docs, keep it to a high level summary or key changes.\n+* Note that where the changes are more fully documented in the JDK documentation, then refer to that document for details. When covering a change in behavior provide some idea to what can be done if a developer or user encounters problems from the change.\n+* Don't include graphics etc. Refer to the main docs if there are more details that need explaining.\n+* Don't include your name or affiliation, make sure however, you are the assignee of the release note sub-task.\n+* If you have a < in the [Summary]{.jbs} then use `&lt;`. For <'s in the [Description]{.jbs} surround them by back-ticks.\n+\n+* Avoid using Latin and abbreviations in the release note.\n+  * Use \"also known as\" instead of \"aka\"\n+  * Use \"that is\" or \"to be specific\" instead of \"i.e.\"\n+  * Use \"for example\" instead of \"e.g.\"\n+\n+* The [Summary]{.jbs} should be in title case instead of sentence case.\n+  * Example: Decode Error with Tomcat Version 7.x\n+\n+* The [Description]{.jbs} should be standardized to follow this pattern:\n+  * Sentence stating the change that was made\n+  * Background info\/context\n+  * Example: A new system property, `jdk.disableLastUsageTracking`, has been introduced to disable JRE last usage tracking for a running VM.\n+\n+* Special case: JEP release note\n+  * [Summary]{.jbs} - If the change is an actual JEP, use the JEP title.\n+  * [Description]{.jbs} - the JEP Summary text have already been heavily reviewed and also approved by the project lead. It should be the first sentence in the release note description. That would be analogous to the \"change that was made\" sentence in other release note descriptions. The remaining text would be composed of the background info from the JEP.\n+  * [Description]{.jbs} - The JEP release note description should contain the link to the JEP.\n+\n+## RN-labels\n+\n+Unless labeled otherwise it will be assumed that the release note documents a change in behavior (will have likely required a CSR) or other item which should be included in the release notes. If the note covers a more specific type of change, then one of the following labels can be included (notes of a similar type will be listed together).\n+\n+[[RN-NewFeature]{.label}]{#RN-NewFeature}\n+:   A New Feature or enhancement in the release.\n+    The [Summary]{.jbs} must be the item\/API or new functionality.\n+    The [Description]{.jbs} must contain the name of the new feature, its intended function, and how a user can utilize it.\n+    Example: [JDK-8193026](https:\/\/bugs.openjdk.java.net\/browse\/JDK-8193026)\n+\n+[[RN-IssueFixed]{.label}]{#RN-IssueFixed}\n+:   A significant issue which has been fixed. This would normally be a regression or an issue which was unknowingly released in a new feature.\n+    The [Summary]{.jbs} must be a summary of the error that was fixed.\n+    The [Description]{.jbs} must contain a statement about what was fixed, how the fix effects the user, and any special conditions that a user should be aware of regarding the fix.\n+    Example: [JDK-8184172](https:\/\/bugs.openjdk.java.net\/browse\/JDK-8184172)\n+\n+[[RN-KnownIssue]{.label}]{#RN-KnownIssue}\n+:   An issue that wasn't possible to fix by the time the release was GA'd.\n+    The [Summary]{.jbs} must be a summary of the error that the user sees.\n+    The [Description]{.jbs} must contain details about the error, how it effects the user, and workarounds if any exist.\n+    Example: [JDK-8191040](https:\/\/bugs.openjdk.java.net\/browse\/JDK-8191040)\n+\n+[[RN-Removed]{.label}]{#RN-Removed}\n+:   Only for major releases. The release note covers an API, feature, tool etc. which has been removed from the JDK.\n+    The [Summary]{.jbs} must be of the form \"Removal of\" Item\/API.\n+    The [Description]{.jbs} must contain the list or name of the removed items\/API with (optional) the reason for its removal. Include any special conditions that a user should be aware of regarding the removal.\n+    Example: [JDK-8185066](https:\/\/bugs.openjdk.java.net\/browse\/JDK-8185066)\n+\n+[[RN-Deprecated]{.label}]{#RN-Deprecated}\n+:   Only for major releases. The release notes cover an API, feature, tool etc. that has been marked as deprecated in the release.\n+    The [Summary]{.jbs} must be of the form \"Deprecated\" Item\/API.\n+    The [Description]{.jbs} must contain the name of the item that has been deprecated, the reason for its deprecation, and (optional) any special conditions that a user should be aware of regarding the possible future removal.\n+    Example: [JDK-8179909](https:\/\/bugs.openjdk.java.net\/browse\/JDK-8179909)\n+\n+[[RN-Important]{.label}]{#RN-Important}\n+:   Used to indicate that the release note should be highlighted in some fashion, such as listing it at the beginning of the release notes.\n+\n+[[RN-]{.label}_(distro)_]{#RN-distro}\n+:   Used to indicate that the release note is only relevant for a specific JDK distribution. E.g. [RN-Oracle]{.label}\n+\n+[[~~RN-Change~~]{.label}]{#RN-Change}\n+:   Deprecated.\n+\n+## Querying the Release Notes\n+\n+The Release Notes for a particular release can be found using the JBS query\n+\n+~~~\n+affectedversion = <version> and type = sub-task and labels = release-note\n+~~~\n+\n+where `<version>` is the appropriate release value, e.g. 17.\n+\n+# HotSpot Development\n","filename":"src\/index.md","additions":138,"deletions":33,"binary":false,"changes":171,"status":"modified"}]}