{"files":[{"patch":"@@ -45,3 +45,0 @@\n-        \/\/ If ResolvedReferencesTestApp is not archived, the resolvedReferences array should only contain\n-        \/\/ the objects fooString and barString since they are static. The object\n-        \/\/ quxString should NOT be in the array since the method that returns it is not called\n","filename":"test\/hotspot\/jtreg\/runtime\/cds\/appcds\/sharedStrings\/ResolvedReferencesNotNullTest.java","additions":0,"deletions":3,"binary":false,"changes":3,"status":"modified"},{"patch":"@@ -26,1 +26,6 @@\n- public class ResolvedReferencesWb {\n+\/\/ This class is used by ResolvedReferencesNotNullTest and is used with and without CDS\n+\/\/ When not archived, the resolved references array should only contain the objects\n+\/\/ fooString and barString since they are resolved by ResolvedReferencesTestApp::<clinit>\n+\/\/ The object quxString should NOT be in the array since the method qux() is never called.\n+\/\/ quxString will be in the resolved refererences array only if ResolvedReferencesTestApp is archived\n+public class ResolvedReferencesWb {\n@@ -58,3 +63,0 @@\n-        \/\/ CDS resolves all of the string literals used by the app and stores\n-        \/\/ them inside the resolvedReferences array. The strings fooString and\n-        \/\/ barString must have been found but not quxString unless ResolvedReferencesTestApp is archived.\n@@ -62,0 +64,2 @@\n+            \/\/ CDS eagerly resolves all the string literals in the ConstantPool. At this point, all\n+            \/\/ three strings should be in the resolvedReferences array.\n@@ -66,0 +70,5 @@\n+            \/\/ If the class is not archived, the string literals in the ConstantPool are resolved\n+            \/\/ on-demand. At this point, ResolvedReferencesTestApp::<clinit> has been executed\n+            \/\/ so the two strings used there should be in the resolvedReferences array.\n+            \/\/ ResolvedReferencesTestApp::qux() is not executed so \"quxString\"\n+            \/\/ should not yet be resolved.\n","filename":"test\/hotspot\/jtreg\/runtime\/cds\/appcds\/sharedStrings\/ResolvedReferencesWb.java","additions":13,"deletions":4,"binary":false,"changes":17,"status":"modified"}]}