{"files":[{"patch":"@@ -1313,9 +1313,8 @@\n-     * The class implements a buffered output stream for compressed data.\n-     * This class is used inside HeapHprofBinWritter only for compressed\n-     * segment data.\n-     * Because the current implementation of segment heap dump has to modify\n-     * the segment size before finish, and it is hard to modify the data after\n-     * written to gzipped file, This class fisrt save the uncompressed data\n-     * into an internal buffer, and then write through to the GZIPOutputStream\n-     * when the whole segment data are ready.\n-     * The Internal buffer will extend size when the segment length exceeds the\n+     * The class implements a buffered output stream for compressed segment data.\n+     * It is used inside HeapHprofBinWritter only for heap dump.\n+     * Because the current implementation of segment heap dump needs to update\n+     * the segment size at segment header, and because it is hard to modify the\n+     * compressed data after they are written to file, this class first saves the\n+     * uncompressed data into an internal buffer, and then writes through to the\n+     * GZIPOutputStream when the whole segment data are ready and the size is updated.\n+     * The Internal buffer size will be extended when the segment length exceeds the\n@@ -1323,2 +1322,2 @@\n-     * This class defines a switch to turn on\/off the segment mode. if turn off,\n-     * it behaves same as a BufferedOutputStream.\n+     * This class defines a switch to turn on\/off the segment mode. if turned off,\n+     * it behaves same as BufferedOutputStream.\n@@ -1376,1 +1375,0 @@\n-                    \/\/ At the begining of the segment.\n@@ -1379,1 +1377,0 @@\n-                    \/\/ Enlarge segmentbuffer when it is not enough\n@@ -1471,1 +1468,2 @@\n-        \/\/ The buffer size for BufferedOutputStream. Used when gzipped heap dump is enabled.\n+        \/\/ The buffer size for segmentBuffer. used to save data when gzipped heap dump is\n+        \/\/ enabled.\n@@ -1473,2 +1471,2 @@\n-        \/\/ data, making the segment within this size could help rewrite the data size before\n-        \/\/ the segment data are written to GZIPOutputStream\n+        \/\/ data, making the segment data stored in this buffer could help rewrite the data\n+        \/\/ size before the segment data are written to GZIPOutputStream\n@@ -1483,1 +1481,1 @@\n-        \/\/ segment dump data support\n+        \/\/ segment support\n","filename":"src\/jdk.hotspot.agent\/share\/classes\/sun\/jvm\/hotspot\/utilities\/HeapHprofBinWriter.java","additions":15,"deletions":17,"binary":false,"changes":32,"status":"modified"}]}