{"files":[{"patch":"@@ -65,1 +65,5 @@\n- * sharing, for all requests sent through it.\n+ * sharing, for all requests sent through it. An {@code HttpClient} instance\n+ * typically manages its own pools of connections, which it may then reuse\n+ * as and when necessary. Connection pools are  typically not shared between\n+ * {@code HttpClient} instances. Creating a new client for each operation,\n+ * though possible, will usually prevent reusing such connections.\n@@ -137,6 +141,0 @@\n- * An {@code HttpClient} instance typically manages its own pools of\n- * connections, which it can typically reuse when another request is made to\n- * the same origin server using the same protocol version and security,\n- * through the same client. In the JDK implementation, connection pools\n- * are not shared between {@code HttpClient} instances. Creating a new client\n- * for each operation, though possible, will prevent reusing such connections.\n@@ -751,1 +749,2 @@\n-     * operations are completed, but no new request will be accepted.\n+     * operations are run to completion, but no new request will be\n+     * accepted.\n@@ -769,2 +768,6 @@\n-     * request, or the timeout occurs, or the current thread is\n-     * interrupted, whichever happens first.\n+     * request, or the {@code duration} elapses, or the current thread is\n+     * {@linkplain Thread#interrupt() interrupted}, whichever happens first.\n+     *\n+     * <p> This method does not wait if the duration to wait is less than or\n+     * equal to zero. In this case, the method just tests if the thread has\n+     * terminated.\n@@ -790,1 +793,2 @@\n-     * Returns {@code true} if all operations have completed following shut down.\n+     * Returns {@code true} if all operations have completed following\n+     * a shutdown.\n@@ -799,1 +803,1 @@\n-     * @return {@code true} if all tasks have completed following shut down\n+     * @return {@code true} if all tasks have completed following a shutdown\n@@ -809,2 +813,1 @@\n-     * It is called if the thread waiting on {@link #close()} is\n-     * interrupted. An implementation of this method may attempt to\n+     * An implementation of this method may attempt to\n","filename":"src\/java.net.http\/share\/classes\/java\/net\/http\/HttpClient.java","additions":17,"deletions":14,"binary":false,"changes":31,"status":"modified"}]}