{"files":[{"patch":"@@ -45,0 +45,6 @@\n+### Sensitive information (e.g. hs_err.log)\n+\n+It may sound obvious, but avoid placing sensitive information in bug reports. Things like user names, IP addresses, host names, and exact version information of third party libraries etc may be crucial to be able to debug in some cases, but could also help an attacker gain information about your system. JBS is a public database that anyone can search, so be mindful of what you place there. In particular when attaching log files like the hs_err.log you should make sure that you are comfortable with sharing the details exposed in it. Sometimes it may be better to leave a comment saying that these details can be obtained on request.\n+\n+If you file a bug through the [Bug Report Tool](https:\/\/bugreport.java.com\/) there's a specific field that should be used to place sensitive information like this. Information placed there will not be part of the public bug report.\n+\n","filename":"src\/guide\/jbs-jdk-bug-system.md","additions":6,"deletions":0,"binary":false,"changes":6,"status":"modified"},{"patch":"@@ -66,0 +66,1 @@\n+* Make yourself a watcher of JDK-xxx so that you get a notification when it's forward ported\n@@ -69,1 +70,1 @@\n-There are also examples in JBS where JDK-yyy has been created as a sub-task of JDK-xxx. This works, but isn't recommended since JDK-yyy stands a higher risk of being missed when it's not of type *Bug* but rather a *sub-task* of an already closed issue. Also see [Backing out a change](#backing-out-a-change) for reference.\n+There are examples in JBS where JDK-yyy has been created as a sub-task of JDK-xxx. This is **not** recommended since JDK-yyy stands a higher risk of being missed when it's not of type *Bug* but rather a *sub-task* of an already closed issue. In general it's not recommended to have open sub-tasks of closed issues - an issue shouldn't be closed unless all it's sub-tasks are closed. Also see [Backing out a change](#backing-out-a-change) for reference.\n","filename":"src\/guide\/the-jdk-release-process.md","additions":2,"deletions":1,"binary":false,"changes":3,"status":"modified"}]}