{"files":[{"patch":"@@ -587,1 +587,1 @@\n-<h5 id=\"macos\">MacOS<\/h5>\n+<h5 id=\"macos\">macOS<\/h5>\n@@ -610,4 +610,4 @@\n-<p>Most part of automated Client UI tests use Robot API to control the\n-UI. Usually the default operating system settings need to be adjusted\n-for correct work of Robot functionality. The detailed steps how to\n-access and update that settings for different platforms are provided\n+<p>Most automated Client UI tests use <code>Robot<\/code> API to control\n+the UI. Usually, the default operating system settings need to be\n+adjusted for Robot to work correctly. The detailed steps how to access\n+and update these settings for different platforms are provided\n@@ -615,7 +615,7 @@\n-<h5 id=\"macos-1\">MacOS<\/h5>\n-<p>Robot functionality is not permitted to control your Mac by default\n-starting from MacOS 10.15. To enable it choose Apple menu; System\n-Settings, click Privacy &amp; Security; select Accessibility and ensure\n-the following apps are allowed to control your computer:\n-<code>Java<\/code> and <code>Terminal<\/code>. If the tests are run from\n-an IDE, the IDE should be granted this permission too.<\/p>\n+<h5 id=\"macos-1\">macOS<\/h5>\n+<p><code>Robot<\/code> is not permitted to control your Mac by default\n+since macOS 10.15. To allow it, choose Apple menu -&gt; System Settings,\n+click Privacy &amp; Security; then click Accessibility and ensure the\n+following apps are allowed to control your computer: <em>Java<\/em> and\n+<em>Terminal<\/em>. If the tests are run from an IDE, the IDE should be\n+granted this permission too.<\/p>\n@@ -623,6 +623,10 @@\n-<p>On Windows there is a delay in focus transfer. Usually it causes\n-automated UI test failure. To discard the delay type\n-<code>regedit<\/code> in the Search and then select Registry Editor;\n-navigate to the following key:\n-<code>HKEY_CURRENT_USER\\Control Panel\\Desktop\\ForegroundLockTimeout<\/code>;\n-make sure its value is set to 0.<\/p>\n+<p>On Windows if Cygwin terminal is used to run the tests, there is a\n+delay in focus transfer. Usually it causes automated UI test failure. To\n+disable the delay, type <code>regedit<\/code> in the Search and then\n+select Registry Editor; navigate to the following key:\n+<code>HKEY_CURRENT_USER\\Control Panel\\Desktop<\/code>; make sure the\n+<code>ForegroundLockTimeout<\/code> value is set to 0.<\/p>\n+<p>Additional information about Client UI tests configuration for vrious\n+operating systems can be obtained at [Automated client GUI testing\n+system set up requirements]\n+(https:\/\/wiki.openjdk.org\/display\/ClientLibs\/Automated+client+GUI+testing+system+set+up+requirements)<\/p>\n","filename":"doc\/testing.html","additions":22,"deletions":18,"binary":false,"changes":40,"status":"modified"},{"patch":"@@ -616,1 +616,1 @@\n-##### MacOS\n+##### macOS\n@@ -645,3 +645,3 @@\n-Most part of automated Client UI tests use Robot API to control the UI. Usually\n-the default operating system settings need to be adjusted for correct work of\n-Robot functionality. The detailed steps how to access and update that settings\n+Most automated Client UI tests use `Robot` API to control the UI. Usually,\n+the default operating system settings need to be adjusted for Robot\n+to work correctly. The detailed steps how to access and update these settings\n@@ -650,1 +650,1 @@\n-##### MacOS\n+##### macOS\n@@ -652,4 +652,4 @@\n-Robot functionality is not permitted to control your Mac by default starting\n-from MacOS 10.15. To enable it choose Apple menu; System Settings, click\n-Privacy & Security; select Accessibility and ensure the following apps are\n-allowed to control your computer: `Java` and `Terminal`. If the tests are run\n+`Robot` is not permitted to control your Mac by default since\n+macOS 10.15. To allow it, choose Apple menu -> System Settings, click\n+Privacy & Security; then click Accessibility and ensure the following apps are\n+allowed to control your computer: *Java* and *Terminal*. If the tests are run\n@@ -660,5 +660,9 @@\n-On Windows there is a delay in focus transfer. Usually it causes automated\n-UI test failure. To discard the delay type `regedit` in the Search and then\n-select Registry Editor; navigate to the following key:\n-`HKEY_CURRENT_USER\\Control Panel\\Desktop\\ForegroundLockTimeout`; make sure\n-its value is set to 0.\n+On Windows if Cygwin terminal is used to run the tests, there is a delay in\n+focus transfer. Usually it causes automated UI test failure. To disable the\n+delay, type `regedit` in the Search and then select Registry Editor; navigate\n+to the following key: `HKEY_CURRENT_USER\\Control Panel\\Desktop`; make sure\n+the `ForegroundLockTimeout` value is set to 0.\n+\n+Additional information about Client UI tests configuration for vrious operating\n+systems can be obtained at [Automated client GUI testing system set up\n+requirements] (https:\/\/wiki.openjdk.org\/display\/ClientLibs\/Automated+client+GUI+testing+system+set+up+requirements)\n","filename":"doc\/testing.md","additions":18,"deletions":14,"binary":false,"changes":32,"status":"modified"}]}