{"files":[{"patch":"@@ -84,0 +84,1 @@\n+            System.out.println(code);\n","filename":"hat\/backends\/opencl\/java\/hat\/backend\/OpenCLBackend.java","additions":1,"deletions":0,"binary":false,"changes":1,"status":"modified"},{"patch":"@@ -1,85 +0,0 @@\n-\n-# Babylon\/HAT Intern Project\n-#### Gary Frost - May 11th 2024\n-\n-\n-We recently made available an Openjdk project called [Babylon](https:\/\/openjdk.org\/projects\/babylon)\n-\n-[Babylon Code](https:\/\/github.com\/openjdk\/babylon)\n-\n-\n-This project allows Java developers access to the 'model' of Java methods which have been annotated with `@CodeRelection`, access to the code model allows the developer to analyze the code (possibly to reinterpret), as well as to modify the code (possibly to inject new behaviour, or make it suitable for a execution by a completely different runtime).\n-\n-We (well mostly Paul Sandoz) have collected a number of technical use cases which showcase Babylon, but one that we think is particularly compelling is the notion of using Babylon to help accelerate suitable Java applications using GPU's, or more generallt by allowing execution to be moved to a heterogeneous 'accelerator' device such as a GPU.\n-\n-To this end we also plan to make a `Heterogeneous Accelerator Toolkit` or `HAT` available as a Babylon demonstration project.\n-\n-We demonstrated the concept at JVMLS 2023\n-\n-[Java on GPU's... are we there yet](https:\/\/www.youtube.com\/watch?v=lbKBu3lTftc)\n-\n-[Java On The GPU - Inside Java Newscast #58](https:\/\/www.youtube.com\/watch?v=q8pxRkdKeR0)\n-\n-Our plan is to allow a GPU kernel code to be expressed in Java, and then (using Babylon) convert the code to a form suitable for GPU's.\n-\n-We will also use Babylon to analyse the use of the kernel to minimize data transfers beetween host and accelerator.\n-\n-So given a simple kernel described like this\n-\n-```\n-@CodeReflection\n-public static\n-   void squareKernel(NDRange id, S32Array arr) {\n-       int value = arr.array(id.x);\n-       s32Array.array(id.x, value * value);\n-   }\n-```\n-\n-Javac will generate a Babylon model of this method and the Java runtime will allow us to reflectively access the model.\n-\n-To move compute to a GPU, we need to convert this model into a form that is suitable for the particular hardware we have available.\n-\n-Both CUDA and OpenCL can accept `kernels` written in a C99 variant.  In fact using just a few #defines  and typedefs we can generate C99 code which is valid for both CUDA and OpenCL backends.\n-\n-Ideally though we would prefer not to generate C99 intermediate source.  We would prefer to target the intermediate format used by the various backends.\n-\n-Intel have generously contributed a [SPIRV](https:\/\/www.khronos.org\/spir\/) prototype backend for Babylon\/HAT, which takes a Babylon code model and generats SPIRV code. This code is the intermediate form that  OpenCL and [Sycl](https:\/\/www.intel.com\/content\/www\/us\/en\/developer\/tools\/oneapi\/data-parallel-c-plus-plus.html#gs.97r3zh) use to offload to their hardware and is part of Intels [One API](https:\/\/www.intel.com\/content\/www\/us\/en\/developer\/tools\/oneapi\/overview.html#gs.97r51v) programming domain.\n-\n-For NVida devices we would like to generate a [PTX](https:\/\/docs.nvidia.com\/cuda\/parallel-thread-execution\/index.html) backend. PTX is (well one of..) the forms that NVidia use to turn CUDA code into a form suitable for their hardware.\n-\n-So for this project, we would like to create a library toolkit (using Babylon and existing HAT infrastructure) to generate PTX from a captured Babylon kernel code model.\n-\n-I think the SPIRV contribution is a nice place to start.\n-\n-Here is a link to the code in the Babylon repo.\n-\n-[SPIRV Babylon Code](https:\/\/github.com\/openjdk\/babylon\/tree\/code-reflection\/cr-examples\/spirv)\n-\n-I would suggest the following steps to start with\n-\n-1) Setup dev environment and build Babylon (from the OpenJDK github link above)\n-2) Pull the HAT repo from `orahub` and setup a dev enviroment (Intellij is probably easiest).\n-\n-The above steps can be performed on the Mac Oracle has provided.\n-\n-3) Get access to a machine with NVdia toolchain (nvcc compiler and runtime)\n-\n-We are working on this step ;)\n-\n-4) We will use a few of the HAT demos to generate kernel code models, and create a PTX backend.\n-\n-5) You should spend a little time reading the PTX spec, Pauls various Babylon talks and\n-\n-6) Build some of the simpler [Cuda Samples](https:\/\/github.com\/NVIDIA\/cuda-samples\/) and become and generate PTX to become familiar with the relationship between the CUDA C99 style source and generated code.\n-\n-7) Code test code test repeat ;)\n-\n-\n-Some interesting links.\n-\n-[Cuda Compiler Driver](https:\/\/docs.nvidia.com\/cuda\/cuda-compiler-driver-nvcc\/index.html#virtual-architectures)\n-\n-[NVPTX Usage](https:\/\/llvm.org\/docs\/NVPTXUsage.html)\n-\n-\n-\n","filename":"hat\/docs\/ruby.md","additions":0,"deletions":85,"binary":false,"changes":85,"status":"deleted"},{"patch":"@@ -440,1 +440,1 @@\n-                                    if (nameAndArrayOfType.arraySize >= 0) {\n+                                    if (nameAndArrayOfType.arraySize > 0) {\n@@ -442,0 +442,2 @@\n+                                    }else{\n+                                        literal(1);\n","filename":"hat\/hat\/src\/java\/hat\/backend\/c99codebuilders\/C99HatBuilder.java","additions":3,"deletions":1,"binary":false,"changes":4,"status":"modified"}]}