{"files":[{"patch":"@@ -41,1 +41,1 @@\n- * <p> Whether a virtual machine has a console is dependent upon the\n+ * <p> Whether a virtual machine's console exists is dependent upon the\n@@ -45,1 +45,1 @@\n- * output streams then its console will exist and will typically be\n+ * output streams, then its console will generally exist and will be\n@@ -47,3 +47,4 @@\n- * was launched.  If the virtual machine is started automatically, for\n- * example by a background job scheduler, then it may not\n- * have a console.\n+ * was launched. If the standard input or standard output have been\n+ * redirected (for example, to a file or to a pipe), or if the virtual\n+ * machine was started from a background job scheduler, the console\n+ * will not exist.\n@@ -51,4 +52,3 @@\n- * If this virtual machine has a console then it is represented by a\n- * unique instance of this class which can be obtained by invoking the\n- * {@link java.lang.System#console()} method.  If no console device is\n- * available then an invocation of that method will return {@code null}.\n+ * If the console exists, then it is represented by a unique instance of this\n+ * class which can be obtained by invoking the {@link System#console()} method.\n+ * If the console does not exist, that method will return {@code null}.\n@@ -538,7 +538,3 @@\n-     * This method returns {@code true} if the console device, associated with the current\n-     * Java virtual machine, is a terminal, typically an interactive command line\n-     * connected to a keyboard and display.\n-     *\n-     * @implNote The default implementation returns the value equivalent to calling\n-     * {@code isatty(stdin\/stdout)} on POSIX platforms, or whether standard in\/out file\n-     * descriptors are character devices or not on Windows.\n+     * This method always returns {@code true}, since {@link System#console()}\n+     * provides a {@code Console} instance only when both standard input and\n+     * output are unredirected, that is, when running in an interactive terminal.\n@@ -549,1 +545,1 @@\n-        return istty;\n+        return true;\n","filename":"src\/java.base\/share\/classes\/java\/io\/Console.java","additions":13,"deletions":17,"binary":false,"changes":30,"status":"modified"}]}