{"files":[{"patch":"@@ -419,2 +419,2 @@\n- * the parameter list. The corresponding argument layout, and all following argument layouts in the specialized function\n- * descriptor, are called <em>variadic argument layouts<\/em>. For a prototype-less function, the index passed to\n+ * the parameter list. The corresponding argument layout (if any), and all following argument layouts in the specialized\n+ * function descriptor, are called <em>variadic argument layouts<\/em>. For a prototype-less function, the index passed to\n@@ -647,4 +647,19 @@\n-         * {@return a linker option used to denote the index of the first variadic argument layout in the\n-         *          function descriptor associated with a downcall linkage request}\n-         * @param index the index of the first variadic argument layout in the function descriptor associated\n-         *              with a downcall linkage request.\n+         * {@return a linker option used to denote the index indicating the start of the variadic arguments passed to the\n+         *          function described by the function descriptor associated with a downcall linkage request}\n+         * <p>\n+         * The {@code index} value must conform to {@code 0 <= index <= N}, where {@code N} is the number of argument\n+         * layouts of the function descriptor used in conjunction with this linker option. When the {@code index} is:\n+         * <ul>\n+         * <li>{@code 0}, all arguments passed to the function are passed as variadic arguments<\/li>\n+         * <li>{@code N}, none of the arguments passed to the function are passed as variadic argument<\/li>\n+         * <li>{@code n}, where {@code 0 < m < N}, the arguments {@code m..N} are passed as variadic arguments<\/li>\n+         * <\/ul>\n+         * It is important to always use this linker option when linking a <a href=Linker.html#variadic-funcs>variadic\n+         * function<\/a>, even when none of the arguments are passed as variadic arguments (the second case in the list\n+         * above), as this affects the linking process on certain platforms.\n+         *\n+         * @implNote The index value is validated when making a linkage request, which is when the function descriptor\n+         *           against which the index is validated is available.\n+         *\n+         * @param index the index indicating the start of the variadic arguments passed to the function described by\n+         *              the function descriptor used in conjunction with this linker option.\n","filename":"src\/java.base\/share\/classes\/java\/lang\/foreign\/Linker.java","additions":21,"deletions":6,"binary":false,"changes":27,"status":"modified"}]}