{"files":[{"patch":"@@ -81,1 +81,1 @@\n-* If the failure isn't reproducible with an existing OpenJDK test, attach a reproducer if possible, while in a number of cases it isn't possible, having a test case will decrease the time required to resolve the issue.\n+* If the failure isn't reproducible with an existing OpenJDK test, attach a reproducer if possible, having a test case will decrease the time required to resolve the issue.\n@@ -182,1 +182,1 @@\n-1. If the issue is incomplete, add a comment noting what is needed and close the bug as [Resolved]{.jbs-field} - 'Incomplete'. If no more information is obtained within reasonable time, the issue should be closed ([Closed]{.jbs-field} - `Incomplete`).\n+1. If the issue is incomplete, add a comment noting what is needed and close the bug as [Resolved]{.jbs-field} - `Incomplete`. If no more information is obtained within reasonable time, the issue should be closed ([Closed]{.jbs-field} - `Incomplete`).\n@@ -199,1 +199,1 @@\n-    1. bugs where behavior has _incorrectly_ changed from a previous release : 'regression'\n+    1. bugs where behavior has _incorrectly_ changed from a previous build or release : 'regression'\n@@ -219,1 +219,1 @@\n-), this is especially helpful if you ultimately move the Issue to a different area as you have found that the problem lies elsewhere, or is closed as [Will Not Fix]{.jbs-field}.  Your updates then provide a resource to others to better understand what has been done or the code. See [The Importance of Writing Stuff Down](https:\/\/stuartmarks.wordpress.com\/2023\/02\/22\/the-importance-of-writing-stuff-down) for a good explanation as to why it is also important to write an evaluation when something is not fixed.\n+), this is especially helpful if you ultimately move the Issue to a different area as you have found that the problem lies elsewhere, or is closed as [Will Not Fix]{.jbs-field}.  Your updates then provide a resource to others to better understand what has been done or the code. See [The Importance of Writing Stuff Down](https:\/\/stuartmarks.wordpress.com\/2023\/02\/22\/the-importance-of-writing-stuff-down) for a good explanation as to why it is important.\n@@ -247,1 +247,1 @@\n-    <td class=\"dictionary\">Where the same issue is described in another issue then close one against the other as a [Duplicate]{.jbs-field}. In general the new issue is closed as a duplicate of the older one, but where the newer issue has a clearer description then doing it the other way round is ok<\/td>\n+    <td class=\"dictionary\">Where the same issue is described in another issue then close one against the other as a [Duplicate]{.jbs-field}. In general the new issue is closed as a duplicate of the older one, but where the newer issue has a clearer description then doing it the other way round is ok. Remember to add a [duplicates]{.jbs-field} link - not a [relates to]{.jbs-field} link<\/td>\n@@ -267,1 +267,1 @@\n-    <td class=\"dictionary\">Use where the issue is due to a problem in a Java library (not shipped with the JDK), an IDE or other external tool etc. where known it is good to provide a link to the site where the issue should be reported.<\/td>\n+    <td class=\"dictionary\">Use where the issue is due to a problem in a Java library (not shipped with the JDK), an IDE or other external tool etc. where known, it is good to provide a link to the site where the issue should be reported.<\/td>\n@@ -664,1 +664,1 @@\n-      Used to identify regressions. A regression is where behavior has _incorrectly_ changed from a previous release. Ideally all regressions must be fixed in the following release. All regressions must have the [Affects Version\/s]{.jbs-field} set.\n+      Used to identify regressions. A regression is where behavior has _incorrectly_ changed from a previous build or release. Ideally all regressions must be fixed in the following release. All regressions must have the [Affects Version\/s]{.jbs-field} set.\n","filename":"src\/guide\/jbs-jdk-bug-system.md","additions":7,"deletions":7,"binary":false,"changes":14,"status":"modified"}]}