{"files":[{"patch":"@@ -22,1 +22,1 @@\n-1. Download and install JDK24 for macOS. You can use the JDK you just built targeting macOS in the above note instead, but this is not recommended.\n+1. Download and install JDK24 for macOS. You can use the JDK you just built targeting macOS in the above note instead.\n@@ -41,3 +41,3 @@\n---with-libffi-include=<support-dir-absolute-path>\/libffi\/include \\\n---with-libffi-lib=<support-dir-absolute-path>\/libffi\/libs \\\n---with-cups-include=<support-dir-absolute-path>\/cups-2.3.6\n+--with-libffi-include=<support-dir-path>\/libffi\/include \\\n+--with-libffi-lib=<support-dir-path>\/libffi\/libs \\\n+--with-cups-include=<support-dir-path>\/cups-2.3.6\n@@ -47,3 +47,3 @@\n-If you need to tell configure the path of the boot JDK, or if configure fails with an error saying\n-it can't find the boot JDK, for instance if you downloaded a JDK in compressed archive form rather\n-than with an installer, you can pass the following option to configure:\n+If you need to tell configure the path of your boot JDK, or if configure fails with an error saying\n+it can't find a boot JDK, for instance if you downloaded a JDK in compressed archive form rather\n+than with an installer, you can pass `--with-boot-jdk=<java-directory-path>` to configure:\n@@ -51,3 +51,5 @@\n-```\n---with-boot-jdk=<java-directory-absolute-path>\n-```\n+For iOS the default JVM used is Zero, since iOS has no writeable and executable sections. However, if\n+you plan to run the JDK on the simulator for testing purposes, you can use the other JVM variants such\n+as Server. To do this, pass `--with-jvm-variants=server` to configure (Or any other valid option, which\n+are, in no particular order: server, client, minimal, core, zero, custom). Do note that passing zero to\n+this option is redundant since Zero is already the default for iOS.\n","filename":"README.md","additions":12,"deletions":10,"binary":false,"changes":22,"status":"modified"},{"patch":"@@ -81,4 +81,0 @@\n-  if test \"x$OPENJDK_TARGET_OS\" = xios; then\n-    VALID_JVM_VARIANTS=\"zero\"\n-  fi\n-\n","filename":"make\/autoconf\/hotspot.m4","additions":0,"deletions":4,"binary":false,"changes":4,"status":"modified"}]}