{"files":[{"patch":"@@ -2,1 +2,1 @@\n-# Copyright (c) 2017, 2024, Oracle and\/or its affiliates. All rights reserved.\n+# Copyright (c) 2017, 2025, Oracle and\/or its affiliates. All rights reserved.\n@@ -348,0 +348,40 @@\n+\n+## jlink Supported use-cases\n+\n+### Version-specific requirement\n+\n+The `jlink` tool that ships with the JDK is designed to work when using\n+JDK [JMOD files](https:\/\/openjdk.org\/jeps\/261#Packaging:-JMOD-files) created from the\n+same codebase.  This means, for example, that the `jlink` binary found on Oracle's JDK 17.0.5 will\n+only be able to use JDK JMOD files from Oracle's JDK 17.0.5.  It is not designed to accept JMOD files\n+from other JDK versions, even if they are from the same Feature release.  e.g. It is not guaranteed to\n+work with the JMOD files from JDK 17.0.4 or even from the JMOD files\n+from [JDK 17.0.5.0.1](https:\/\/www.oracle.com\/java\/technologies\/javase\/17-0-5-relnotes.html#R17_0_5_1-BPR) (a\n+Bundle Patch Release -based on Oracle JDK 17.0.5).\n+\n+### No cross-vendor compatibility\n+\n+Different JDK distributions are not guaranteed to be produced from the same code base.  It is expected that\n+vendors modify their code base -for example to personalize the build properties with their own information- so\n+the JMOD files from one distribution might not be accepted by the `jlink` binary from a different one, even if\n+the `jlink` and JMOD files versions match.\n+\n+### Cross-Platform linking\n+\n+The Oracle JDK `jlink` binary from a particular platform (e.g. Linux aarch64) accepts\n+Oracle JDK JMOD files from other Oracle JDK platforms (e.g. Windows x64) as long as `jlink` and the JMOD files\n+come from the same JDK version.   This allows for a single build pipeline to produce custom runtimes\n+for all platforms supported by the Oracle JDK.\n+\n+If users need to support platforms with JMOD files from more than one Java provider\n+(e.g. use the Oracle JDK for Linux x86-64 and Linux aarch64 while using some other vendor's builds for an\n+operating system or architecture that Oracle doesn't support) they should use a separate build pipeline\n+for Oracle JDK JMOD files and follow the other vendor's recommendations to set up a build pipeline or pipelines\n+for the other vendor's supported platforms.  The cross-platform linking option supported by Oracle's JDK is not a\n+requirement for jlink so it's possible that other vendors do not offer it.\n+\n+### User-created JMOD files\n+\n+User-created JMOD files are not subject to the constraints listed above.  User-created JMOD files are\n+similar to modular jars: `jlink` accepts user created JMOD files built with the same or earlier JDK version\n+regardless of which distribution was used to create the JMOD files.\n","filename":"src\/jdk.jlink\/share\/man\/jlink.md","additions":41,"deletions":1,"binary":false,"changes":42,"status":"modified"}]}