{"files":[{"patch":"@@ -112,1 +112,1 @@\n-* **Javadoc comments are specifications** -- The Java API Specification is authored in the form of javadoc comments, so even apparently innocuous changes to comments can be quite significant. It's not always easy to tell what comments are part of the specification and what parts are merely code comments. Briefly, documentation comments on public packages, classes, and class members of exported modules are specifications.\n+* **JavaDoc comments are specifications** -- The Java API Specification is authored in the form of javadoc comments, so even apparently innocuous changes to comments can be quite significant. It's not always easy to tell what comments are part of the specification and what parts are merely code comments. Briefly, documentation comments on public packages, classes, and class members of exported modules are specifications.\n","filename":"src\/guide\/contributing-to-an-open-jdk-project.md","additions":1,"deletions":1,"binary":false,"changes":2,"status":"modified"},{"patch":"@@ -29,1 +29,1 @@\n-   * The [Summary]{.jbs-field} should be a one sentence synopsis that is informative (and concise) enough to attract the attention of users, developers, and maintainers who might be impacted by the change. It should succinctly describe what has actually changed, not be the original bug title, nor describe the problem that was being solved. It should read well as a sub-section heading in a document.\n+   * The [Summary]{.jbs-field} should be a one sentence synopsis that is informative (and concise) enough to attract the attention of users, developers, and maintainers who might be impacted by the change. It should succinctly describe what has actually changed, not be the original bug title, nor describe the problem that was being solved. It should read well as a subsection heading in a document.\n@@ -31,1 +31,1 @@\n-   * Enter the text of the release note in the [Description]{.jbs-field} field using markdown formatting, following the [CommonMark specification](https:\/\/spec.commonmark.org\/current\/). While the markdown won't be rendered in JBS, you can use [dingus](https:\/\/spec.commonmark.org\/dingus\/) to see what the release note will look like. Note that [Github style ascii table formatting](https:\/\/docs.github.com\/en\/get-started\/writing-on-github\/working-with-advanced-formatting\/organizing-information-with-tables) is supported but will not display correctly in the dingus page. For more information see [General Conventions for Release Notes] below.\n+   * Enter the text of the release note in the [Description]{.jbs-field} field using Markdown formatting, following the [CommonMark specification](https:\/\/spec.commonmark.org\/current\/). While the markdown won't be rendered in JBS, you can use [dingus](https:\/\/spec.commonmark.org\/dingus\/) to see what the release note will look like. Note that [GitHub style ascii table formatting](https:\/\/docs.github.com\/en\/get-started\/writing-on-github\/working-with-advanced-formatting\/organizing-information-with-tables) is supported but will not display correctly in the dingus page. For more information see [General Conventions for Release Notes] below.\n@@ -42,1 +42,1 @@\n-If you see an issue you feel should have a release note but you are not the assignee of the bug, then add the label [release-note=yes]{.jbs-label} to the main bug (not on a backport nor a sub-task). This acts as a flag to make sure that the release note is considered. This can be done even with fixes that have been shipped already if it's noticed that there is confusion around the change. If, after discussion, it's decided that a release note isn't required either remove the label, or change it to [release-note=no]{.jbs-label} if it makes sense to have a clear indication that a release note isn't required for the fix. The label [release-note=yes]{.jbs-label} can be removed once the release note sub-task has been created.\n+If you see an issue you feel should have a release note, but you are not the assignee of the bug, then add the label [release-note=yes]{.jbs-label} to the main bug (not on a backport, nor a sub-task). This acts as a flag to make sure that the release note is considered. This can be done even with fixes that have been shipped already if it's noticed that there is confusion around the change. If, after discussion, it's decided that a release note isn't required either remove the label, or change it to [release-note=no]{.jbs-label} if it makes sense to have a clear indication that a release note isn't required for the fix. The label [release-note=yes]{.jbs-label} can be removed once the release note sub-task has been created.\n@@ -70,0 +70,29 @@\n+## Linking options within a release note\n+\n+As well as the standard [CommonMark link types](https:\/\/spec.commonmark.org\/0.31.2\/#links) the following custom links are supported:\n+\n+### Linking of JBS issues\n+\n+  * Any JBS ID of the form `JDK-NNNNNNN` will be linked.\n+\n+### Linking to the Java documentation\n+\n+  * The linking options similar to those for [JavaDoc MarkDown](https:\/\/openjdk.org\/jeps\/467#Links) are supported.\n+  * Linking to the JDK tools is supported - differentiate between `[JarSigner]` the class, and `[jarsigner]` the tool, the tool reference should be in all lowercase.\n+  * Linking to the JDK tools command line arguments is supported for JDK 27 and above, for example `[-XX:+UseTransparentHugePages]`\n+  * Method names do not need to be prefixed with their class name if they are unique within the JDK, for example '[getTotalGcCpuTime()]'. Where there are multiple methods with the same name, a plain reference to the method can be achieved with '[enquoteIdentifier][Statement.enquoteIdentifier]'\n+  * Links of the form `[NumberFormat.setStrict]`, `[NumberFormat.setStrict(boolean)]`, `[NumberFormat.setStrict(true)]`, `[ofFileChannel(FileChannel channel, long offset, long length)]` are supported with any of the separators `[.]`, `[#]` and `[::]`.\n+  * If a link cannot be found then the string will be rendered as if it had been enclosed in back-ticks and, in the EA release notes only, the string \"(link not found)\" will be added.\n+  * For notes of the type `rn-removed` if a link is not found then it will be looked for in the JavaDoc of the previous release family.\n+  * If a sequence that contains `[]` should not be treated as a link such as 'm[s]' then precede the opening square bracket with a backslash `m\\\\[s]`.\n+\n+### Manually linking to the Java documentation\n+\n+When manually adding a link to the Java documentation, put the full link to docs.oracle.com (either the existing page, or what will be the page at GA), for example:\n+\n+`https:\/\/docs.oracle.com\/en\/java\/javase\/26\/docs\/specs\/jar\/jar.html`\n+\n+and, in the EA versions of the release notes, any links which refer the to feature release under development will be translated to:\n+\n+`https:\/\/download.java.net\/java\/early_access\/jdk26\/docs\/specs\/jar\/jar.html`\n+\n","filename":"src\/guide\/release-notes.md","additions":32,"deletions":3,"binary":false,"changes":35,"status":"modified"}]}