{"files":[{"patch":"@@ -492,3 +492,5 @@\n-\/\/ choice, then use it. CreateEx nodes must start their blocks and are selected\n-\/\/ eagerly. After them, projections take top priority for correctness. Next\n-\/\/ after projections are constants and CheckCastPP nodes. There are a number of\n+\/\/ choice, then use it. CreateEx nodes that are initially ready must start their\n+\/\/ blocks and are given the highest priority, by being placed at the beginning\n+\/\/ of the worklist. Next after initially-ready CreateEx nodes are projections,\n+\/\/ which must follow their parents, and CreateEx nodes with local input\n+\/\/ dependencies. Next are constants and CheckCastPP nodes. There are a number of\n@@ -532,3 +534,6 @@\n-    if (iop == Op_CreateEx) {\n-      \/\/ CreateEx must start the block (after Phi and Parm nodes which are\n-      \/\/ pre-scheduled): select it right away.\n+    if (iop == Op_CreateEx || n->is_Proj()) {\n+      \/\/ CreateEx nodes that are initially ready must start the block (after Phi\n+      \/\/ and Parm nodes which are pre-scheduled) and get top priority. This is\n+      \/\/ currently enforced by placing them at the beginning of the initial\n+      \/\/ worklist and selecting them eagerly here. After these, projections and\n+      \/\/ other CreateEx nodes are selected with equal priority.\n@@ -539,5 +544,1 @@\n-    uint n_choice = 2;\n-    if (n->is_Proj()) {\n-      \/\/ Projections should follow their parents.\n-      n_choice = 5;\n-    } else if (n->Opcode() == Op_Con || iop == Op_CheckCastPP) {\n+    if (n->Opcode() == Op_Con || iop == Op_CheckCastPP) {\n@@ -545,8 +546,3 @@\n-      \/\/ the nodes tested below.\n-      n_choice = 4;\n-    }\n-\n-    if (n_choice >= 4 && choice < n_choice) {\n-      \/\/ n is a constant, a projection, or a CheckCastPP node: record as current\n-      \/\/ winner, but keep looking for higher-priority nodes in the worklist.\n-      choice  = n_choice;\n+      \/\/ the nodes tested below. Record as current winner, but keep looking for\n+      \/\/ higher-priority nodes in the worklist.\n+      choice  = 4;\n@@ -578,0 +574,2 @@\n+    uint n_choice = 2;\n+\n@@ -1081,0 +1079,4 @@\n+      } else if (m->is_Mach() && m->as_Mach()->ideal_Opcode() == Op_CreateEx) {\n+        \/\/ Place CreateEx nodes that are initially ready at the beginning of the\n+        \/\/ worklist so they are selected first and scheduled at the block start.\n+        worklist.insert(0, m);\n","filename":"src\/hotspot\/share\/opto\/lcm.cpp","additions":21,"deletions":19,"binary":false,"changes":40,"status":"modified"}]}