{"files":[{"patch":"@@ -520,1 +520,1 @@\n-     * Resolves a path or a sequence of paths against this path.\n+     * Resolves a path, or a sequence of paths against this path.\n@@ -523,4 +523,3 @@\n-     * by resolving the first parameter path against this path, then\n-     * resolving the second parameter path against the derived path,\n-     * and so on until all parameters have been processed. Each single\n-     * resolution in the chain behaves as specified by {@linkplain\n+     * by resolving the first parameter path against this path, and then\n+     * repeating the same procedure for each path in the sequence. Each\n+     * single resolution in the chain behaves as specified by {@link\n@@ -557,4 +556,2 @@\n-     * Converts a path string or a sequence of path strings into one or more\n-     * {@code Path}s and resolves them against this {@code Path} in exactly\n-     * the same manner specified by the {@link #resolve(Path,Path...) resolve}\n-     * method.\n+     * Resolves the path or paths converted from a path string, or a\n+     * sequence of path strings, against this path.\n@@ -562,6 +559,5 @@\n-     * <p> The result of this method is the same as would be obtained\n-     * by resolving the first parameter path string against this path, then\n-     * resolving the second parameter path string against the derived path,\n-     * and so on until all parameters have been processed. Each single\n-     * resolution in the chain behaves as specified by {@linkplain\n-     * #resolve(String) resolve}.\n+     * <p> The result of this method is the same as would be obtained by\n+     * resolving the path converted from the first path string against\n+     * this path, and then repeating the same procedure for each path\n+     * string in the sequence. Each single resolution in the chain\n+     * behaves as specified by {@link #resolve(String) resolve}.\n@@ -585,1 +581,1 @@\n-     *          if the path string cannot be converted to a Path.\n+     *          if a path string cannot be converted to a Path.\n","filename":"src\/java.base\/share\/classes\/java\/nio\/file\/Path.java","additions":12,"deletions":16,"binary":false,"changes":28,"status":"modified"}]}